{
  "forumId" : "10",
  "threadId" : "115422",
  "title" : "VANFEST 2016",
  "originalUrl" : "https://ssvc.org.uk/phpbb/viewtopic.php?f=10&t=115422",
  "breadcrumbs" : [ ],
  "totalPosts" : 4,
  "pageNumber" : 1,
  "totalPages" : 1,
  "posts" : [ {
    "postId" : "870443",
    "author" : {
      "username" : "Kempmann",
      "userId" : "870443",
      "joined" : "Tue May 09, 2006 6:30 pm",
      "profileRank" : "Registered user",
      "location" : "-",
      "postCount" : "142",
      "avatarPath" : null
    },
    "content" : "<img src=\"https://scontent-lhr3-1.xx.fbcdn.net/hphotos-xfp1/v/t1.0-9/12654672_1533887013577141_9057198114832249157_n.jpg?oh=3457ed2164988604d7626cd4f6e6c716&amp;oe=5784A613\" class=\"postimage\" alt=\"Image\">\n<br>\n<br>\n<span style=\"font-size: 150%; line-height: 116%;\">VANFEST 2016<br></span>\n<br>\n<br>\n<span style=\"font-size: 150%; line-height: 116%;\">\"A NEW FAMILY FUN WEEKEND EVENT FOR FANS &amp; ENTHUSIASTS OF ALL TYPES OF VANS\"</span>\n<br>\n<br>Just a reminder folks .. \n<br>\n<br>We are having another go at establishing a \n<span style=\"font-weight: bold\">NATIONAL VANFEST</span> event for ALL owners and enthusiasts of \n<span style=\"font-weight: bold\">ALL MAKES of VANS &amp; CAMPERS.</span> (and that includes British, French, American, Italian, Japanese as well as German Vans ) \n<img class=\"smilies\" src=\"./images/smilies/icon_flower.gif\" alt=\":flower:\" title=\"flower\"> \n<br>\n<br>We are presenting the event at the \n<span style=\"font-weight: bold\">THREE COUNTIES SHOWGROUND, MALVERN</span> over the weekend of \n<span style=\"font-weight: bold\">27th – 29th MAY.</span>\n<br>\n<br>This showground is very well facilitated and the perfect place to have an event (in all weathers!). \n<br>\n<br>\n<span style=\"font-weight: bold\">ADVANCE BOOKINGS for CAMPING</span> are already being taken &amp; the Camping areas are filling up. We will be open to \n<span style=\"font-weight: bold\">DAY VISITORS</span> on the Saturday &amp; Sunday. (Please Visit our Website \n<!-- m -->\n<a class=\"postlink\" href=\"http://www.vanfest.org\">http://www.vanfest.org</a>\n<!-- m --> to book for Camping) .\n<br>\n<br>We really do need you to get your bookings in as soon as possible so we can have a better idea as to how things are going (or not) to ensure we have enough facilities (and space) available to make your stay (and ours!) a lot more enjoyable. \n<br>\n<br>We do have a fantastic programme of events and activities lined up. There will be a full range of Tradestands and a Show &amp; Shine . Entertainment for Children and Adults plus some very impressive evening entertainments. \n<br>\n<br>We know that we are up against a calendar that is dominated by VW type events and we still (of course) welcome and expect a lot (many) Volkswagens will come to the “New” VANFEST .\n<br>BUT, we are now hoping to create a whole new type of van event which will be attended by enthusiasts and owners of ALL makes of van and camper where owners of all vans will be able to share ideas and see how things are (or used to be) done with other van &amp; camper manufacturers. This we believe will produce a lot more interesting things for people to look (and talk) about. \n<br>\n<br>We are keen to see an impressive showing of other make vans and campers at Vanfest. With this in mind for the first event (as well as the traditional Show &amp; Shine) we will be presenting a “Malvern Vantasia Vehicle Display” where anybody who wishes can park and display their vehicle and if they want to, promote their club as well. We have the beautiful Severn Hall and the Main Arena available for this.\n<br>\n<br>Having been within the VW Transporter event scene for many years (decades) and part of this and many other clubs, Forums &amp; facebook groups I can see that (underneath!) we are all the same &amp; have similar thoughts, concerns and needs for our beloved vans, all of which can and will be served well by establishing a NATIONAL VANFEST event.\n<br>\n<br>\n<span style=\"font-weight: bold\">LATEST NEWS -</span> \n<br>\n<br>Campers will be able to stopover on the \n<span style=\"font-weight: bold\">SUNDAY</span> night at \n<span style=\"font-weight: bold\">NO</span> extra charge. \n<br>\n<br>This will allow you to go to the \n<span style=\"font-weight: bold\">GIANT FLEA FAIR </span>which will also be on the Three Counties Site on the \n<span style=\"font-weight: bold\">BANK HOLIDAY MONDAY.</span>\n<br>Please note that the Flea Fair is a separate event (not part of VANFEST) so there will be a separate entrance charge to that for that (£4 per person - taken at the Flea Fair Gate on the Day)\n<br>\n<br>Kind Regards \n<br>\n<br>Simon Holloway (VANFEST Coordinator)\n<br>\n<br> \n<img class=\"smilies\" src=\"./images/smilies/icon_cool.gif\" alt=\"8)\" title=\"Cool\"> \n<br>\n<br>\n<!-- m -->\n<a class=\"postlink\" href=\"http://WWW.VANFEST.ORG\">http://WWW.VANFEST.ORG</a>\n<!-- m -->",
    "lastEdited" : "Fri Apr 08, 2016 9:12 pm"
  }, {
    "postId" : "871560",
    "author" : {
      "username" : "Kempmann",
      "userId" : "871560",
      "joined" : "Tue May 09, 2006 6:30 pm",
      "profileRank" : "Registered user",
      "location" : "-",
      "postCount" : "142",
      "avatarPath" : null
    },
    "content" : "<span style=\"font-size: 200%; line-height: 116%;\"><span style=\"font-weight: bold\">VANFEST 2016 - EVENING ENTERTAINMENT</span></span>\n<br>\n<br>\n<br>\n<span style=\"font-size: 150%; line-height: 116%;\">Well, the weeks are ticking by quickly! </span> \n<img class=\"smilies\" src=\"./images/smilies/icon_flower.gif\" alt=\":flower:\" title=\"flower\"> \n<br>\n<br>Just to remind you of some of our evening entertainment in the Severn Hall (the main entertainment venue for this year), and the Teme Hall:\n<br>\n<br>\n<span style=\"font-weight: bold\">We will be using the SEVERN HALL for both indoor DISPLAY AND the MAIN EVENING ENTERTAINMENT.</span>\n<br>\n<br>Some of the “Original” Vanfest (and BVF!) Old timers will probably recall that during the early events we used to present some pretty impressive displays in the Severn Hall (And turn the hall around for Evening Entertainmnet &amp; back into a Display Hall again for the Sunday )\n<br>\n<br>Our Production Manager has been beavering away &amp; has come up with a very impressive selection of Evening Entertainment;\n<br>\n<br>\n<span style=\"font-weight: bold\">VANFEST hits the ground running, with a weekend crammed full of top notch entertainment!</span>\n<br>\n<br>Our main venue is the SEVERN HALL, right in the middle of our festival. There will be lots going on inside during the day, but come the evening, we will transform it into a first class entertainment venue, worthy of the quality acts that we have become world famous for with our sister festival 'BusFest'.\n<br>\n<br>For Vanfest, we will be producing the same quality entertainments, but we'll be doing things differently to the other festivals out there - different acts for a different festival. \n<br>\n<br>Vanfest is unique and so is our philosophy about what we will be bringing you to make sure you have a great weekend, and to make sure that you come back next year for more!\n<br>\n<br>\n<span style=\"font-size: 150%; line-height: 116%;\">IT'S VANFEST FRIDAY - IT'S PARTY NIGHT! <br></span>\n<br>Doors open :19.30. \n<br>DJ 20.00 to 21.30.\n<br>Band: 21.30 to 23.00.\n<br>DJ 23.00 to midnight.\n<br>\n<br>For our first VanFest Friday, we have a 'stonking' band, giving it 'large' – ladies and gentlemen, we give you:\n<br>\n<br>\n<span style=\"font-size: 200%; line-height: 116%;\">THE ONE, THE ONLY - ULTRA 90's!!</span>\n<br>\n<br>\n<span style=\"font-size: 150%; line-height: 116%;\">ULTRA 90's are \"The 1st and ONLY 90's Dance Tribute show in the UK and possibly the world!\"</span>\n<br>\n<br>Ultra 90's is the first and only show of its kind taking you back to the most exciting musical movement in decades - the dance era of the 1990's. It's fresh, new, unique and not to be missed!\n<br>It is easy to forget just how important and exciting dance music seemed during its heyday. These days, people write books and make films about how the mid-90s were the sole domain of guitar-fuelled Britpop. But during exactly the same period, clubs and house music were such big business that they were widely assumed to have changed the British youth's leisure habits forever.\n<br>With very few other acts daring to touch this style of music, Ultra 90s goes where so many of us want to be taken, back to our youth. School days, Uni days, clubbing, first holiday without parents... Even the more mature audiences love this show with its exciting arrangements, powerful vocals and bags of energy.\n<br>\n<br>Supplementing this superb band, our resident DJ “ANDEEJAY” will be laying down his own beats to keep you in the party spirit.\n<br>We don't just want you to be there, we want you to FEEL it, VIBE it, DANCE it!! Get out your dayglo, your furry leg warmers, your hotpants, lightsticks, hoodies, and get into our 90's groove!\n<br>We're 'avin' it! LARGE!!\n<br>\n<br>\n<span style=\"font-size: 150%; line-height: 116%;\">Then, ON SATURDAY NIGHT , we are going where NO OTHER festival has gone! <br><br>Everyone else does bands, but we are bringing you the heady days of variety with a 'never before seen' cabaret night -</span>\n<br>\n<br>\n<span style=\"font-size: 200%; line-height: 116%;\">THE VANFEST CABARET. </span> \n<br>\n<br>Guaranteed to be:\n<br>\n<br>\n<span style=\"font-size: 150%; line-height: 116%;\">“AN EVENING OF TOP QUALITY FUN, AMUSEMENT AND ENTERTAINMENT!!” </span>\n<br>\n<br>Neil Pickett, our Event Director, has designed and put together a fantastic line up that will keep you entertained for several hours throughout the night. Interspersed with music from our resident DJ “ANDEEJAY”\n<br>\n<br>\n<span style=\"font-size: 150%; line-height: 116%;\">Our VANFEST CABARET stars:</span>\n<br>\n<br>\n<br>\n<span style=\"font-size: 200%; line-height: 116%;\">BLOBBIE WILLIAMS. </span>\n<br>\n<br>Tony James (AKA Blobbie Williams) will be our compere for the show, as well as doing his hilarious Robbie Williams act \"Blobbie Williams\".\n<br>\"International Tubby Pop Star! Come Dine With Me Winner. Deal Or No Deal and BGT contestant, CBBC and many more. \n<br>\n<br>\n<span style=\"font-size: 150%; line-height: 116%;\">\"The BIGGEST Robbie Williams Parody/Tribute in the UK!\" </span>\n<br>\n<br>\n<span style=\"font-size: 150%; line-height: 116%;\">PLUS THE FOLLOWING FANTATIC ACTS..... </span>\n<br>\n<br>\n<span style=\"font-weight: bold\">DAVID OAKLEY - Magician and Illusionist. </span>\n<br>David will do close up work, going around the audience, as well as some stage based tricks.\n<br>\"David's interest in magic started as a young child, when he saw somebody demonstrating magic cards. A pack was purchased and the bug bit. The interest was fuelled each year with visits to the Paul Clive Magic shop, Murray's Magic Mart and The House of Secrets, where his savings were spent on all sorts of miracles. David started performing shows when he was 17 and also joined the Wolverhampton Circle of Magicians. He is proud to have been elected as their President four times. David is also a member of the world famous Magic Circle, The International Brotherhood of Magicians and Equity. Since beginning his journey into the world of magic, David has won numerous awards for his Stage and Close up entertainment. Performing entertaining magic that isn't just a collection of card tricks, but magic with rope, money, rings, chains, some metal bending and even a touch of mind reading. David's magic will astound you!\".\n<br>\n<br>\n<span style=\"font-weight: bold\">THE VANFEST CABARET DANCE TROUPE </span>\n<br>Taking you to the world of burlesque, we present our Vanfest dancers. With multiple costume changes, they will be supporting Blobbie Williams, and doing their own routines, as well as coming amongst the audience on stilts, with fire etc.\n<br>\n<br>\n<span style=\"font-weight: bold\">MAL RICH - COMEDIAN. </span> \n<br>Be prepared for a rib tickling session with our comedian Mal Rich! \n<br>\"Mal originates from Liverpool, or at least Merseyside, but don't hold that against him! He has been an entertainer for over twenty years and his experience is vast. His early days were spent honing his unique blend of humour in cabaret, and the list of stars he has worked with in live situations and television, is a veritable who's who of showbiz, including, Victoria Wood, Cliff Richard and Jasper Carrott. As a comedian he has appeared both live and on TV delivering an exceptional 1st class performance every time. There is nothing routine about his act, every one is unique to the event with much of the material exclusive to each audience. Mal has earned recognition not only for his talents but also for his enthusiasm and efforts in supporting various charities; in light of which he was recently appointed an ambassador for the Variety Club.\"\n<br>\n<br>\n<span style=\"font-weight: bold\">RUBY RED PERFORMERS from BRITAIN'S GOT TALENT. </span>\n<br>\n<br>Contrary to what you may have heard, there are no Vanfest Crew members in this dance act!. \n<br>\n<br>A hilarious act of 'Women from 25 to 65' guaranteed to bring the house down! \n<br>You must have seen, or heard about the Ruby Red Performers! They amazed the judges, and wowed the audience on BGT, and will be doing the same for us! No cabaret would be complete without their comedy dance routines.\n<br>\n<br>\n<span style=\"font-weight: bold\">TEME HALL.</span>\n<br>Doors open 20.00\n<br>DJ &amp; Pig Racing 20.00 to 23.00\n<br>\n<br>Pop into the Teme Hall on your way around the showground and spend some time with our resident DJ Mr Marky Mark! Not only will Mark be spinning some top tunes from his repertoire, he will also be running the hilarious \n<span style=\"font-weight: bold\">PIG RACING</span> throughout the evening. Bring in a group of friends, bet on your pig, and win some money! It's FUN, it's HILARIOUS, It's ENTERTAINING!\n<br>\n<br>\n<!-- m -->\n<a class=\"postlink\" href=\"http://WWW.VANFEST.ORG\">http://WWW.VANFEST.ORG</a>\n<!-- m --> \n<br>\n<br> \n<img class=\"smilies\" src=\"./images/smilies/icon_cool.gif\" alt=\"8)\" title=\"Cool\">",
    "lastEdited" : "Mon Apr 18, 2016 6:40 pm"
  }, {
    "postId" : "872511",
    "author" : {
      "username" : "Kempmann",
      "userId" : "872511",
      "joined" : "Tue May 09, 2006 6:30 pm",
      "profileRank" : "Registered user",
      "location" : "-",
      "postCount" : "142",
      "avatarPath" : null
    },
    "content" : "<span style=\"font-size: 200%; line-height: 116%;\">VANFEST 2016</span>\n<br>\n<br>\n<span style=\"font-size: 150%; line-height: 116%;\">CALLING ALL VANFESTERS, CAMPERS &amp; VAN ENTHUSIASTS <img class=\"smilies\" src=\"./images/smilies/icon_flower.gif\" alt=\":flower:\" title=\"flower\"> <br><br>This is the LAST CALL for those of you who want/need to book ADVANCE CAMPING TICKETS for this year’s VANFEST <img class=\"smilies\" src=\"./images/smilies/icon_smile.gif\" alt=\":)\" title=\"Grin\"> <br><br>We will be CLOSING our ADVANCE BOOKING System on SUNDAY 8th MAY </span> \n<img class=\"smilies\" src=\"./images/smilies/icon_eek.gif\" alt=\"8O\" title=\"eek\"> \n<br>\n<br>\n<br>After that you will have to wait &amp; Pay\n<span style=\"font-weight: bold\"> MORE </span>for your\n<span style=\"font-weight: bold\"> CAMPING</span> if you pay at the Gate. \n<img class=\"smilies\" src=\"./images/smilies/icon_sad.gif\" alt=\":(\" title=\"Sad\"> \n<br>\n<br>\n<span style=\"font-weight: bold\">REMEMBER; You can also STOPOVER for FREE on the SUNDAY NIGHT and attend the GIANT FLEA FAIR also being held at the Showground on the Bank Holiday Monday </span> \n<img class=\"smilies\" src=\"./images/smilies/icon_bounce.gif\" alt=\":bounce:\" title=\"bounce\"> \n<br>\n<br>(Please note; The Flea Fair is a separate event to \n<span style=\"font-weight: bold\">VANFEST</span> so there is a £4 per person entry fee if you go to it)\n<br>\n<br>VANFEST 2016 - Current (ADVANCED) Price for CAMPING ADULT is (just) £30 plus £20 for your camping Unit.\n<br>\n<br>Pay on the Day CAMPING ADULT price will be £35 plus the £20 for your Camping Unit. \n<br>\n<br>Our Promo Crew will be at STANFORD HALL next weekend and will be selling VANFEST (and Busfest) tickets there.\n<br>\n<br>LINK to VANFEST TICKETS…… \n<!-- m -->\n<a class=\"postlink\" href=\"http://www.busfest.org/orders/section/12/1/vanfest/\">http://www.busfest.org/orders/section/12/1/vanfest/</a>\n<!-- m -->\n<br>\n<br>\n<!-- m -->\n<a class=\"postlink\" href=\"http://WWW.VANFEST.ORG\">http://WWW.VANFEST.ORG</a>\n<!-- m -->",
    "lastEdited" : "Tue Apr 26, 2016 1:36 pm"
  }, {
    "postId" : "873721",
    "author" : {
      "username" : "Kempmann",
      "userId" : "873721",
      "joined" : "Tue May 09, 2006 6:30 pm",
      "profileRank" : "Registered user",
      "location" : "-",
      "postCount" : "142",
      "avatarPath" : null
    },
    "content" : "<span style=\"font-weight: bold\"><span style=\"font-size: 150%; line-height: 116%;\">OK FOLKS this is the very FINAL REMINDER that we will be closing the ADVANCE BOOKING SYSTEM for CAMPING for our VANFEST event THIS WEEKEND (on Sunday 8th MAY).</span></span> \n<img class=\"smilies\" src=\"./images/smilies/icon_flower.gif\" alt=\":flower:\" title=\"flower\"> \n<br>\n<br>\n<span style=\"font-size: 150%; line-height: 116%;\">So if you want to take advantage of cheaper priced tickets &amp; a guaranteed camping place in one of the prime campsites within the actual showground itself them please get your bookings in NOW.</span>\n<br>\n<br>\n<img src=\"https://scontent-lhr3-1.xx.fbcdn.net/v/t1.0-9/13100873_1565357787096730_1926007065513947139_n.jpg?oh=d2d244328a8b38f1852fb6c4454e4b42&amp;oe=57A86272\" class=\"postimage\" alt=\"Image\">",
    "lastEdited" : "Sat May 07, 2016 12:12 pm"
  } ]
}