{
  "forumId" : "10",
  "threadId" : "125409",
  "title" : "Vintage Nostalgia Festival 4th 5th 6th June 2021",
  "originalUrl" : "https://ssvc.org.uk/phpbb/viewtopic.php?f=10&t=125409",
  "breadcrumbs" : [ {
    "url" : "./viewforum.php?f=41&sid=78739d675aa0e62b6146052955c17a35",
    "label" : "Events"
  }, {
    "url" : "./viewforum.php?f=10&sid=78739d675aa0e62b6146052955c17a35",
    "label" : "Events"
  } ],
  "totalPosts" : 1,
  "pageNumber" : 1,
  "totalPages" : 1,
  "posts" : [ {
    "postId" : "933792",
    "author" : {
      "username" : "chimneybus",
      "userId" : "933792",
      "joined" : "Fri May 11, 2012 7:23 am",
      "profileRank" : "Registered user",
      "location" : "-",
      "postCount" : "3",
      "avatarPath" : null
    },
    "content" : "We would love to see you on the 4th 5th &amp; 6th June @ VNF 2021!! \n<a href=\"https://www.vintagenostalgiafestival.co.uk/\" class=\"postlink\">https://www.vintagenostalgiafestival.co.uk/</a>\n<br> If you are not familiar with The Vintage Nostalgia Festival then now is the time to change that!! Set in the beautiful countryside of Stockton Park, Wiltshire, VNF is a fun filled Nostalgic weekend of Live Music, dance, vintage &amp; antique shopping, classic cars, automobilia, childrens entertainment, and so much more! You simply must not miss it! You can visit for the day on the 4th,5th &amp; 6th June 2021 or stay for the whole weekend camping in your split in the Vintage Camping area from the 3rd June. (camping is subject to availability)\n<br> \n<br> \n<br> 1000’s of vintage enthusiasts and classic car owners will be in attendance and there will be 100's of cars on display over the weekend from the 1920's to the 1980's. To get a flavour of the festival go to \n<a href=\"http://www.vintagenostalgiafestival.co.uk\" class=\"postlink\">www.vintagenostalgiafestival.co.uk</a> or visit our face book, Instagram or twitter pages.\n<br> If you enjoy spending time with family or friends the VN Festival is the perfect way to unwind…. Visitors are encouraged to wear period attire! To help with the transformation Pearls Pin Up parlour will be on hand to create any style or look! For a glamorous time glamping is available in our boutique camping area. There is so much to do enter our \"Best Dressed Competition\" Learn to Jive, swing dance, sample the finest real Ale from Ringwood Brewery, enjoy the vintage theatrics from our re-enactors, meander through the Vintage Village trade stand area, get busy in the children's activity &amp; entertainment section. If that’s all to energetic you could just sit back, relax with a Pimms in our Vintage 1963 Leyland Titan Double Decker Bus Bar!\n<br> The VNF team have organised a fabulous line up of live music and dance acts over the weekend offering Jazz, blues, pop, Swing, &amp; Rock &amp; Roll from as far back as the 1920’s right up to the 1980’s. \n<br> Bring your dance shoes! Come and enjoy those balmy summer evenings with us! We have received rave reviews in the Vintage Life publication, Classic car buyer Magazine, Classic car magazine, Custom Car magazine, Classic car Weekly, Wiltshire View, Valley News, Salisbury Life Magazine and various other national and local publications.\n<br> Why not experience it yourself? Tickets are limited and camping is pre-book only. Buy your ticket now on \n<br> \n<a href=\"https://www.vintagenostalgiafestival.co.uk/\" class=\"postlink\">https://www.vintagenostalgiafestival.co.uk/</a>",
    "lastEdited" : "Mon Jan 11, 2021 6:32 pm"
  } ]
}