{
  "forumId" : "10",
  "threadId" : "43156",
  "title" : "Hessisch Oldendorf 2009",
  "originalUrl" : "https://ssvc.org.uk/phpbb/viewtopic.php?f=10&t=43156&start=45&st=0&sk=t&sd=a",
  "breadcrumbs" : [ ],
  "totalPosts" : 114,
  "pageNumber" : 4,
  "totalPages" : 8,
  "posts" : [ {
    "postId" : "344685",
    "author" : {
      "username" : "mrsherbie",
      "userId" : "Unknown",
      "joined" : "-",
      "profileRank" : "-",
      "location" : "-",
      "postCount" : "-",
      "avatarPath" : "http://img.villagephotos.com/p/2006-3/1155935/59samba-avatar.jpg"
    },
    "content" : "<div class=\"quotetitle\">\n 54DoubleDoor wrote:\n</div>\n<div class=\"quotecontent\">\n <div class=\"quotetitle\">\n  mrsherbie wrote:\n </div>\n <div class=\"quotecontent\">\n  Sadly I dont know any stock people who are planning to go to a Bad Camberg vw meet ever again (if it is ever put on again even)\n </div>\n <br>\n <br>Well I can count two or three without even thinking about it. \n <img src=\"./images/smilies/icon_confused.gif\" alt=\":?\" title=\"Confused\">\n</div> \n<br> \n<br>Mostly beetles, I know 12 vehicles so far (only 2 buses in there) who will not go again. \n<br> \n<br>Paneldave, sorry, I think it is this forum and a few of the users that I no longer enjoy, this forum has changed a lot since I first started coming here. Also I am still waiting for an apology from Nigel Isted who despite my asking repeatedly, left some very spiteful and untrue comments about my family &amp; 10yr old daughter posted up for 24hrs (until intervention by the other helpful mods who eventually managed to remove it) by a 'caught out in the wrong' vw garage owner, and Nigel Isted even made it so no other mods could remove the posts for reasons that remain unknown. \n<br>I found his behaviour totally \n<img src=\"./images/smilies/disgust.gif\" alt=\"disgust\" title=\"\">ing and unacceptable given the situation. I expected more from people in charge of such a large club. \n<br>It is not the buses I dislike just a few of the owners attitudes, but I am equally sure as many people dislike my attitude \n<img src=\"./images/smilies/icon_lol.gif\" alt=\":lol:\" title=\"LOL\"> and I have no problem with that. So I rarely come here anymore but I still happily post on pre67vw and the samba \n<img src=\"./images/smilies/icon_biggrin.gif\" alt=\":D\" title=\"Big Grin\"> \n<br> \n<br>I just think it would be good to know that if the ssvc are planning another convoy and camping at a major European Vintage show then some \n<span style=\"font-weight: bold\">responsibility</span> will be taken for people doing things like acting disgracefully on the showground or doing a runner from the campsite without paying. I only see things get swept under the rug. \n<br>For me this lowers the clubs reputation and I am happy to no longer be a member. \n<br> \n<br>You are welcome to read whatever you wish into my words MrsShaggybus, but NO, stock vw owners do not ever cause trouble. Everyone I know in beetles are obviously staying in hotels &amp; B&amp;Bs, do you think they will be 'doing a runner'? \n<img src=\"./images/smilies/icon_rolleyes.gif\" alt=\":roll:\" title=\"Roll Eyes\"> \n<br>Or park up \n<span style=\"font-style: italic\">in</span> the show, take their shirts off and lay around drinking &amp; smoking grass and line up beer cans on their roofs.. \n<br> \n<br>Brits are getting a bad reputation at European vintage/stock shows, and it is never the stock people doing it, and that is simply not fair.",
    "lastEdited" : "Fri Aug 22, 2008 1:19 pm"
  }, {
    "postId" : "344721",
    "author" : {
      "username" : "sausage fingers",
      "userId" : "Unknown",
      "joined" : "-",
      "profileRank" : "-",
      "location" : "-",
      "postCount" : "-",
      "avatarPath" : "http://img258.imageshack.us/img258/589/spijlbus002pa0.jpg"
    },
    "content" : "Wo there Trigger !!!!!! \n<br>The trouble at BC was caused by the new breed of VW chav. NOT RATLOOKERS, SHATLOOKERS OR THE SBS. \n<br> \n<br>Sadly, they were English and drove ratlook buses. All to do with their mentality, drugs, alchohol and having no pride in themselves or their behaviour. \n<br>Mrs Herbie is correct in some respects and sadly for us non-stock, non-shiney bus owners, we are all being tarred with the same brush. But, Anna, you are coming across as \"RAT-IST\" and some of the best and busiest people on this forum are \"Ratters\". ALL of those people are strong, committed, proud SSVC members and painting with a picture with a 9 inch brush will only make a mess. \n<br>I would love to have the blingest bus on the planet but cannot afford to restore to that level and would rather drive my \"Shatlook\" bus than take it off the road until I can. If the people of HO, BC and Lavenham dont want it in their show, fine. I will park as close as possible and bumble in on foot. \n<br>Its the letters on the badge that count, not how shiney they are or how far off the ground !!!!!! \n<br> \n<br>Neil \n<img src=\"./images/smilies/icon_biggrin.gif\" alt=\":D\" title=\"Big Grin\">",
    "lastEdited" : "Fri Aug 22, 2008 4:37 pm"
  }, {
    "postId" : "344730",
    "author" : {
      "username" : "kev mc",
      "userId" : "Unknown",
      "joined" : "-",
      "profileRank" : "-",
      "location" : "-",
      "postCount" : "-",
      "avatarPath" : "http://img.photobucket.com/albums/v222/kvwsurf/bart.gif"
    },
    "content" : "<div class=\"quotetitle\">\n sausage fingers wrote:\n</div>\n<div class=\"quotecontent\">\n Wo there Trigger !!!!!!\n <br>The trouble at BC was caused by the new breed of VW chav. NOT RATLOOKERS, SHATLOOKERS OR THE SBS.\n <br>\n <br>Sadly, they were English and drove ratlook buses. All to do with their mentality, drugs, alchohol and having no pride in themselves or their behaviour. \n <br>Mrs Herbie is correct in some respects and sadly for us non-stock, non-shiney bus owners, we are all being tarred with the same brush. But, Anna, you are coming across as \"RAT-IST\" and some of the best and busiest people on this forum are \"Ratters\". ALL of those people are strong, committed, proud SSVC members and painting with a picture with a 9 inch brush will only make a mess. \n <br>I would love to have the blingest bus on the planet but cannot afford to restore to that level and would rather drive my \"Shatlook\" bus than take it off the road until I can. If the people of HO, BC and Lavenham dont want it in their show, fine. I will park as close as possible and bumble in on foot. \n <br>Its the letters on the badge that count, not how shiney they are or how far off the ground !!!!!!\n <br>\n <br>Neil \n <img src=\"./images/smilies/icon_biggrin.gif\" alt=\":D\" title=\"Big Grin\">\n</div> \n<br> \n<img src=\"./images/smilies/icon_salut.gif\" alt=\":salute:\" title=\"salute\">",
    "lastEdited" : "Fri Aug 22, 2008 4:58 pm"
  }, {
    "postId" : "344756",
    "author" : {
      "username" : "shaggy66bus",
      "userId" : "Unknown",
      "joined" : "-",
      "profileRank" : "-",
      "location" : "-",
      "postCount" : "-",
      "avatarPath" : "http://i21.photobucket.com/albums/b269/shaggy66bus/american20iron20cross20rat20pin6_4_.jpg"
    },
    "content" : "<div class=\"quotetitle\">\n mrsherbie wrote:\n</div>\n<div class=\"quotecontent\">\n .\n <br>\n <br>Ratlook is a 'look' that is modified/lowered/floor scraping.\n <br>\n <br>\n <br>Once you have lowered/modified your bus it is no longer 'stock/vintage' so therefore falls outside of the show's display criteria. How 'cool' you think you made it is irrelevant. It is no longer stock. and H.O. is a stock show. \n <br>\n</div> \n<br> \n<br>so a all original bus with rust showing but no other modds isnt a rat look. \n<br> \n<br> \n<br>if thats your bus in your avatar then you fall into modified group then",
    "lastEdited" : "Fri Aug 22, 2008 7:29 pm"
  }, {
    "postId" : "344841",
    "author" : {
      "username" : "mrsherbie",
      "userId" : "Unknown",
      "joined" : "-",
      "profileRank" : "-",
      "location" : "-",
      "postCount" : "-",
      "avatarPath" : "http://img.villagephotos.com/p/2006-3/1155935/59samba-avatar.jpg"
    },
    "content" : "Sausage fingers, you ARE the voice of reason (as usual ) \n<br>I agree with everything you say there. \n<br>I posted as I find even myself confused with our own tatty og paint cars, albeit stockers, just like Mikes van, our registered car has ankor waxed surface rust and og tatty accessory sprints (and our samba is no doubt tattier than your van and not even og paint ) Some of our best friends have heavily modified rat buses too, I am not naive enough to chuck everyone good and bad in the same pot over some bolt on metal parts. \n<br>I love the og paint vans far more than shiny myself, but sometimes something seems to come along with vehicles that earn that 'tag' rat look that is just not the vintage approach or attitude shared by both sides with the og paint the linking factor. It is instead 'anti'. A bit like punk, thought cool mostly by those doing it. \n<br> \n<br>As someone wise has pointed out to me, it is the few people who tag along to the convoy to the show for 'just another trek over the channel', but actually have no idea what it is about and how special it is to the people coming from all around the world, that seem to not respect others. It is not a 'vintage themed show, it IS a vintage show, and to stay a vintage show it must stay vintage, nothing else. Not an SSVC meet with happy clappy everyone welcome or Bugjam or Action etc. \n<br>It seems many Brits just dont understand what 'vintage vw' means. \n<br>All I know is the basic rule og paint or not, lowered is not vintage. I dont think that is so hard to understand? \n<br> \n<br>I wish there was an answer, as it IS unfair to tar all of us Brits but that is what is happening. I dont see a solution. Other than taking responsibility in the same way as telling a stranger to pick up their litter when you see them drop it. \n<br>Who exactly, if not Brits do you think 'no rat look' is aimed at? \n<br> \n<br>\n<div class=\"quotetitle\">\n shaggy66bus wrote:\n</div>\n<div class=\"quotecontent\">\n so an all original bus with rust showing but no other modds isnt a rat look.\n <br>\n</div> \n<br> \n<br>no, it is just an 'original paint vw', the same as it has always been before someone at a magazine gave it a tag name to make their text seem more interesting",
    "lastEdited" : "Sat Aug 23, 2008 12:38 am"
  }, {
    "postId" : "344967",
    "author" : {
      "username" : "surreysplit",
      "userId" : "Unknown",
      "joined" : "-",
      "profileRank" : "-",
      "location" : "-",
      "postCount" : "-",
      "avatarPath" : null
    },
    "content" : "<div class=\"quotetitle\">\n mrsherbie wrote:\n</div>\n<div class=\"quotecontent\">\n <div class=\"quotetitle\">\n  Mike1973 wrote:\n </div>\n <div class=\"quotecontent\">\n  But I remember devouring all the reports and pictures fro '05 when my Kombi was a long way off being on the road, and I remeber a healthy smattering of Modified AND Rats in with all the Stockers, and I don't remember there being any negative comments about them being there at the time? \n  <img src=\"./images/smilies/icon_confused.gif\" alt=\":?\" title=\"Confused\">\n </div>\n <br>\n <br>Dont forget the British magazines, Volksworld &amp; UltraVW seem to have their heads firmly lost up their modified arses, so yes there would have been every rat in town in their pics, they dont seem to class the 95% stock cars at shows like these as interesting enough..\n <br>\n <br>Also the organisers of EBI deliberately riding it on the back of the 4 yearly vintage shows the following weekend does'nt help either.\n</div> \n<br> \n<br>Actually i dont agree with your comment re UltraVW as i have a stock bus which incidentally won Best of Show @ VW Expo this year which happened to be sponsored by UltraVW Mag also may i add i picked up Best Type 2 Award@ Peppercorn chosen by Ivan whos the head honcho of Volksworld so i think your wrong there Mrs !",
    "lastEdited" : "Sat Aug 23, 2008 8:56 pm"
  }, {
    "postId" : "345338",
    "author" : {
      "username" : "buggirl",
      "userId" : "Unknown",
      "joined" : "-",
      "profileRank" : "-",
      "location" : "-",
      "postCount" : "-",
      "avatarPath" : "http://i74.photobucket.com/albums/i256/buggirl_2006/type2.gif"
    },
    "content" : "Reading this, I aint going to bother going! LOL \n<img src=\"./images/smilies/icon_lol.gif\" alt=\":lol:\" title=\"LOL\"> It dosent matter what VW you drive, if you are a trouble maker you are a trouble maker......END OF! The trouble happens when the owner is not driving usually, so unless you know what vehicle they own, how do you know who is causing the trouble? Just a thought! \n<img src=\"./images/smilies/icon_confused.gif\" alt=\":?\" title=\"Confused\"> I love all VWs and thats what each show is about, the VWs, isnt it why we all go? \n<img src=\"./images/smilies/icon_wink.gif\" alt=\":wink:\" title=\"Wink\">",
    "lastEdited" : "Mon Aug 25, 2008 8:00 pm"
  }, {
    "postId" : "347258",
    "author" : {
      "username" : "ratty mullet",
      "userId" : "Unknown",
      "joined" : "-",
      "profileRank" : "-",
      "location" : "-",
      "postCount" : "-",
      "avatarPath" : null
    },
    "content" : "FAO MRS HERBIE with regards to the above link. \n<br> \n<br> ive seen you stick the knife in a few times now and its getting old. if you dont like this club you know where the door is. \n<br>the way you speek about people as if you are head honch? wtf? for god sake women wind your neck in and fall in line! vw owners of the uk dont travel accross europe to make trouble. this is a personal jab a mrs herbie as being a ratlook bus owner i feel as though i am intitaled to make this post, i feel personally offended by what you mrs herbie have said. i bet you get your vw cared for by a garage yes? ever even grabbed a spanner in you hand and even touched your bus?? do you have a bus? \n<br> \n<br>ive read through your posts and i have come to one conclusion . . . . . . you are a despicable human being. \n<br> i think the way you carry on on here, your views and the way you talk about uk vw owners is completely out of order. \n<br> \n<br>peace and love. \n<img src=\"./images/smilies/icon_biggrin.gif\" alt=\":D\" title=\"Big Grin\">",
    "lastEdited" : "Mon Sep 01, 2008 7:09 am"
  }, {
    "postId" : "347271",
    "author" : {
      "username" : "23A",
      "userId" : "Unknown",
      "joined" : "-",
      "profileRank" : "-",
      "location" : "-",
      "postCount" : "-",
      "avatarPath" : "http://i12.photobucket.com/albums/a247/BDMambo/P8190204cb.jpg"
    },
    "content" : "..ANNA! \n<br>\"Once you have lowered/modified your bus it is no longer 'stock/vintage' so therefore falls outside of the show's display criteria. How 'cool' you think you made it is irrelevant. It is no longer stock. and H.O. is a stock show. \"..I don't have to tell you that Julians bus - \n<br>LOWERED \n<br>JUDSON \n<br>SPRINTSTARS \n<br>-won Best Of Show at Hessisch last time \n<img src=\"./images/smilies/icon_eek.gif\" alt=\"8O\" title=\"eek\"> \n<img src=\"./images/smilies/icon_twisted.gif\" alt=\":twisted:\" title=\"Twisted Evil\"> \n<img src=\"./images/smilies/icon_biggrin.gif\" alt=\":D\" title=\"Big Grin\"> \n<img src=\"./images/smilies/icon_biggrin.gif\" alt=\":D\" title=\"Big Grin\"> ( &amp; well deserved \n<img src=\"./images/smilies/icon_biggrin.gif\" alt=\":D\" title=\"Big Grin\"> \n<img src=\"./images/smilies/icon_cool.gif\" alt=\"8)\" title=\"Cool\"> ) \n<br> \n<br>..ratty, you'll find that Mrs Herbie spends most of her time in a garage, works on her own vehicles &amp; knows ALOT about vws.. \n<br> \n<br>..PERSONAL POINT \n<br>H-O 2009 will be my 'official' 50th birthday celebration, &amp; i will be there whooping it up AND getting drunk \n<img src=\"./images/smilies/icon_twisted.gif\" alt=\":twisted:\" title=\"Twisted Evil\"> .I WILL be driving BELTEK there; i am waiting to see if the organisers will accept my transfer of registration to my new van. If not i will be VERY disappointed, BUT i will camp above the town &amp; revel in the show &amp; swapmeet with ALL my friends ( who are ALL welcome back to the van for Champagne, BTW \n<img src=\"./images/smilies/icon_biggrin.gif\" alt=\":D\" title=\"Big Grin\"> ) \n<br> \n<br>..SO, differences aside, lets NOT 'spoil' the feeling of the BEST show in Europe, ESPECIALLY as its still 9 months away! \n<img src=\"./images/smilies/icon_eek.gif\" alt=\"8O\" title=\"eek\"> \n<img src=\"./images/smilies/icon_rolleyes.gif\" alt=\":roll:\" title=\"Roll Eyes\"> \n<br> \n<br>..( &amp; REST \n<img src=\"./images/smilies/icon_rolleyes.gif\" alt=\":roll:\" title=\"Roll Eyes\"> \n<img src=\"./images/smilies/icon_wink.gif\" alt=\":wink:\" title=\"Wink\"> \n<img src=\"./images/smilies/icon_lol.gif\" alt=\":lol:\" title=\"LOL\"> )",
    "lastEdited" : "Mon Sep 01, 2008 7:42 am"
  }, {
    "postId" : "347275",
    "author" : {
      "username" : "cleggfu",
      "userId" : "Unknown",
      "joined" : "-",
      "profileRank" : "-",
      "location" : "-",
      "postCount" : "-",
      "avatarPath" : "http://photos-e.ak.facebook.com/photos-ak-sf2p/v254/156/69/615724808/n615724808_977964_5515.jpg"
    },
    "content" : "sod all this, im buying an astra. \n<img src=\"./images/smilies/icon_wink.gif\" alt=\":wink:\" title=\"Wink\">",
    "lastEdited" : "Mon Sep 01, 2008 7:52 am"
  }, {
    "postId" : "347277",
    "author" : {
      "username" : "scrubdupin1",
      "userId" : "Unknown",
      "joined" : "-",
      "profileRank" : "-",
      "location" : "-",
      "postCount" : "-",
      "avatarPath" : null
    },
    "content" : "Just read this thread and feel I have to add my 5 penneth. \n<br>I have been into vw's for 20 years +, helped to run a local club and been to a good few of the shows over the years. I have always maintained that there are a 'minority' in the vw scene who are in it for reasons of fashion at the time. These people are not truly interested in the vehicles or the scene itself but have bought bugs or buses (both modified and stock vehicles) because its 'in' to own one. This theory has been proved to me time and time again with them joining the club then a year or so down the line you find they've sold their vw and are no longer interested. \n<br>I vowed, after 'Bug Jam 9' that I would never go again, but this year decided it was time to give it another chance. I won't say where I camped but my weekend was completely ruined by people in the next area who sat up drinking , shouting and playing music all night both friday and saturday and during the day layed around outside their vehicles still drinking and shouting and playing music. I did'nt see them leave once to go and look at the show or watch th racing. To my mind, all they were there for was to get ......, stoned and make other people's lives a misery. They were packed up and gone by 10 am sunday morning (the main show day) I rest my case!! \n<br>That said, there are many many of us out here who I would class as 'true enthusiasts'. Whether we own stock/modified/lowered etc vehicles should not matter, personal taste should not enable people to label you as a trouble maker. The people who are in this scene because we genuinely love our vehicles should be allowed to do what they want to their cars/buses without fear of being judged by the look of their pride and joy. \n<br>At the end of the day, the few people who do decide to mis behave at events/shows etc, usually succeed in spoiling things for the many but please, just because some of us own/drive/enjoy modified vehicles, don't label us all as trouble makers, we love our vw's just as much as you do, it's just our taste thats different.The world would be a pretty boring place if we all thought and enjoyed the same things!",
    "lastEdited" : "Mon Sep 01, 2008 8:12 am"
  }, {
    "postId" : "347289",
    "author" : {
      "username" : "simon hall",
      "userId" : "Unknown",
      "joined" : "-",
      "profileRank" : "-",
      "location" : "-",
      "postCount" : "-",
      "avatarPath" : null
    },
    "content" : "I reach my 40th birthday next year and i am even finding myself walking around certain UK shows and feeling i no longer want to be there, its great to have the freedom to do what we want in our society but when people go to a show with the sole aim of being off their face for the entire weekend and making just a total ass of themselves it makes me no longer want to attend, i was like most on here was ashamed of the guys at Camberg treating the show ground like a traveller site but I feel we may have reached the end of modified original paint split buses as the mainstream, bay windows seem to be the new way forward for the modified crew, \n<br>I now regret modifying my so23 and will at some point try to get it back to stock, for one i now feel i have devalued it!! \n<br>Standard original paint buses seem to be the only buses holding (and even increasing) in value at the moment. \n<br>2000cc plus motors are great for a blast at Santa Pod but cost a fortune now to run and the rat/modified look has become so standard to me its getting boring, i find that a stock looker is so refreshing. \n<br>So even me with my string of modified buses behind me has just bought a totally stock 56 that will stay the way i found it, original paint (yes faded i have not changed that much) standard ride height and crank start motor, looking forward to life in the slow lane \n<br>But like i said my 40th is looming and human nature just makes us look at stuff in a different way the older we get!",
    "lastEdited" : "Mon Sep 01, 2008 9:01 am"
  }, {
    "postId" : "347294",
    "author" : {
      "username" : "scrubdupin1",
      "userId" : "Unknown",
      "joined" : "-",
      "profileRank" : "-",
      "location" : "-",
      "postCount" : "-",
      "avatarPath" : null
    },
    "content" : "Perhaps its something about age, I'm 41 this year!...I too drive a stock bus, apart from a servo fitted before I owned it that is. I have all the bits in the garage for straight axleing and lowering together with Safari's etc. I was going to fit them this winter and get the bus looking how I want it to but I'm beginning to question if I should. \n<br>Having had a trouble free run to bug jam and just last weekend the NASC nats in Ipswitch, where the bus and her reduction boxes and stock front beam performed faultlessly, I feel guilty about even considering modifying her. I wanted to make her more 'motorway friendly' but there is something to be said for 'life in the slow lane' I quite enjoy it too !!",
    "lastEdited" : "Mon Sep 01, 2008 9:16 am"
  }, {
    "postId" : "347308",
    "author" : {
      "username" : "Angel Delight",
      "userId" : "Unknown",
      "joined" : "-",
      "profileRank" : "-",
      "location" : "-",
      "postCount" : "-",
      "avatarPath" : "http://i6.photobucket.com/albums/y218/cakemaker/T3DOD.jpg"
    },
    "content" : "<div class=\"quotetitle\">\n 23A wrote:\n</div>\n<div class=\"quotecontent\">\n H-O 2009 will be my 'official' 50th birthday celebration, &amp; i will be there whooping it up AND getting drunk \n <img src=\"./images/smilies/icon_twisted.gif\" alt=\":twisted:\" title=\"Twisted Evil\"> .I WILL be driving BELTEK there.......\n <br> \n</div> \n<br> \n<br>I thought you already were 50 \n<img src=\"./images/smilies/icon_eek.gif\" alt=\"8O\" title=\"eek\"> \n<br> \n<br>only joking \n<img src=\"./images/smilies/icon_wink.gif\" alt=\":wink:\" title=\"Wink\"> \n<br> \n<br>glad to hear that you and the Beltek are now an item \n<img src=\"./images/smilies/icon_biggrin.gif\" alt=\":D\" title=\"Big Grin\"> \n<br> \n<br>xx",
    "lastEdited" : "Mon Sep 01, 2008 9:49 am"
  }, {
    "postId" : "347334",
    "author" : {
      "username" : "WILL",
      "userId" : "Unknown",
      "joined" : "-",
      "profileRank" : "-",
      "location" : "-",
      "postCount" : "-",
      "avatarPath" : "http://i16.photobucket.com/albums/b22/WILL_T/CANOPYWINDBRK.jpg"
    },
    "content" : "<div class=\"quotetitle\">\n mrsherbie wrote:\n</div>\n<div class=\"quotecontent\">\n  The harsh but true facts are that stock people simply do not make trouble or cause problems. They are generally a bit older and behave very well.\n</div> \n<br> \n<br> \n<br> \n<br>Well that will be me then \n<img src=\"./images/smilies/icon_eek.gif\" alt=\"8O\" title=\"eek\"> but let's not bring age into it, some of these young people under 50 are quite nice \n<img src=\"./images/smilies/icon_wink.gif\" alt=\":wink:\" title=\"Wink\"> \n<br> \n<br>I'm glad that there are very few threads like this on the forum. \n<br> \n<br>I bought a Split 'cause I like classic cars and wanted a camper. I always thought Splits were cool but had no idea there was a massive \"VW scene\". Before I bought my van I'd never been to a VW show or owned an air cooled VW \n<img src=\"./images/smilies/icon_smile.gif\" alt=\":)\" title=\"Grin\"> The shows the clubs and the \"scene\" in general were all a bonus that came with ownership. \n<br>If I'd known that you could be categorized by the \"style\" of your van I'd have gone for a Porsche engined rat look ............. it would take years of me \n<img src=\"./images/smilies/icon_wink.gif\" alt=\":wink:\" title=\"Wink\">",
    "lastEdited" : "Mon Sep 01, 2008 10:57 am"
  } ]
}