{
  "forumId" : "10",
  "threadId" : "105605",
  "title" : "Summer Classic In Bristol",
  "originalUrl" : "https://ssvc.org.uk/phpbb/viewtopic.php?f=10&t=105605",
  "breadcrumbs" : [ {
    "url" : "./viewforum.php?f=41",
    "label" : "Events"
  }, {
    "url" : "./viewforum.php?f=10",
    "label" : "Events"
  } ],
  "totalPosts" : 1,
  "pageNumber" : 1,
  "totalPages" : 1,
  "posts" : [ {
    "postId" : "801575",
    "author" : {
      "username" : "is,sit",
      "userId" : "801575",
      "joined" : "Wed Sep 07, 2005 2:36 pm",
      "profileRank" : "Registered user",
      "location" : "southwales the kop end",
      "postCount" : "1323",
      "avatarPath" : "./download/file.php%3Favatar=1664_1291018298.jpg"
    },
    "content" : "Is anyone going \n<img class=\"smilies\" src=\"./images/smilies/icon_wink.gif\" alt=\":wink:\" title=\"Wink\"> \n<img class=\"smilies\" src=\"./images/smilies/icon_wink.gif\" alt=\":wink:\" title=\"Wink\"> \n<br>\n<br>Look up all air-cooled dubbers,\n<br>The team from bristol volksfest also organise another event at Easter Compton, and we want a SPECIAL VW AIR-COOLED DISPLAY this september.\n<br>Here is the run down, and it is something different which we are sore you will all enjoy.\n<br>\n<br>\n<br>Summer Classics.\n<br>\n<br>This year will be the 4th Summer Classics event at Washingpool Farm and the show is growing from strength to strength.\n<br>Offering you a vast array of British, European and American Classic, Vintage and Retro Cars, Scooters and Bikes, with an off road track for Land Rovers and 4x4s too. You will also be able to see a fantastic collection of military and agricultural vehicles as well as some steam engines.\n<br>\n<br>Whether you've got a classic car or not, just come along to Bristol's very own festival of transport. Held onSaturday 13th and Sunday 14th September 2014.\n<br>There are several different displays on each day so, to make sure you see everything, we offer overnight camping on Saturdayso you can make a whole weekend of it.\n<br>Onsite facilities, include disabled - mains toilets with hot and cold water and showers, International food court, Saturday night entertainment and a bar.\n<br>\n<br>Our Summer Classics village green has become a staple part of the show with grass skittles, wellie wanging, horseshoe throwing, traditional fair ground rides, old style side shows and a farm animal corner. Summer Classics is a real fun family day out with some great things to do, surrounded by some of the most breath taking vehicles.\n<br>\n<br>If you are part of a club, why not have a club stand at Summer Classics. All the information for this is on our website.\n<br>\n<br>If you're an autojumbler or have a few bits left over from your project and want to find an appreciative buyer - why not take up an autojumble pitch? There is no charge for private autojumblers - just the cost of entry(£5 per person per day plus £10 per pitch if you camp over).If youget in touch with us via email (\n<!-- e -->\n<a href=\"mailto:info@summer-classics.co.uk\">info@summer-classics.co.uk</a>\n<!-- e -->) beforehand, we can save you a pitch - otherwise, just roll up on the weekend, ask for autojumble, and you'll be pointed in the right direction.\n<br>\n<br>Summer Classicswill look after everyone with great entertainment, lots of weird and wonderful vehicles, kids play area, village green with local crafts, traditional fresh foods, bar, trade stands, autojumble and displays.\n<br>It is set in the beautiful countryside overlooking the Severn Valley at Easter Compton, South Gloucester - just one mile from junction 17, M5 - the self contained site is ideally placed for Bristol and all motorway connections.\n<br>\n<br>The show opens to the public at 9.30am on Saturday, last entry 4.30, and again on Sunday from 9.30am, last entry is at 2pm. The show closes at 4pm Sunday.\n<br>\n<br>The pricing for Summer Classics is:\n<br>\n<br>Adult day ticket: £5 (Saturday or Sunday) \n<br>Adult Two day pass £10\n<br>Camping £10 per night per pitch (includes caravans)\n<br>Under 12s accompanied by parentFree.Unaccompanied under 16s are not permitted.\n<br>\n<br>There will be a dedicated VW camping area right in the show ground so you pitch-up, display and be with all your mates.\n<br>( other vehicles are welcome but won’t be able to display,but park up behind)\n<br>Thank you, we hope to see you soon.\n<br>\n<br>Kind regards\n<br>\n<br>Summer Classics\n<br>\n<!-- w -->\n<a class=\"postlink\" href=\"http://www.summer-classics.co.uk\">www.summer-classics.co.uk</a>\n<!-- w -->\n<br>\n<!-- e -->\n<a href=\"mailto:info@summer-classics.co.uk\">info@summer-classics.co.uk</a>\n<!-- e -->",
    "lastEdited" : "Tue Sep 09, 2014 6:57 pm"
  } ]
}