{
  "forumId" : "10",
  "threadId" : "103870",
  "title" : "Field of Dreams Aircooled VW Show, York 12th - 14th Sept.",
  "originalUrl" : "https://ssvc.org.uk/phpbb/viewtopic.php?f=10&t=103870",
  "breadcrumbs" : [ ],
  "totalPosts" : 1,
  "pageNumber" : 1,
  "totalPages" : 1,
  "posts" : [ {
    "postId" : "790230",
    "author" : {
      "username" : "classicvolks",
      "userId" : "Unknown",
      "joined" : "-",
      "profileRank" : "-",
      "location" : "-",
      "postCount" : "-",
      "avatarPath" : null
    },
    "content" : "As most of you know, we had some issues last year, that were completely out of our hands, although we believe the issues have been sorted for this year, I have lost trust in the venue and I am worried that they could mess something up for you all again. I have been scouring the local area for somewhere close by but better, somewhere that you would all love. And, finally I have found a place, that is not only fantastic, but is extremely excited to have a load of VWs turn up for a weekend! It is just a 15 minute drive out of York City Centre, so not far at all but much easier to get to than the racecourse. We will be able to have a midnight music cut off instead of the 10:30 we had last year. I am REALLY excited about this venue and will be making it a permanent home for the show.\n<br>\n<br>I want this show to be fantastic for you all and felt this was a necessary move to ensure things could run as smoothly as possible - I hope you all agree, if you have any questions, please do not hesitate to reply to this. There is still a 10% discount on advance tickets (quote \"AdvanceFace\" on booking) which gets you a full weekend adult camping ticket for just £22.50! On the gate this will be £30. Tickets are selling really well and so far we have sold almost double the number as at this time last year. You can book via the Classic Volks website \n<!-- w -->\n<a class=\"postlink\" href=\"http://www.classicvolks.com/vwfieldofdreams.html\">www.classicvolks.com/vwfieldofdreams.html</a>\n<!-- w --> \n<br>\n<br>The new venue details are as follows:\n<br>Escrick Park Estate,\n<br>Escrick,\n<br>York\n<br>YO19 6EA\n<br>\n<br>It really is a lovely venue, I hope you love it as much as I do! We also have some fantastic music for you again this year, starting on Friday night, we will be announcing the bands over the next few weeks, we wanted to get this sorted first and to let you all know. \n<br>\n<br>I hope all of this makes sense to you all, really looking forward to seeing you in September, many of you I'm sure I will bump into before this, at other shows over the summer!\n<br>\n<br>Thanks again to all of you!",
    "lastEdited" : "Sun Jun 22, 2014 10:29 am"
  } ]
}