{
  "forumId" : "10",
  "threadId" : "124322",
  "title" : "BUSFEST 2020",
  "originalUrl" : "https://ssvc.org.uk/phpbb/viewtopic.php?f=10&t=124322",
  "breadcrumbs" : [ {
    "url" : "./viewforum.php?f=41&sid=a9d0a7a50fb5d286bfa9067fb7ac0f61",
    "label" : "Events"
  }, {
    "url" : "./viewforum.php?f=10&sid=a9d0a7a50fb5d286bfa9067fb7ac0f61",
    "label" : "Events"
  } ],
  "totalPosts" : 10,
  "pageNumber" : 1,
  "totalPages" : 1,
  "posts" : [ {
    "postId" : "927891",
    "author" : {
      "username" : "BUSFEST",
      "userId" : "927891",
      "joined" : "Wed Feb 27, 2019 12:18 pm",
      "profileRank" : "Registered user",
      "location" : "-",
      "postCount" : "7",
      "avatarPath" : null
    },
    "content" : "<strong class=\"text-strong\">BUSFEST 2020 11TH - 13TH SEPTEMBER</strong>\n<br> \n<br> JUST A REMINDER FOLKS! \n<br> \n<br> Our \n<strong class=\"text-strong\">\"EARLY BIRD\"</strong> Ticket period runs out at the at the end of this month. \n<img class=\"smilies\" src=\"./images/smilies/icon_flower.gif\" width=\"31\" height=\"31\" alt=\":flower:\" title=\"flower\"> \n<br> \n<br> We will be introducing NEW 2020 prices from beginning of MARCH\n<br> \n<br> So get you bookings in NOW if you want to take advantage of a discount on your entry price.\n<br> \n<br> To book your tickets please go to TICKETS page on our Website. \n<br> \n<br> If you want to go into the Reserved SSVC Camping area you will need to add the club camping code (which is supplied to members by SSVC Camping rep) \n<br> \n<br> \n<a href=\"http://WWW.BUSFEST.ORG\" class=\"postlink\">WWW.BUSFEST.ORG</a>\n<br> \n<br> \n<img class=\"smilies\" src=\"./images/smilies/blob7.gif\" width=\"31\" height=\"31\" alt=\":blob5:\" title=\"blob5\">",
    "lastEdited" : "Thu Feb 13, 2020 7:37 pm"
  }, {
    "postId" : "929068",
    "author" : {
      "username" : "BUSFEST",
      "userId" : "929068",
      "joined" : "Wed Feb 27, 2019 12:18 pm",
      "profileRank" : "Registered user",
      "location" : "-",
      "postCount" : "7",
      "avatarPath" : null
    },
    "content" : "<span style=\"font-size:200%;line-height:116%\">BUSFEST NEWS - APRIL</span>\n<br> \n<br> \n<strong class=\"text-strong\">We hope that you have had an enjoyable Easter weekend!</strong> \n<img class=\"smilies\" src=\"./images/smilies/icon_flower.gif\" width=\"31\" height=\"31\" alt=\":flower:\" title=\"flower\"> \n<br> \n<br> The festival management team have been beavering away the past few months, planning for our festival, and keeping up to date with the recent national dilemmas.\n<br> \n<br> You may have noticed that many of the postponed events from the spring and early summer calendar are trying to re-schedule for this coming September - the traditional time of the year for the 'one and only' festival - BUSFEST!\n<br> With everything expected to be 'back to normal' way before then, and as “The biggest and best VW Camper Festival in the World”, it's anticipated that Busfest will be a very sought after destination after so many weeks of 'event drought' and uncertainties, so if you want to guarantee joining in the fun, make sure that you secure your place soon!\n<br> \n<br> We can assure you that the Busfest Production Team thoroughly plans each year’s event, and always puts in place the necessary measures to protect the public and maximise safety, whatever the cause, and we always review our plans as any circumstances change. With this in mind (and with our 2020 Festival still 20 weeks away), we continue planning and preparing for our event, whilst at the same time closely monitoring all developments with the current situation as they arrive, and adapting if necessary.\n<br> This may necessitate us having to make a few changes to our existing plans here and there, we just don't know yet......but rest assured, you can rely on BUSFEST to be your 'Light at the end of the tunnel'.\n<br> \n<br> We have another outstanding festival lined up for you again this year, so don't miss out on your chance to get hold of what will be very much sought after tickets!\n<br> \n<br> \n<strong class=\"text-strong\">You can book your BUSFEST TICKETS HERE;</strong>\n<br> \n<br> \n<a href=\"https://tickets.busfest.org/\" class=\"postlink\">https://tickets.busfest.org/</a>\n<br> \n<br> With more attractions yet to be announced, here's a taste of what you can expect:\n<br> \n<br> \n<strong class=\"text-strong\">FOOD.</strong>\n<br> After the success of last years addition of a new catering area in the Chill Zone, we will again have our STREET FOOD VILLAGE at the festival this year. This is located between the Chill Stage and the Pamper Zone.\n<br> This is in addition to our two other main catering villages situated on Main Street outside Severn Hall, and Trade Village opposite the Sheepshed Stage. With everything from Fish &amp; Chips, Hand made Pizza, Sushi, Vegetarian, Curry, Burgers, Carvery, Burritos, Paninis, Doughnuts, Mexican, to name a few......\n<br> We also have The Stockman's Restaurant over by the Avon &amp; Wye Halls serving a full carvery and A la carte menu, and Food for Thought in the Severn Hall offering snack foods.\n<br> PLEASE NOTE: WE ARE NOT RESPONSIBLE FOR THE PRICING STRUCTURE OR THE QUALITY AND QUANTITY OF ANY FOOD SERVED!\n<br> \n<br> \n<strong class=\"text-strong\">DRINKS.</strong>\n<br> CamperVin will once again be serving you a variety of beverages from their collection of converted vehicles that are dotted around the site.\n<br> TRADE VILLAGE.\n<br> With over 300 trade plots, our Trade Village is by far the biggest of any of the festivals. It takes a day just to go round this part of the festival!\n<br> \n<br> \n<strong class=\"text-strong\">WALKABOUTS.</strong>\n<br> Bringing their unique style of mayhem to Busfest, we welcome back THE 2MEN. Keep an eye out for them - they'll certainly be looking for you! We will also be welcoming our wandering dinosaurs, who will be mingling amongst you.\n<br> \n<br> \n<strong class=\"text-strong\">DISPLAYS.</strong>\n<br> BUSFEST SYNCRO 35 2020 is the 35th anniversary of the introduction of the T3 Syncro. The Busfest Syncro Zone is the largest gathering of VW T3 Syncros anywhere in the UK. We are aware that there may be some other “European” Syncro 35 celebrations happening, but one thing you can be sure of is that here in the UK we will also be celebrating the SYNCRO 35 in the Syncro Zone at Busfest 2020.\n<br> \n<br> PAMPER ZONE incorporating the MAN CAVE.\n<br> Located in it's new permanent home, slap bang in the middle of the Trade Village, our oasis of style, comfort and pampering will be running throughout the weekend. The ladies are well catered for, but this year, following on from it's inaugural success last year, we welcome back THE MAN CAVE. situated in a separate area of the Pamper Zone, and kitted out in style, for all your male needs.\n<br> \n<br> The Pamper Zone and Man Cave will offer:\n<br> Massage Parlour.\n<br> Facials. (Men &amp; Women)\n<br> Eyebrow Threading.\n<br> Make-up Artists.. (Full, part, tuition, advice)\n<br> Body Art.\n<br> Temporary Tattoos.\n<br> Hair Braiding.\n<br> Ladies’ Hair Styling.\n<br> Men's Hair Grooming.\n<br> Men's Barbers (Beard Care)\n<br> Relaxation .\n<br> Aromatherapy.\n<br> Nail Bar.\n<br> Holistic Therapies.\n<br> Yoga/Pilates sessions.\n<br> Well-being advice and instruction.\n<br> Products for sale, as well as samples, instruction, tuition.\n<br> \n<br> \n<strong class=\"text-strong\">ENTERTAINMENT:</strong> \n<a href=\"https://www.busfest.org/busfest-2015/entertainment/\" class=\"postlink\">https://www.busfest.org/busfest-2015/entertainment/</a> \n<img class=\"smilies\" src=\"./images/smilies/icon_bounce.gif\" width=\"15\" height=\"15\" alt=\":bounce:\" title=\"bounce\"> \n<br> \n<br> \n<strong class=\"text-strong\">MAIN ARENA.</strong>\n<br> We welcome the JEZ AVERY STUNT SHOW to our Main Arena - One show, 4 different vehicles!\n<br> The best bits of Jez Avery's 30 years experience on the outdoor event circuit...An amazing show on 4 wheels , 2 wheels,1 wheel and even on No wheels!!\n<br> Wheelies, stoppies, drifting, doughnuts, precision driving, two wheel driving and the all new roll over quad...Jez performs all his own stunts while delivering his famous commentary keeping everyone entertained and laughing along... So get your camera's ready for this spectacular show with audience participation. Doing two shows every day, you will have plenty of opportunity to catch this amazing show which is particularly poignant as Busfest will be the last live show that Jez will ever do, as he is retiring from the live show aspect of the business\n<br> afterwards.\n<br> \n<br> \n<strong class=\"text-strong\">MUSIC STAGES:</strong>\n<br> We have SIX music stages at Busfest 2020:\n<br> \n<br> \n<strong class=\"text-strong\">SEVERN STAGE.</strong>(Our main family stage)\n<br> Friday 20.00 - midnight.\n<br> The show where YOU are the star! Get on stage and sing any song 'karaoke style' but with a full rock band supporting you! Yes, it's the welcome return (after seven years) of the one and only ROCKAOKE, who will be belting out all your favorite hits while you're deciding if you've got the nerve to get up there or not. Go on! You know you want to!\n<br> Saturday 20.00 - Midnight.\n<br> Get out yer dayglo and whistles! The one and only ROCK THE 90's will be transporting you all back to the heady dance days of the 90's, playing all the well known and loved hits of the decade. Tune!\n<br> \n<br> \n<strong class=\"text-strong\">MARQUEE STAGE.</strong>(Our main adult stage)\n<br> Please note: The Marquee Stage is an adult venue and not suitable for children. Although we do not 'ban' children from this venue, the nature of the clientele and acts within would preclude any sensible and responsible parent from attempting to take a child into this environment.\n<br> Friday 20.00 - Midnight.\n<br> As part of their world tour, we bring you the masters of The Hacienda, and electro/dance/house specialists K-KLASS. Everyone knows their major hits \"Rhythm Is a Mystery\" and \"Let Me Show You\" and, along with some fine tuneage from our resident ANDEEJAY, the Marquee Stage will be 'bangin' with this spectacular show.\n<br> Saturday 20.00 - Midnight.\n<br> The BIG one! Our 'DIVA PARTY NIGHT'\n<br> Hosted and compered by the one and only BLOBBIE WILLIAMS, who will be doing his hilarious audience participation 'TAKE FAT' show, and introducing the top MADONNA and TINA TURNER acts. With our fantastic dancers, and ANDEEJAY providing the tuneage, this is going to be four hours of non-stop adult party fun and frolics! Oh, and if you're that way inclined, there's going to be a top prize given out on the night to the best female AND male! Madonna/Tina Turner lookalike in the audience.\n<br> \n<br> \n<strong class=\"text-strong\">SHEEPSHED STAGE.</strong>(Adult stage)\n<br> The Sheepshed Stage will have Rock, Ska, Punk, and Alternative from DEVIOUS, SKACASM and many more bands yet to be announced.\n<br> \n<br> \n<strong class=\"text-strong\">CHILL STAGE.</strong>(Family Stage)\n<br> The Chill Stage will have laid back folk rock with TIM RANDALL, DRUIDS BREW, ANDY RICHARDS, and many more guests to be announced.\n<br> \n<br> \n<strong class=\"text-strong\">DANCE STAGE.</strong>(Adult Stage)\n<br> Pumping Dance, Trance, Club and EDM at the Dance Stage with KWEENONY and their fantastic Party Bus, with DJ PETE, DJ FATD, LEE DAGGER/BIMBO JONES and special guest DJ's.\n<br> \n<br> \n<strong class=\"text-strong\">RADIO STAGE.(</strong>Family Stage)\n<br> New for this year - VDub Radio will be on Main Street with their Roadshow Rig and Studios, doing live sessions, interviews, guest appearances, fun &amp; frolics, and giveaways!\n<br> \n<br> \n<strong class=\"text-strong\">And we also have all this...........<br> </strong>\n<br> • AUTOJUMBLE\n<br> • VEHICLE SALES\n<br> • INDOOR &amp; OUTOOR DISPLAYS\n<br> • WELL TRAVELLED TRANSPORTERS\n<br> • ALTERNATIVE ENGINES\n<br> • CLUB DISPLAYS\n<br> • BEST THEMED CLUB CAMPING PLOT\n<br> • SPLIT SCREEN ALLEY – 50 SHADES OF BAY\n<br> • WEDGE STREET – T4’S GALORE – T5’S ALIVE\n<br> • SYNCRO ZONE (CELEBRATING SYNCRO 35)\n<br> • BUSFEST GAMES\n<br> • BUSFEST CHARITY AUCTION\n<br> • SHOW &amp; SHINE • COOKING IN A CAMPER\n<br> • ANIMAL ANTICS\n<br> • GUIDE DOGS FOR THE BLIND\n<br> • JENNINGS FUNFAIR\n<br> • CHILDREN'S ENTERTAINERS\n<br> • CHILDREN'S TALENT SHOW\n<br> • JUNKFISH\n<br> • FACE PAINTERS\n<br> • BUSFEST CINEMA\n<br> • SYNCRO TRIAL &amp; SYNCRO OBSTACLE COURSE\n<br> \n<br> \n<a href=\"http://WWW.BUSFEST.ORG\" class=\"postlink\">WWW.BUSFEST.ORG</a> \n<img class=\"smilies\" src=\"./images/smilies/icon_cool.gif\" width=\"15\" height=\"15\" alt=\"8)\" title=\"Cool\">",
    "lastEdited" : "Sat Apr 18, 2020 9:56 pm"
  }, {
    "postId" : "930356",
    "author" : {
      "username" : "supersvws",
      "userId" : "930356",
      "joined" : "Wed May 19, 2010 8:54 pm",
      "profileRank" : "Registered user",
      "location" : "-",
      "postCount" : "15",
      "avatarPath" : null
    },
    "content" : "Hi looking to get tickets for Busfest but how things are will it go a head because in the past its been get your tickets by the end of June to get in our ssvc field witch is great we have gone for the last 20 years thanks . \n<img class=\"smilies\" src=\"./images/smilies/icon_flower.gif\" width=\"31\" height=\"31\" alt=\":flower:\" title=\"flower\">",
    "lastEdited" : "Sat Jun 06, 2020 4:56 pm"
  }, {
    "postId" : "930358",
    "author" : {
      "username" : "Dougie",
      "userId" : "930358",
      "joined" : "Tue Feb 21, 2006 8:31 am",
      "profileRank" : "SSVC Committee Member",
      "location" : "Redditch",
      "postCount" : "902",
      "avatarPath" : "./download/file.php%3Favatar=2106_1498983016.jpg"
    },
    "content" : "As far as we know it is going ahead and we will have our usual field. But as you know, things change on virtually a daily basis.",
    "lastEdited" : "Sat Jun 06, 2020 6:13 pm"
  }, {
    "postId" : "930397",
    "author" : {
      "username" : "supersvws",
      "userId" : "930397",
      "joined" : "Wed May 19, 2010 8:54 pm",
      "profileRank" : "Registered user",
      "location" : "-",
      "postCount" : "15",
      "avatarPath" : null
    },
    "content" : "Cheers Dougie ill book them and fingers crossed we will be there ! do you have the code please . \n<img class=\"smilies\" src=\"./images/smilies/icon_cool.gif\" width=\"15\" height=\"15\" alt=\"8)\" title=\"Cool\">",
    "lastEdited" : "Sun Jun 07, 2020 8:39 pm"
  }, {
    "postId" : "930403",
    "author" : {
      "username" : "Dougie",
      "userId" : "930403",
      "joined" : "Tue Feb 21, 2006 8:31 am",
      "profileRank" : "SSVC Committee Member",
      "location" : "Redditch",
      "postCount" : "902",
      "avatarPath" : "./download/file.php%3Favatar=2106_1498983016.jpg"
    },
    "content" : "<blockquote>\n <div>\n  <cite><a href=\"./memberlist.php?mode=viewprofile&amp;u=34258&amp;sid=a9d0a7a50fb5d286bfa9067fb7ac0f61\">supersvws</a> wrote: <a href=\"./viewtopic.php?p=930397&amp;sid=a9d0a7a50fb5d286bfa9067fb7ac0f61#p930397\" data-post-id=\"930397\" onclick=\"if(document.getElementById(hash.substr(1)))href=hash\">↑</a>\n   <div class=\"responsive-hide\">\n    Sun Jun 07, 2020 8:39 pm\n   </div></cite> Cheers Dougie ill book them and fingers crossed we will be there ! do you have the code please . \n  <img class=\"smilies\" src=\"./images/smilies/icon_cool.gif\" width=\"15\" height=\"15\" alt=\"8)\" title=\"Cool\"> \n </div>\n</blockquote> PM sent",
    "lastEdited" : "Mon Jun 08, 2020 3:59 am"
  }, {
    "postId" : "930702",
    "author" : {
      "username" : "pastymaster",
      "userId" : "930702",
      "joined" : "Sun Mar 17, 2019 3:53 pm",
      "profileRank" : "SSVC Member",
      "location" : "Cheshire",
      "postCount" : "18",
      "avatarPath" : "./download/file.php%3Favatar=43117_1556052185.jpg"
    },
    "content" : "Hi, think we are going to risk BusFest being on as well.\n<br> Can you please PM me the code?\n<br> \n<br> Thank you",
    "lastEdited" : "Sun Jun 21, 2020 7:10 pm"
  }, {
    "postId" : "930717",
    "author" : {
      "username" : "Andy C",
      "userId" : "930717",
      "joined" : "Wed Sep 04, 2019 10:31 am",
      "profileRank" : "SSVC Member",
      "location" : "Leamington Spa, Warwickshire",
      "postCount" : "37",
      "avatarPath" : "./download/file.php%3Favatar=43332_1588620881.jpeg"
    },
    "content" : "Hi Dougie, I'm going to take a chance that its on. Can you PM me the code please. Thanks",
    "lastEdited" : "Mon Jun 22, 2020 2:58 pm"
  }, {
    "postId" : "930719",
    "author" : {
      "username" : "Dougie",
      "userId" : "930719",
      "joined" : "Tue Feb 21, 2006 8:31 am",
      "profileRank" : "SSVC Committee Member",
      "location" : "Redditch",
      "postCount" : "902",
      "avatarPath" : "./download/file.php%3Favatar=2106_1498983016.jpg"
    },
    "content" : "Pm sent Andy",
    "lastEdited" : "Mon Jun 22, 2020 5:20 pm"
  }, {
    "postId" : "930959",
    "author" : {
      "username" : "BUSFEST",
      "userId" : "930959",
      "joined" : "Wed Feb 27, 2019 12:18 pm",
      "profileRank" : "Registered user",
      "location" : "-",
      "postCount" : "7",
      "avatarPath" : null
    },
    "content" : "<strong class=\"text-strong\"><span style=\"font-size:150%;line-height:116%\">BUSFEST 2020 - ANNOUNCEMENT</span></strong>\n<br> \n<br> To all our dear friends, festival-goers, customers and supporters and \n<strong class=\"text-strong\">SPLIT SCREEN VAN CLUB CAMPERS.</strong>\n<br> \n<br> \n<strong class=\"text-strong\">The day has finally come that we hoped, wished and prayed would never come, and it is with a very heavy heart that we have to inform you that we must regrettably postpone Busfest. 2020 until September 2021. </strong> \n<img class=\"smilies\" src=\"./images/smilies/icon_sad.gif\" width=\"15\" height=\"15\" alt=\":(\" title=\"Sad\"> \n<br> \n<br> Despite battling for months to keep everything alive, outside forces, third party developments, along with some unrealistic restrictions that we would have had to adhere to, have made our festival impossible to carry on being produced in a workable, useable, sociable and financially secure manner this year. \n<br> \n<br> We have now reached the point where we have had to make a firm decision based on this information, and the W.H.O. and UK government guidelines that we have to work to. There are still just too many hurdles still to overcome and no clear timeline as to when any of these will be cleared in the foreseeable future. \n<br> \n<br> You have told us how much you all hoped and wanted us to be able to go ahead, and along with you, we've kept a positive and optimistic outlook these past few weeks because, for many reasons, we wanted to be able to do just that............... \n<br> \n<br> We wanted to go ahead – to give you, our loyal fan-base, something to look forward to. A 'light at the end of the tunnel'. An exciting and enjoyable end to what has been a miserable year. \n<br> \n<br> We wanted to go ahead - to support the hundreds of traders that have had a disastrous year and are desperate to trade. \n<br> \n<br> We wanted to go ahead - to support The Three Counties Showground and its staff who have had a disastrous year and are also desperate to open up and get back in business again. \n<br> \n<br> We wanted to go ahead - to support the local shops, businesses and wider community who benefit from thousands of you shopping with them, eating and drinking in their pubs and restaurants, staying at their campsites, hotels, B&amp;Bs, visiting their premises and attractions, etc. \n<br> \n<br> We wanted to go ahead - to give jobs to the hundreds of crew, support workers, artists, businesses and suppliers, up and down the country, who we employ or contract every year, and who rely on Busfest. as one of their major sources of income. \n<br> \n<br> It saddens us that we now cannot fulfill any of these needs and wishes this year.\n<br> \n<br> What happens now? \n<img class=\"smilies\" src=\"./images/smilies/icon_confused.gif\" width=\"15\" height=\"15\" alt=\":?\" title=\"Confused\"> \n<br> \n<br> If you have already purchased your passes, these will be automatically transferred over to the new postponed show dates next year (September 10th, 11th, 12th). This will enable you to have guaranteed places at Busfest. 2021 at the 2020 price you have already paid.\n<br> Any tickets that are purchased for the 2021 festival when our online booking office opens in early January, will be at the (yet to be published) 2021 prices. \n<br> \n<br> There will be NO 'Early-Bird' discount passes for Busfest. 2021.\n<br> \n<br> Refunds will of course be available to those that require them, but as an independent festival, we would appreciate it if you could opt for the roll-over option if possible, and know that you are safely booked in and therefore guaranteed a place at the next Busfest.. It also assists us greatly in planning next year's festival by having this advanced knowledge. \n<br> \n<br> If you require a refund, these can be applied for up to 31st July 2020 by emailing bookings@busfest..org, and they will be processed in due course. \n<br> \n<br> Once again, we thank you for joining us with your optimism and support. If one good thing comes from all of this, it's that we will have one hell of a party with you all next September, and you're already booked in for it!. Full updates are also available on our website www.busfest..org\n<br> \n<br> Keep well, Keep safe. We will live to fight another day. \n<img class=\"smilies\" src=\"./images/smilies/icon_flower.gif\" width=\"31\" height=\"31\" alt=\":flower:\" title=\"flower\"> \n<br> \n<br> \n<img class=\"smilies\" src=\"./images/smilies/icon_cool.gif\" width=\"15\" height=\"15\" alt=\"8)\" title=\"Cool\">",
    "lastEdited" : "Fri Jul 03, 2020 1:55 pm"
  } ]
}