{
  "forumId" : "11",
  "threadId" : "73869",
  "title" : "FORUM PRINCIPLES, RULES AND GUIDLEINES",
  "originalUrl" : "https://ssvc.org.uk/phpbb/viewtopic.php?f=11&t=73869",
  "breadcrumbs" : [ ],
  "totalPosts" : 1,
  "pageNumber" : 1,
  "totalPages" : 1,
  "posts" : [ {
    "postId" : "570638",
    "author" : {
      "username" : "John",
      "userId" : "Unknown",
      "joined" : "-",
      "profileRank" : "-",
      "location" : "-",
      "postCount" : "-",
      "avatarPath" : null
    },
    "content" : "The committee undertook to re-evaluate the Club’s arrangements for moderating the SSVC forum following concerns expressed recently by some users. As a result of our detailed considerations we have agreed the following:\n<br>• Principles and Rules for Moderation of the SSVC Forum – The Principles set out the framework within which the forum operates and the Rules provide specific guidelines for our moderators to work within.\n<br>• SSVC Forum Rules – The rules set out how we expect people to behave on the SSVC forum.\n<br>• SSVC Forum Posting Guidelines – The guidelines provide detailed explanations of what we consider to be good posts, to try to ensure that people use the SSVC forum sensibly for the benefit of all users.\n<br>• Classified Adverts - We have formalised the guidelines for placing classified adverts on the SSVC forum.\n<br>\n<br>PRINCIPLES FOR MODERATION OF THE SSVC FORUM\n<br>\n<br>1. The SSVC Forum is an integral part of the Split Screen Van Club.\n<br>2. The prime objective of the forum is to support and further the aims of the Club to promote the continuing ownership and use of split screen vans and assist members by the dissemination of technical knowledge.\n<br>3. The SSVC committee retains overall responsibility for controlling access to and activity on the forum.\n<br>4. Day to day monitoring and regulation of the forum will be delegated to a panel of moderators, who are approved by the committee and agree to act at all times in accordance with the Principles, Rules and Guidelines approved by the committee.\n<br>5. The committee will not permit users of the forum to post comments that in its view might bring the Club’s name into disrepute or are in any other way considered by the committee to be unreasonable or offensive.\n<br>\n<br>RULES TO BE APPLIED BY MODERATORS\n<br>\n<br>\n<br>1. Moderators will operate within the following rules but where any matter is significant it will be drawn to the attention of the committee without delay.\n<br>2. The only posts that will be set as sticky must be justified as being of particular interest to members and must be agreed by at least two moderators. Sticky posts must be reviewed regularly by an Administrative Moderator to ensure that they are still relevant.\n<br>3. As a general rule posts should not be deleted; instead threads will be locked if they are a cause for concern until appropriate action has been agreed, either through the moderator panel or through reference to the committee.\n<br>4. If someone posts material that is pornographic/racist/offensive or illegal in any other way, the post will be removed to the moderator forum and the member given a warning that the behaviour is not acceptable.\n<br>5. Naming and shaming threads are not allowed on the forum. However threads about delayed delivery dates may sometimes be acceptable depending on the circumstances. If there is any doubt the post will be removed to the moderator forum for further discussion. At the time of moving a thread, the moderator will send a PM to the original poster stating why the post has been removed.\n<br>6. Any new thread which unreasonably criticises the running of the Club will:\n<br>• Be given a reply stating the original poster will be sent a PM\n<br>• Have the thread locked\n<br>• Have a PM sent to the original poster stating that if they have a question to be put to the committee, then it should be addressed to the Secretary.\n<br>7. A reply within an existing post which unreasonably criticises the running of the Club will:\n<br>• Be given a reply stating the original poster will be sent a PM stating that if they have a question then it should be addressed to the Secretary\n<br>• If other posters begin to repeat the question then they should be sent a PM stating that if they have a question then it should be addressed to the Secretary\n<br>8. Avatars should not be pornographic/racist/offensive or illegal. If they are found to be so the person should be sent a PM to request that they remove it except in extreme cases where an administrator will be asked to remove the avatar immediately (a moderator does not have the facility to do this).\n<br>9. For sale/wanted\n<br>• All for sale posts require a location and a price for all items. If a price is not in the post then a reply will be posted giving a link to the for sale guidelines as well as sending a PM to the original poster. If after 12 hours of posting the reply providing a link to the rules the post has not been amended with a price, then the first post will be edited removing all details of the for sale post and a link placed to the guidelines. By sending a PM to the member in the first post, the member will have a copy of his post should he wish to repost it.\n<br>• The only Posts that will be set as sticky are ones for group buys. At no other times should any other for sale/wanted post be set to sticky unless the committee decide that it is allowed.\n<br>• All classified posts will be examined to ensure that they are fair and reasonable and any posts from suspected “traders” will be subject to special scrutiny and moderation.\n<br>\n<br>SSVC FORUM RULES\n<br>Purpose of the rules\n<br>1. We don’t have many rules but everyone needs to work together to make the forum enjoyable and informative. The same rules apply to member only parts of the forum as much as to those with open access. Please also see our posting guidelines.\n<br>2. Our moderators are not generally strict (apart from removing offensive material) but this relaxed approach relies on members being responsible for their own posts. It will only work if members follow the rules.\n<br>General conduct\n<br>3. Please be nice to other forum users especially new members. New members are important to the forum as they might contribute a lot in the future. If a new member asks something that has been asked a thousand times before then you should gently point them towards a thread that will answer their question or even answer the question yourself. You can use material from the previous threads.\n<br>4. Insulting other members is not allowed. If someone upsets you on the forum let a moderator who is impartial sort the problem out.\n<br>5. Don't deliberately try to wind people up.\n<br>Intolerance\n<br>6. We welcome members of any skin colour, religion, race, sexuality, location or whatever. This is a VW split screen van enthusiast’s forum and intolerance has absolutely no place on here. Please report any intolerant members to the moderators so that we can deal with them. Don't reply to them as that may encourage them and to cause even more upset.\n<br>Only post appropriate material\n<br>7. A wide variety of people are interested in splitties and we don’t want to upset anyone. Please avoid 'adult content' and do not post or link to anything illegal, racial intolerant, or otherwise unsuitable.\n<br>Advertising\n<br>8. Advertising is only allowed in the specific for sale sections.\n<br>Copyright (Images and Text)\n<br>9. Please do not use the forum to distribute any material that might be copyrighted by others. You must seek the copyright owner's permission before reproducing their work.\n<br>\n<br>10. Original text and images (content) that you add to the forum remain your copyright, but by agreeing to the forum rules on registration you grant permission for the SSVC website to display that content for an unlimited time.\n<br>\n<br>Complaints\n<br>11. If anyone does have complaints about the information contained on the web site or the forum then contacting a moderator is the best way to sort them out.\n<br>Respect our Moderators\n<br>12. Please respect the wishes of moderators or site administration. Moderating is not an easy job, so please don't make it worse by challenging moderators’ decisions. Accept and move on. If you do have a complaint about moderation please first calm down then politely private message the moderator concerned. There's probably a misunderstanding involved that can be sorted without argument.\n<br>Agreeing to the rules\n<br>13. A condition of using the forum is that you abide by the entire forum Principles, Rules and Guidelines. We reserve the right to ban anyone who willfully violates them, as access to our forum is a privilege and not a right.\n<br>The rules can change\n<br>14. The forum rules do evolve over time. Please check back every now and again for the latest version.\n<br>SSVC FORUM POSTING GUIDELINES\n<br>These guidelines for posting on the forum are intended to keep the forum useful and interesting for our members.\n<br>1. For new topics please start the thread in the appropriate section.\n<br>2. Before posting a new thread that asks a question please do a search. It is possible that your question has been asked before and you might find the answer more quickly with a search.\n<br>3. Replies to posts should be interesting and useful to the thread owner. They can sometimes go off-topic, but bear in mind that if the thread wasn't properly answered then other members might not answer it after it has gone off-topic.\n<br>4. The quality of posts is what attracts new members to the site and keep existing members returning. Before making a post read it carefully and make sure that it is appropriate.\n<br>5. If you started a thread about a problem and you found the answer, please post it to help other members who have a similar problem in the future.\n<br>6. The SSVC forum is for discussion not for arguments. Other members will be trying to help you with their posts, so please don't belittle their contribution.\n<br>7. Don't overdo the icons. They are intended to add expression that might otherwise be lost in the written word. Please don't use them for decoration – that can be irritating.\n<br>GUIDELINES FOR USING THE SSVC CLASSIFIED ADS\n<br>\n<br>Please read the following guidelines before posting a for sale advert in our classified adverts section.\n<br>\n<br>SELLING AN ITEM\n<br>\n<br>1. We have a strict policy of not accepting adverts that merely ask for \"offers\". You may specify a price followed by \"or offers\", or ono \"or nearest offer\".\n<br>\n<br>2. You must include in your post the location of the item that you are selling. That would normally be the town in which you live. Further details can be exchanged by pm, email or phone when a sale has been agreed.\n<br>\n<br>3. We do not allow posts that merely provide a link to ebay or any other site\n<br>4. If you have a number of items to sell they should all be included in one single post.\n<br>5. Please mark your post as SOLD as soon as possible after a sale has been concluded.\n<br>\n<br>BUYING AN ITEM\n<br>\n<br>5. If you would like to buy an item you should post \"first dibs\" and follow that up with a pm to arrange payment and delivery/collection details. Posting \"first dibs\" makes it clear to the seller that you are intending to purchase the item.\n<br>\n<br>6. If you would like some more info on an item then either post up the question or pm the seller. We do not allow posts that say \"first dibs\" followed by a request pictures or further information as such action may prevent another buyer from securing the item.\n<br>7. We do not allow negative posts or posts which merely comment on a for sale thread.\n<br>\n<br>GENERAL COMMENTS\n<br>\n<br>8. Please be aware that if a seller advertises items elsewhere then there is a chance that a sale may be agreed before the for sale post is marked as SOLD.\n<br>9. A seller has the right to sell to whom he wishes and items are often sold by pm.\n<br>\n<br>Dave &amp; Joyce\n<br>SSVC Club Secretary",
    "lastEdited" : "Thu Mar 10, 2011 8:27 pm"
  } ]
}