{
  "forumId" : "11",
  "threadId" : "111376",
  "title" : "SSVC Social Media Rules and Guidelines.",
  "originalUrl" : "https://ssvc.org.uk/phpbb/viewtopic.php?f=11&t=111376",
  "breadcrumbs" : [ ],
  "totalPosts" : 7,
  "pageNumber" : 1,
  "totalPages" : 1,
  "posts" : [ {
    "postId" : "841250",
    "author" : {
      "username" : "Unknown",
      "userId" : "841250",
      "joined" : "Thu Mar 13, 2003 7:21 pm",
      "profileRank" : "SSVC Committee Member",
      "location" : "Coventry",
      "postCount" : "1783",
      "avatarPath" : "http://i22.photobucket.com/albums/b317/nisted/r2valu.jpg"
    },
    "content" : "SSVC Social Media Rules and Guidelines.\n<br>\n<br>July 2015\n<br>\n<br>Thanks for taking the time to read these notes. Below are the broad guidelines and 'codes of practice' for users of the club forum, facebook page(s) and any other online social media associated with the SSVC. You'll also find information here on how you can expect to be treated by moderators and administrators. It's intended to try to keep this as short and sweet as possible - no one likes being lectured to - but 15+ years of online presence have given a good idea of the likely pitfalls of using and running an online community. \n<br>Like the club as a whole, the SSVC'S online community is designed to be a friendly and welcoming place for both club members and non members alike. Both online and offline, the overriding aim of the SSVC is to support and promote ownership and use of split screen transporters. \n<br>Moderation tends to be carried out with a 'light touch', but this relies on everyone playing nicely together. Everyone is entitled to their opinion, but those who persistently show themselves to be unable put their own point of view without respect for others' opinions will be warned, and if necessary, banned from any and all club social media. All are welcome here, and intolerance in any form will not be accepted, and will be dealt with promptly and decisively.\n<br>Please try and post any comments in the most relevant area, and where appropriate (such as facebook) please keep posts 'on topic'; your garden/cat/china frog collection may be fascinating, but there are other groups or your own wall for that \n<img class=\"smilies\" src=\"./images/smilies/smile.gif\" alt=\":-)\" title=\"Smile\">. On the forum, the vast majority of subject matter is catered for, even specific areas for 'off -topic' posting (even china frog collections are welcome here), but adult rated, illegal, intolerant or overtly offensive posts or material are not. These posts will be removed without notice, and persistent offenders excluded.\n<br>There are a few matters which warrant their own specific guidelines, and they are;\n<br>Naming and shaming. \n<br>The club cannot allow the 'naming and shaming' of any garage, restorer, or individual for work that may be deemed as shoddy, overpriced, dangerous or not as agreed. \n<br>'Why is that?', I hear many a moderate and reasonable individual cry? A fair question, and one that deserves a reasonable answer. \n<br>When work on a vehicle 'goes bad' and restorer and owner reach an impasse, turning to social media has proven too often to simply fan the flames. As well as the bad blood, ill feeling, and general resentment that 'naming and shaming' tends to provoke, the fact is that the exact circumstances of any disagreement are often viewed very differently by different people. This make it almost impossible for a fair overview of the dispute to be presented by either side. Things are rarely as black and white as they may first appear, and the restorer may feel just as aggrieved as the owner. The truth of the matter is almost certainly known by those involved, but being most eloquent, or first to the table does not make either party 'in the right' \n<br>Additionally, by allowing or facilitating potentially defamatory, derogatory, libellous or malicious content, the club, and by extension the committee (who, let's not forget, are just other owners/club members too) may become liable, and none of us signed up for that.\n<br>So what can be done? In cases where that matter has gone through the courts, and the facts are a matter of record, then there's no problem. \n<br>And where can the club help in these matters? The following advice, while not exhaustive, may prove useful.\n<br>If you have issues with anyone carrying out work on a vehicle, the best advice is to keep talking, and do your best to resolve the situation amicably if at all possible. \n<br>If the relationship has broken down completely, the forum is a great place to ask for general advice, but if any specific details potentially identifying or naming any company or individual are made, then the offending post or thread may be removed without warning. Others who have been through similar situations are often well placed and happy to share their experiences. \n<br>Finally, do not underestimate the value of positive personal recommendation. If you've had good service, let others know.\n<br>\n<br>\n<br>For Sale items.\n<br>\n<br>Selling\n<br>Let's make this really simple, if you wish to offer an item for sale, please do so in the relevant section. \n<br>It is very strongly advised that a price, location, and a reasonable description are included in the advert. Locations help buyers determine the logistics of collection or delivery.\n<br>Adverts asking for 'offers' tend to be taken as the seller just 'trying their luck'. If you are looking to maximise your return on an item, consider putting it on ebay, and posting the listing into the 'Ebay Auctions' forum.\n<br>If you genuinely don't know how much an items is worth, try looking at older for sale threads for similar items, searching on ebay, or asking advice in the general forum. If you do post an advert without a price or location, be prepared to be asked for details multiple times, and don't be offended if you are offered potentially insulting amounts - you asked for 'offers'.\n<br>Once you've completed the sale of an item, please edit the title, or post back in to the thread marking it as SOLD. This helps prevent buyers or sellers wasting their time on an item that's no longer available.\n<br>\n<br>Buying\n<br>If a seller hasn't included a price, location or description, by all means ask for these, but please keep it nice. A seller has as much right to try to maximise their return on an item as a buyer does to try to get a bargain. \n<br>When buying an item sourced online, use the same good sense that you would with any other transaction. There are hundreds of happy buyers and seller brought together by a club site, but just because someone is using the SSVC's presence doesn't necessarily make them a club member, or even a 'good guy'. If an offer just seems way too good to be true, or the seller is asking for payment in a strange or unusual manner, then proceed with caution.\n<br>\n<br>Using 'Dibs' or 'BIN'.\n<br>\n<br>Over the years, the use of 'Dibs' (and more recently BIN - Buy It Now) to indicate a buyers wish to purchase an item became common on many forums, and was seen by many buyers as 'sealing the deal'. The growth of social media brought an increasing number of ways for people to offer their unwanted items to the broadest possible audiences, and by the time a user of one platform marks 'DIBS', the item could be sold elsewhere.\n<br>To avoid confusion, argument or misunderstanding, it's worth bearing in mind that marking 'DIBS', while a useful way of indicating to the seller that you are prepared to buy, does not commit the seller to any form of sale. As with sales negotiated at club events, all transactions carried out via any form of social media associated with the SSVC are a private matter, and the sellers decision is final.\n<br>\n<br>Club reputation.\n<br>\n<br>The committee will not permit users of the forum to post comments that, in its view, might bring the Club’s name into disrepute, or are in any other way considered to be unreasonable or offensive, and reserves the right to remove these posts without warning. If you have a genuine grievance with any aspect of the running of the SSVC please place this in writing to the club secretary.",
    "lastEdited" : "Mon Jul 06, 2015 9:40 pm"
  }, {
    "postId" : "841269",
    "author" : {
      "username" : "minxster",
      "userId" : "841269",
      "joined" : "Wed Dec 14, 2011 6:29 pm",
      "profileRank" : "Registered user",
      "location" : "-",
      "postCount" : "177",
      "avatarPath" : null
    },
    "content" : "Aye understood!however how have i breached these guidelines as a member....",
    "lastEdited" : "Tue Jul 07, 2015 6:23 am"
  }, {
    "postId" : "841272",
    "author" : {
      "username" : "BusBug&KG",
      "userId" : "841272",
      "joined" : "Sun Oct 07, 2007 9:33 pm",
      "profileRank" : "SSVC Member",
      "location" : "Buckinghamshire",
      "postCount" : "3382",
      "avatarPath" : "http://i214.photobucket.com/albums/cc35/myvwspics/66%20Bus%20Pics/ssvc.jpg"
    },
    "content" : "<blockquote>\n <div>\n  <cite>minxster wrote:</cite>Aye understood!however how have i breached these guidelines as a member....\n </div>\n</blockquote>\n<br>Think it's gone out to ever one,unless I have been a bad boy too!!",
    "lastEdited" : "Tue Jul 07, 2015 6:57 am"
  }, {
    "postId" : "841327",
    "author" : {
      "username" : "piran",
      "userId" : "841327",
      "joined" : "Thu Jul 24, 2014 5:20 pm",
      "profileRank" : "Registered user",
      "location" : "-",
      "postCount" : "234",
      "avatarPath" : null
    },
    "content" : "received and understood.\n<br>many thanks\n<br>rob",
    "lastEdited" : "Tue Jul 07, 2015 5:03 pm"
  }, {
    "postId" : "841347",
    "author" : {
      "username" : "Rippers",
      "userId" : "841347",
      "joined" : "Thu Jul 21, 2011 4:36 pm",
      "profileRank" : "SSVC Member",
      "location" : "-",
      "postCount" : "1193",
      "avatarPath" : "http://i1206.photobucket.com/albums/bb454/splitty64/IMG_2626-1.jpg"
    },
    "content" : "I understand and will respect the wishes of the club however would like to let it be know that I disagree with the banning of the name and shame.\n<br>Primarily the use of name and shame is often a last ditch attempt to resolve an issue that has failed to be resolved and often the pressure of airing concerns publicly prompts the person/company into action. \n<br>Secondly I would also like to know what kind of feedback my fellow members are having i.e. if a certain trader is ripping people off or a product is crap I would want to know about it. \n<br>This censorship doesn't serve the members it fact it harms the members. The only real reason is you claim to be liable which is simply not the case as it should be clear that you're not liable when you sign up to the forum and that the views and opinions expressed on this site are not necessarily the views of the official club. It would be like sueing eBay because someone gave you negative feedback \n<img class=\"smilies\" src=\"./images/smilies/icon_lol.gif\" alt=\":lol:\" title=\"LOL\"> \n<br>\n<br>Thats my opinion and I won't argue or grind it out with you but I think an unofficial SSVC site/Facebook page could be handy in this instance as I certainly don't want to be led down a garden path with a rogue trader when I could have been warned. I also feel this decision should have run by the members (if it was I apologise and didn't see or hear it)",
    "lastEdited" : "Tue Jul 07, 2015 7:19 pm"
  }, {
    "postId" : "841436",
    "author" : {
      "username" : "beetleben",
      "userId" : "841436",
      "joined" : "Fri Aug 20, 2010 8:30 pm",
      "profileRank" : "Registered user",
      "location" : "Colwyn Bay",
      "postCount" : "1009",
      "avatarPath" : "http://i1331.photobucket.com/albums/w592/beetleben1/8668b2e0-d675-4baf-a0ad-0e3d3cac9ff9_zps29643102.jpg"
    },
    "content" : "<blockquote>\n <div>\n  <cite>BusBug&amp;KG wrote:</cite>\n  <blockquote>\n   <div>\n    <cite>minxster wrote:</cite>Aye understood!however how have i breached these guidelines as a member....\n   </div>\n  </blockquote>\n  <br>Think it's gone out to ever one,unless I have been a bad boy too!!\n </div>\n</blockquote>\n<br>\n<br>Yeah I got the PM twice, someone is trying to tell me something \n<img class=\"smilies\" src=\"./images/smilies/icon_lol.gif\" alt=\":lol:\" title=\"LOL\">",
    "lastEdited" : "Wed Jul 08, 2015 6:00 pm"
  }, {
    "postId" : "841483",
    "author" : {
      "username" : "beetleben",
      "userId" : "841483",
      "joined" : "Fri Aug 20, 2010 8:30 pm",
      "profileRank" : "Registered user",
      "location" : "Colwyn Bay",
      "postCount" : "1009",
      "avatarPath" : "http://i1331.photobucket.com/albums/w592/beetleben1/8668b2e0-d675-4baf-a0ad-0e3d3cac9ff9_zps29643102.jpg"
    },
    "content" : "<blockquote>\n <div>\n  <cite>Rippers wrote:</cite>I understand and will respect the wishes of the club however would like to let it be know that I disagree with the banning of the name and shame.\n  <br>Primarily the use of name and shame is often a last ditch attempt to resolve an issue that has failed to be resolved and often the pressure of airing concerns publicly prompts the person/company into action. \n  <br>Secondly I would also like to know what kind of feedback my fellow members are having i.e. if a certain trader is ripping people off or a product is crap I would want to know about it. \n  <br>This censorship doesn't serve the members it fact it harms the members. The only real reason is you claim to be liable which is simply not the case as it should be clear that you're not liable when you sign up to the forum and that the views and opinions expressed on this site are not necessarily the views of the official club. It would be like sueing eBay because someone gave you negative feedback \n  <img class=\"smilies\" src=\"./images/smilies/icon_lol.gif\" alt=\":lol:\" title=\"LOL\"> \n  <br>\n  <br>Thats my opinion and I won't argue or grind it out with you but I think an unofficial SSVC site/Facebook page could be handy in this instance as I certainly don't want to be led down a garden path with a rogue trader when I could have been warned. I also feel this decision should have run by the members (if it was I apologise and didn't see or hear it)\n </div>\n</blockquote>\n<br>\n<br>I understand your viewpoint but the naming and shaming is a legal minefield, its just not worth the club getting involved in. People can always share PM's of bad experiences without compromising the club \n<img class=\"smilies\" src=\"./images/smilies/icon_wink.gif\" alt=\":wink:\" title=\"Wink\">",
    "lastEdited" : "Wed Jul 08, 2015 10:42 pm"
  } ]
}