{
  "forumId" : "2",
  "threadId" : "71567",
  "title" : "Chassis notching!",
  "originalUrl" : "https://ssvc.org.uk/phpbb/viewtopic.php?f=2&t=71567&start=75",
  "breadcrumbs" : [ {
    "url" : "./viewforum.php?f=2&sid=06201a2ba675532968ad48073154559f",
    "label" : "VW Related Chat"
  } ],
  "totalPosts" : 120,
  "pageNumber" : 6,
  "totalPages" : 8,
  "posts" : [ {
    "postId" : "552396",
    "author" : {
      "username" : "Russ T",
      "userId" : "552396",
      "joined" : "Thu Feb 14, 2008 1:10 pm",
      "profileRank" : "SSVC Member",
      "location" : "kidderminster",
      "postCount" : "1671",
      "avatarPath" : "./download/file.php%3Favatar=16503_1287743477.jpg"
    },
    "content" : "<blockquote>\n <div>\n  <cite>Sweet Rides wrote:</cite>\n  <blockquote>\n   <div>\n    <cite>Russ T wrote:</cite>could you post up the info that say's VOSA is actually going to clasify lowered vehicles as unsafe or why they would all be on Q plates as these threats have been around all year and I have not seen a single thread about it. crash the damage\n   </div>\n  </blockquote>\n  <br>\n  <br>This thread is not about lowered vehicles, if you want to discuss that then use the SBS thread. This thread is about Notched vehicles.\n  <br>\n  <br>The thread that contains the information you require regarding the legality of Q plates and Chassis Mods is this thread. I have included the quote below to save you having to trawl back through the thread to find it.\n  <br>\n  <br>\n  <blockquote>\n   <div>\n    <cite>686 bus-boy wrote:</cite>What a thread ! \n    <img class=\"smilies\" src=\"./images/smilies/icon_eek.gif\" alt=\"8O\" title=\"eek\"> Simple fact here is - whether you like it or not, whether you think its safe or not that ANY chassis mods done to a bus this includes tubbing the arches and all that malaki that your bus- IF inspected would be but on a 'Q' plate, no questions asked , thats if it actually passed the iva test,which it wouldnt! FACT. Trust me, i've been into this. I'm a qualified welder / fabricator and am more than competant to do these mods, i didnt, i'm a big fan of modified motors and not a purist, but it's your call if you wanna run the risks of the if's,maybes and buts. My old black bus was 'slammed' as it's called, narrowed beam, dropped spindles and all that and yes i think it looked cool but it was a pain in the a$$ sometimes, i didnt have to do any chassis notching on that tho and it was plenty low enough, to go that extra inch or two lower would mean big mods bein done and a seriously unpracticle bus, is it really worth it ? that and the fact that maybe, just maybe one day Mr VOSA will make an example of you !\n   </div>\n  </blockquote>\n </div>\n</blockquote>\n<br>\n<br>I read that dude, But there is no proof that's what will happen in there, there are no reasons given why it would not pass an IVA test. there is no sound evidence it would not pass in there or if everything is done properly why it will not work. MOT man is happy with IRS \"hack jobs\" if done right so why is anything else any different if undertaken competantly? this is not a new thing to happen in the bus scene why after 10 odd years is it such a problem?\n<br>\n<br>In the current climate of cut backs and public services needing revenue why are they not enforcing this if they can. if they were so bothered then all buses would be rounded up and tested at our cost.\n<br>\n<br>how come the dude down the road can cut up his landrover and do all sorts of mods and not have a Q plate what about all the hotrods that do it VOSA would be coining it in if they could",
    "lastEdited" : "Thu Dec 16, 2010 6:04 pm"
  }, {
    "postId" : "552399",
    "author" : {
      "username" : "Sooty",
      "userId" : "552399",
      "joined" : "Sun Dec 09, 2007 10:08 pm",
      "profileRank" : "SSVC Member",
      "location" : "Upt Norfff........ Bingley.",
      "postCount" : "10075",
      "avatarPath" : "http://i249.photobucket.com/albums/gg224/spikecrewcab/Random/CB4DC5D0-7468-422E-A389-2417B023445D-6862-000007698E793465.jpg"
    },
    "content" : "<blockquote>\n <div>\n  <cite>Sweet Rides wrote:</cite>\n  <blockquote>\n   <div>\n    <cite>Sooty wrote:</cite>I'm referring to the same posts being boring not the actual thread.\n    <br>\n    <br>Until we have evidence of anything, everything is just being repeated.\n   </div>\n  </blockquote>\n  <br>\n  <br>I agree, hence my renewed interest when reading that Russ said he had some new information.\n  <br>\n  <br>\n  <blockquote>\n   <div>\n    <cite>Sooty wrote:</cite> So does your ride have uprated brakes, steering and crumple zones ?\n   </div>\n  </blockquote>\n  <br>\n  <br>No it doesn`t as I`m not big on modifications, especially those which are untested, I thought the general jist of this would have come across in my posting so far to be honest \n  <img class=\"smilies\" src=\"./images/smilies/icon_confused.gif\" alt=\":?\" title=\"Confused\">\n  <br>\n  <br> Anyway, I fail to see what anything to do with modifing brakes/steering/crumple zones has to do with Chassis notching, which as mentioned in my post to Russ above, is what this thread was actually about last time I checked \n  <img class=\"smilies\" src=\"./images/smilies/icon_wink.gif\" alt=\":wink:\" title=\"Wink\">\n </div>\n</blockquote>\n<br>\n<br>Spence, I'm agreeing with you that Chassis notching will weaken it. It has to in theory, but until it is properly tested we won't know for sure.\n<br>\n<br>What i'm saying is that say your bus is a 58 with 1958 technology. The vehicles on the road are more powerfull, alot heavier i.e HGV's etc, speed limits have been raised, there is far more traffic on the roads etc...\n<br>\n<br>All this poses a threat to a person and their passengers driving a vehicle that was engineered some 60 years ago. Stopping distances, people cutting infront and slamming on for a turn off, your crumple zone is your legs as a bus sure as hell can't stop or slow down like a modern car. \n<br>\n<br>Modern cars are designed to ensure every space that can be involved in a crash is made to resist harm to the occupants. A bus is not in the modern world.\n<br>\n<br>What i'm saying in a long winded way is that your bus as a stock bus in the modern world poses more of a threat to you and your kids in it and would have alot more reasons for the occupants to be harmed than a notched chassis failing due to weakness.\n<br>\n<br>I'd prefere to have a bus with uprated steering, brakes, suspension (not slammed) etc, than a bus made to withstand 1950's traffic and drivers.\n<br>\n<br>I DO agree about the strength issue, but if done correctly the chances of harming anyone due to failure/weakness is so far down the list compared to not being able to stop, in the event of a modern Merc/BMW etc, slamming on in front of you, side impact, other things failing like wheels coming off!! It does happen as we all know.....",
    "lastEdited" : "Thu Dec 16, 2010 6:11 pm"
  }, {
    "postId" : "552401",
    "author" : {
      "username" : "Sooty",
      "userId" : "552401",
      "joined" : "Sun Dec 09, 2007 10:08 pm",
      "profileRank" : "SSVC Member",
      "location" : "Upt Norfff........ Bingley.",
      "postCount" : "10075",
      "avatarPath" : "http://i249.photobucket.com/albums/gg224/spikecrewcab/Random/CB4DC5D0-7468-422E-A389-2417B023445D-6862-000007698E793465.jpg"
    },
    "content" : "<blockquote>\n <div>\n  <cite>Sweet Rides wrote:</cite>No it doesn`t as I`m not big on modifications, especially those which are untested, I thought the general jist of this would have come across in my posting so far to be honest \n  <img class=\"smilies\" src=\"./images/smilies/icon_confused.gif\" alt=\":?\" title=\"Confused\">\n  <br>\n  <br> \n </div>\n</blockquote>\n<br>\n<br>I was refering to using disc brakes and modern technology steering systems which of course have been tested.",
    "lastEdited" : "Thu Dec 16, 2010 6:13 pm"
  }, {
    "postId" : "552402",
    "author" : {
      "username" : "White Van Man",
      "userId" : "552402",
      "joined" : "Thu May 08, 2008 7:28 pm",
      "profileRank" : "Registered user",
      "location" : "Grimsby",
      "postCount" : "264",
      "avatarPath" : null
    },
    "content" : "My 10pence , just read all 11 pages on the Paddywagon on The Samba.Good reading ,if you read it all you will see that the beam was held in with 2 bolts per side as the holes didnt line up for the other 2 per side so they welded the beam in to keep it secure !!!\n<br>That will create far more damage to the vehicle going 50mph to 0mph than any chassis notch, but the welding on them notches was embarrassing.Why do people post pics of their bird mess welding thinking look at me aint i the greastest welder ever ?",
    "lastEdited" : "Thu Dec 16, 2010 6:15 pm"
  }, {
    "postId" : "552413",
    "author" : {
      "username" : "paul_f",
      "userId" : "552413",
      "joined" : "Thu Apr 17, 2003 9:58 am",
      "profileRank" : "SSVC Committee Member",
      "location" : "Gillingham, Kent",
      "postCount" : "6113",
      "avatarPath" : "./download/file.php%3Favatar=31_1339182152.jpg"
    },
    "content" : "<blockquote>\n <div>\n  <cite>Russ T wrote:</cite>I read that dude, But there is no proof that's what will happen in there, there are no reasons given why it would not pass an IVA test. there is no sound evidence it would not pass in there \n </div>\n</blockquote>\n<br>\n<br>Here is a link to the IVA manual if you are interested. \n<!-- m -->\n<a class=\"postlink\" href=\"http://www.transportoffice.gov.uk/crt/repository/IVA-Inspection-Manual-for-M1-Passenger-Cars.pdf\">http://www.transportoffice.gov.uk/crt/r ... r-Cars.pdf</a>\n<!-- m -->\n<br>\n<br>I have read it, and i failed to find a single section that a splitscreen bus could pass without modification.",
    "lastEdited" : "Thu Dec 16, 2010 6:39 pm"
  }, {
    "postId" : "552420",
    "author" : {
      "username" : "skyway",
      "userId" : "552420",
      "joined" : "Wed Jul 22, 2009 9:48 pm",
      "profileRank" : "Registered user",
      "location" : "-",
      "postCount" : "1231",
      "avatarPath" : null
    },
    "content" : "sweet wrote\n<br>I`m confused - Where is this information that`s been gathered? I was completely unaware that any proper testing (or any testing at all for that matter) had been carried out on these notched chassis vehicles to show the Chassis strength/structural characterists etc, in comparison to before they were notched.\n<br>\n<br>i thought you was aware of everything \n<img class=\"smilies\" src=\"./images/smilies/icon_cheers.gif\" alt=\":cheers:\" title=\"cheers\">",
    "lastEdited" : "Thu Dec 16, 2010 7:06 pm"
  }, {
    "postId" : "552425",
    "author" : {
      "username" : "686 bus-boy",
      "userId" : "552425",
      "joined" : "Thu Apr 19, 2007 7:45 pm",
      "profileRank" : "Registered user",
      "location" : "East anglia",
      "postCount" : "970",
      "avatarPath" : "http://i155.photobucket.com/albums/s300/stevewads_2007/AllJon005-1-1.jpg"
    },
    "content" : "Here's some more reading for those interested, people seem to think that any modifying of your bus is not allowed and illegal - not true, lowering, big engines, gearbox mods, all are acceptable you just need to keep within this '8 point rule' although any chassis mod is a no, no unless you want the 'Q' and a full iva test should you choose to admit to the authorities what you've done, or you get caught. \n<br>\n<br>\n<!-- m -->\n<a class=\"postlink\" href=\"http://www.the-ace.org.uk/Chassis-and-Monocoque-Modification.html\">http://www.the-ace.org.uk/Chassis-and-M ... ation.html</a>\n<!-- m -->",
    "lastEdited" : "Thu Dec 16, 2010 7:15 pm"
  }, {
    "postId" : "552451",
    "author" : {
      "username" : "Russ T",
      "userId" : "552451",
      "joined" : "Thu Feb 14, 2008 1:10 pm",
      "profileRank" : "SSVC Member",
      "location" : "kidderminster",
      "postCount" : "1671",
      "avatarPath" : "./download/file.php%3Favatar=16503_1287743477.jpg"
    },
    "content" : "<blockquote>\n <div>\n  <cite>paul_f wrote:</cite>\n  <blockquote>\n   <div>\n    <cite>Russ T wrote:</cite>I read that dude, But there is no proof that's what will happen in there, there are no reasons given why it would not pass an IVA test. there is no sound evidence it would not pass in there \n   </div>\n  </blockquote>\n  <br>\n  <br>Here is a link to the IVA manual if you are interested. \n  <!-- m -->\n  <a class=\"postlink\" href=\"http://www.transportoffice.gov.uk/crt/repository/IVA-Inspection-Manual-for-M1-Passenger-Cars.pdf\">http://www.transportoffice.gov.uk/crt/r ... r-Cars.pdf</a>\n  <!-- m -->\n  <br>\n  <br>I have read it, and i failed to find a single section that a splitscreen bus could pass without modification.\n </div>\n</blockquote>\n<br>\n<br>I have just had a flick thru and do not get your point dude, why would a split bus not pass?",
    "lastEdited" : "Thu Dec 16, 2010 8:31 pm"
  }, {
    "postId" : "552456",
    "author" : {
      "username" : "lowdown dirty rat",
      "userId" : "552456",
      "joined" : "Sat Feb 23, 2008 6:14 am",
      "profileRank" : "Registered user",
      "location" : "UK",
      "postCount" : "795",
      "avatarPath" : "http://www.kustomcoachwerks.com/forums/images/avatars/145987465247bf951181662.jpg"
    },
    "content" : "<blockquote>\n <div>\n  <cite>686 bus-boy wrote:</cite>Here's some more reading for those interested, people seem to think that any modifying of your bus is not allowed and illegal - not true, lowering, big engines, gearbox mods, all are acceptable you just need to keep within this '8 point rule' although any chassis mod is a no, no unless you want the 'Q' and a full iva test should you choose to admit to the authorities what you've done, or you get caught. \n  <br>\n  <br>\n  <!-- m -->\n  <a class=\"postlink\" href=\"http://www.the-ace.org.uk/Chassis-and-Monocoque-Modification.html\">http://www.the-ace.org.uk/Chassis-and-M ... ation.html</a>\n  <!-- m -->\n </div>\n</blockquote>\n<br>\n<br>Can you expand on the '8 point rule'?\n<br>Also when they say no chassis mods. If you don't notch your chassis but re-shape the curve so it looked factory would they really know? How deep is there knowledge of the detailed construction of the chassis of type 2's over the decades?",
    "lastEdited" : "Thu Dec 16, 2010 8:55 pm"
  }, {
    "postId" : "552458",
    "author" : {
      "username" : "paul_f",
      "userId" : "552458",
      "joined" : "Thu Apr 17, 2003 9:58 am",
      "profileRank" : "SSVC Committee Member",
      "location" : "Gillingham, Kent",
      "postCount" : "6113",
      "avatarPath" : "./download/file.php%3Favatar=31_1339182152.jpg"
    },
    "content" : "<blockquote>\n <div>\n  <cite>Russ T wrote:</cite>I have just had a flick thru and do not get your point dude, why would a split bus not pass?\n </div>\n</blockquote>\n<br>\n<br>Well I exaggerated a little \n<img class=\"smilies\" src=\"./images/smilies/icon_wink.gif\" alt=\":wink:\" title=\"Wink\"> If you don't want to read the whole lot just go down to section 32\n<br>\n<br>\n<span style=\"font-weight: bold\">Sections 1 and 2 </span>should be easy to pass (though I'd imagine twin carbs would be out unless you have a centre air filter as the engine + exhaust noise would be too loud.\n<br>\n<br>\n<span style=\"font-weight: bold\">Section 3A</span> - These points would be difficult to pass\n<br>\n<span style=\"font-style: italic\"> Fuel Tanks must not be positioned near a heat source (similar in installation to that of a type approved vehicle), so that a leak could cause a fire hazard. </span>\n<br>Well I suppose you could move it to under the back seat, but then a couple of lines further on\n<br>\n<span style=\"font-style: italic\">A Fuel Tank must not be located in, or form part of the passenger compartment, or other compartment integral with it and the bulkhead that separate the passengers from the fuel tank must be free from holes through which any escaped fuel could travel.</span>\n<br>\n<br>\n<span style=\"font-weight: bold\">Section 6</span> \n<br>\n<span style=\"font-style: italic\">All driver and passenger doors fitted to the sides of the vehicle must have a latch mechanism with both intermediate and fully latched positions. Alternatively, doors must be fitted with a safety bolt and an audible warning device, which activates when the vehicle is being driven if the bolt is not in the “secured” position (see note 4).<br>All driver and passenger hinged doors must have a latch mechanism that will withstand a load of 30kgf in both intermediate and fully latched positions, unless fitted with a safety bolt and audible warning device where it will only need to meet this requirement in the secured (locked) position (see note 3 and 4).</span>\n<br>\n<br>An early bus would struggle with this due to the catch design\n<br>\n<br>\n<span style=\"font-style: italic\">The hinges of hinge-mounted doors (with the exception of folding doors), when fitted to the sides of the vehicle, must be fixed at the front edge of the doors in the direction of forward travel. In the case of double doors, these requirements apply to the door wing which opens first; it must be possible to bolt the other wing of the door (this does not apply to top hinged doors, see RS 4)</span>\n<br>Any bus with LHS cargo doors would fail this\n<br>\n<br>\n<span style=\"font-style: italic\">The hinges of hinge-mounted doors (with the exception of folding doors), when fitted to the sides of the vehicle, must be fixed at the front edge of the doors in the direction of forward travel. In the case of double doors, these requirements apply to the door wing which opens first; it must be possible to bolt the other wing of the door (this does not apply to top hinged doors, see RS 4)</span>\n<br>\n<br>\n<span style=\"font-weight: bold\">Section 8</span>\n<br>\n<span style=\"font-style: italic\">All mirrors must have an acceptable approval marking or have equivalent characteristics to a mirror approved for use on a vehicle of the same category as follows:<br>•The reflective surface must be encased in a protective housing<br>•surfaces contactable by a 165mm sphere (interior) or a 100mm sphere (exterior) must have a radius of curvature of at least 2.5mm – except for fixing holes or recesses less than 12mm wide, which must be blunted</span>\n<br>\n<span style=\"font-weight: bold\"><br>Section 12 Interior fittings</span> - this is were it gets really difficult as the tester will use a 100mm and a 165mm ball and anything that it contacts has to be radiused.\n<br>\n<span style=\"font-style: italic\">All switches, control knobs etc which are mounted on the instrument panel which are within the \"specified zone\", contactable by a 165mm diameter. Sphere and protrude from the instrument panel by more than 9.5mm must be likely to retract or detach with no sharp edges when subject to an impact of 40kgf </span>\n<br>So all standard VW switched would fail so would have to removed\n<br>\n<span style=\"font-style: italic\">The instrument panel lower edge within the “specified zone” must have a radius of curvature not less than 19mm or 5mm and covered with a non-rigid material</span>\n<br>Padded dashboard needed, nice \n<img class=\"smilies\" src=\"./images/smilies/icon_confused.gif\" alt=\":?\" title=\"Confused\"> \n<br>\n<br>\n<span style=\"font-style: italic\">The inner surface of the roof structure and any attached components (eg. grab handles, lights, sun visors)</span>\n<br>Stock air box would fall foul of this\n<br>\n<br>\n<span style=\"font-weight: bold\">Section 14 Protective Steering</span> - a padded steering wheel and collapsible steering column is needed as the steering box is ahead of the front axle\n<br>\n<span style=\"font-style: italic\">The vehicle and steering column assembly must be designed such that in the event of a frontal impact at 48km/h (30mph) the rearward horizontal displacement and vertical displacement of the top of the steering column and its shaft do not exceed 127mm.</span>\n<br>YOu might get away with that, I have seen a bus that went into a tree at approx 30mph and the dash didn't move back bu you have to convince the tester\n<br>\n<br>\n<span style=\"font-weight: bold\">15 Seat Strength</span> - head rests are needed\n<br>\n<br>\n<span style=\"font-weight: bold\">16 Exterior Projections</span>\n<br>\n<span style=\"font-style: italic\">All ‘hard’ parts contactable with a 100mm sphere, which form an external surface or protrude 5mm or more from the external surface must have a radius of curvature of at least 2.5mm (see note 2).</span>\n<br>Everything on a bus will need to be radiused\n<br>\n<br>\n<span style=\"font-style: italic\">Handles, hinges, push buttons, and fuel tank filler caps must not protrude more than 50mm from the external surface if the component does not project beyond the extreme outer edge of the vehicle. This is reduced to 40mm in all other cases.</span>\n<br>I think the top cab door hinges would be just about a fail\n<br>\n<br>\n<span style=\"font-style: italic\">The open end of any handle that rotates parallel to the plane of the panel and protrudes beyond the extreme outer edge of the vehicle must face rearwards</span>\n<br>So early bus handles are a fail unless you turn them to point the other way\n<br>\n<br>\n<span style=\"font-weight: bold\">32 Forward Vision</span> Now I am getting a bit bored, so I have skipped a load of sections to get to a \n<span style=\"font-weight: bold\"><span style=\"text-decoration: underline\">very important</span></span> one\n<br>\n<br>\n<span style=\"font-style: italic\">Check that when seated in the driving position, the driver has a full un-obscured view of the road to the front and forward of the near side and offside of the vehicle (90° each side of straight ahead). The lower edge of the forward field of view must not be above the “windscreen horizontal plane” as defined in Annex 1 of this section<br>NOTE 1: The following items do not constitute an obstruction to the field of<br>Vision. This not an exhaustive list but provided as guidance:<br>•“A” pillars but not split screen dividers<br>•Central windscreen stay or support (no wider in diameter than 10mm)<br></span>\n<br>You get to find a way of fitting a bay window into the front of your split bus \n<img class=\"smilies\" src=\"./images/smilies/icon_eek.gif\" alt=\"8O\" title=\"eek\">",
    "lastEdited" : "Thu Dec 16, 2010 9:10 pm"
  }, {
    "postId" : "552465",
    "author" : {
      "username" : "686 bus-boy",
      "userId" : "552465",
      "joined" : "Thu Apr 19, 2007 7:45 pm",
      "profileRank" : "Registered user",
      "location" : "East anglia",
      "postCount" : "970",
      "avatarPath" : "http://i155.photobucket.com/albums/s300/stevewads_2007/AllJon005-1-1.jpg"
    },
    "content" : "<blockquote>\n <div>\n  <cite>lowdown dirty rat wrote:</cite>\n  <blockquote>\n   <div>\n    <cite>686 bus-boy wrote:</cite>Here's some more reading for those interested, people seem to think that any modifying of your bus is not allowed and illegal - not true, lowering, big engines, gearbox mods, all are acceptable you just need to keep within this '8 point rule' although any chassis mod is a no, no unless you want the 'Q' and a full iva test should you choose to admit to the authorities what you've done, or you get caught. \n    <br>\n    <br>\n    <!-- m -->\n    <a class=\"postlink\" href=\"http://www.the-ace.org.uk/Chassis-and-Monocoque-Modification.html\">http://www.the-ace.org.uk/Chassis-and-M ... ation.html</a>\n    <!-- m -->\n   </div>\n  </blockquote>\n  <br>\n  <br>Can you expand on the '8 point rule'?\n  <br>Also when they say no chassis mods. If you don't notch your chassis but re-shape the curve so it looked factory would they really know? How deep is there knowledge of the detailed construction of the chassis of type 2's over the decades?\n </div>\n</blockquote>\n<br>\n<br>8 point rule - if you 'score' 8 or more points through modifications then i believe your vehicle would be subject to a full iva test, its not just tested on the modifications unfortunately which is why any bus would fail-Its a modern vehicle test, As listed by paul above all the criteria you would have to meet in the test.\n<br>Im building a bike at the minute which i intend to put through an msva test (bike equivalent) and no where near as complicated as a car but still causing headaches and thats building from scratch let alone rectifying 50 year old technology to get through it. As far as knowing what they know about specifics that i dont know! There are lots of grey areas with it all, theres a guy on the ACE website you can contact and call, he's very helpfull and will answer what he can. You can still do hell of alot but to me its a no brainer when it comes to chassis mods,especially on a bus that hasnt been registered yet,ok so you may well never get caught but when all that time and money has been invested in your bus why risk it. 'Q' plated bd deluxe,dont think so !!! \n<img class=\"smilies\" src=\"./images/smilies/icon_eek.gif\" alt=\"8O\" title=\"eek\">",
    "lastEdited" : "Thu Dec 16, 2010 9:33 pm"
  }, {
    "postId" : "552466",
    "author" : {
      "username" : "Russ T",
      "userId" : "552466",
      "joined" : "Thu Feb 14, 2008 1:10 pm",
      "profileRank" : "SSVC Member",
      "location" : "kidderminster",
      "postCount" : "1671",
      "avatarPath" : "./download/file.php%3Favatar=16503_1287743477.jpg"
    },
    "content" : "<blockquote>\n <div>\n  <cite>paul_f wrote:</cite>\n  <blockquote>\n   <div>\n    <cite>Russ T wrote:</cite>I have just had a flick thru and do not get your point dude, why would a split bus not pass?\n   </div>\n  </blockquote> \n </div>\n</blockquote>\n<br>\n<br>i did read thru it all and I don't think it works like that as the bus un-modfyied could not fail as it did not meet this as it is so old, i.e. if a vehicle is too old for seat belts you dont fail your mot there not tested.\n<br>\n<br>the point i am making is that your vehicle does not fail as it was built when different laws were in place \n<br>\n<br>I did read it all as my friend works at a resto place building million pound kit cars - well alvis and gondalas etc where everything is modified as all the parts are hand made and they dont need a VOSA test he is a qualified MOT man too.\n<br>\n<br>he does not read the rules discussed here and on the other threads over the summer the same way, he feels that buses would pass the test if the work was carried out correctly therefore there is not a problem and the fact were all not driving round in Q plate cars",
    "lastEdited" : "Thu Dec 16, 2010 9:41 pm"
  }, {
    "postId" : "552468",
    "author" : {
      "username" : "Russ T",
      "userId" : "552468",
      "joined" : "Thu Feb 14, 2008 1:10 pm",
      "profileRank" : "SSVC Member",
      "location" : "kidderminster",
      "postCount" : "1671",
      "avatarPath" : "./download/file.php%3Favatar=16503_1287743477.jpg"
    },
    "content" : "<blockquote>\n <div>\n  <cite>686 bus-boy wrote:</cite> You can still do hell of alot but to me its a no brainer when it comes to chassis mods,especially on a bus that hasnt been registered yet,ok so you may well never get caught but when all that time and money has been invested in your bus why risk it. 'Q' plated bd deluxe,dont think so !!! \n  <img class=\"smilies\" src=\"./images/smilies/icon_eek.gif\" alt=\"8O\" title=\"eek\">\n </div>\n</blockquote>\n<br>\n<br>if you rebuilt the bus from the wood according to the rules it has been modified as you welded all the chassis back up and it is not a direct new or NOS replacement one, this is where it falls down, according to this part of the test any and every vehicle ever welded would fail it and any or every vehicle every to have been welded must notify them to take the test.",
    "lastEdited" : "Thu Dec 16, 2010 9:45 pm"
  }, {
    "postId" : "552470",
    "author" : {
      "username" : "686 bus-boy",
      "userId" : "552470",
      "joined" : "Thu Apr 19, 2007 7:45 pm",
      "profileRank" : "Registered user",
      "location" : "East anglia",
      "postCount" : "970",
      "avatarPath" : "http://i155.photobucket.com/albums/s300/stevewads_2007/AllJon005-1-1.jpg"
    },
    "content" : "<blockquote>\n <div>\n  <cite>Russ T wrote:</cite>\n  <blockquote>\n   <div>\n    <cite>686 bus-boy wrote:</cite> You can still do hell of alot but to me its a no brainer when it comes to chassis mods,especially on a bus that hasnt been registered yet,ok so you may well never get caught but when all that time and money has been invested in your bus why risk it. 'Q' plated bd deluxe,dont think so !!! \n    <img class=\"smilies\" src=\"./images/smilies/icon_eek.gif\" alt=\"8O\" title=\"eek\">\n   </div>\n  </blockquote>\n  <br>\n  <br>if you rebuilt the bus from the wood according to the rules it has been modified as you welded all the chassis back up and it is not a direct new or NOS replacement one, this is where it falls down, according to this part of the test any and every vehicle ever welded would fail it and any or every vehicle every to have been welded must notify them to take the test.\n </div>\n</blockquote>\n<br>\n<br> Its not modified tho as it will still be as it left the factory, vehicle restoration is a different ball game to modifying.",
    "lastEdited" : "Thu Dec 16, 2010 9:52 pm"
  }, {
    "postId" : "552479",
    "author" : {
      "username" : "Russ T",
      "userId" : "552479",
      "joined" : "Thu Feb 14, 2008 1:10 pm",
      "profileRank" : "SSVC Member",
      "location" : "kidderminster",
      "postCount" : "1671",
      "avatarPath" : "./download/file.php%3Favatar=16503_1287743477.jpg"
    },
    "content" : "<blockquote>\n <div>\n  <cite>686 bus-boy wrote:</cite>\n  <blockquote>\n   <div>\n    <cite>Russ T wrote:</cite>\n    <blockquote>\n     <div>\n      <cite>686 bus-boy wrote:</cite> You can still do hell of alot but to me its a no brainer when it comes to chassis mods,especially on a bus that hasnt been registered yet,ok so you may well never get caught but when all that time and money has been invested in your bus why risk it. 'Q' plated bd deluxe,dont think so !!! \n      <img class=\"smilies\" src=\"./images/smilies/icon_eek.gif\" alt=\"8O\" title=\"eek\">\n     </div>\n    </blockquote>\n    <br>\n    <br>if you rebuilt the bus from the wood according to the rules it has been modified as you welded all the chassis back up and it is not a direct new or NOS replacement one, this is where it falls down, according to this part of the test any and every vehicle ever welded would fail it and any or every vehicle every to have been welded must notify them to take the test.\n   </div>\n  </blockquote>\n  <br>\n  <br> Its not modified tho as it will still be as it left the factory, vehicle restoration is a different ball game to modifying.\n </div>\n</blockquote>\n<br>\n<br>thats not the case if you touch the chasis and not directly replacing it it needs testing according the website dude\n<br>\n<br>f. Rebuilt Vehicle\n<br>A vehicle that\n<br>•\n<br>is a previously UK registered vehicle to which the Secretary of State is required by regulation to assign a vehicle identification number, and does not fall within the definition of an “Amateur Built” vehicle or “Vehicle manufactured using parts of a registered vehicle,” and has been rebuilt using a replacement chassis or integral chassis/body which is of the same design and construction as that of the original vehicle and which was supplied for the purpose without having been previously used, or previously formed part of a registered vehicle. Evidence will be required to meet this definition.",
    "lastEdited" : "Thu Dec 16, 2010 10:33 pm"
  } ]
}