{
  "forumId" : "2",
  "threadId" : "124234",
  "title" : "The Dub Shed........in Wiltshire.",
  "originalUrl" : "https://ssvc.org.uk/phpbb/viewtopic.php?f=2&t=124234",
  "breadcrumbs" : [ {
    "url" : "./viewforum.php?f=2&sid=cb5a4cc94786a4bd6237ad83a77eec43",
    "label" : "VW Related Chat"
  } ],
  "totalPosts" : 3,
  "pageNumber" : 1,
  "totalPages" : 1,
  "posts" : [ {
    "postId" : "927361",
    "author" : {
      "username" : "Rocket Ron",
      "userId" : "927361",
      "joined" : "Fri Jun 06, 2003 7:55 pm",
      "profileRank" : "SSVC Member",
      "location" : "wiltshire",
      "postCount" : "1574",
      "avatarPath" : null
    },
    "content" : "Having retired from VW Endangered Species with a clean sheet, it's great to see a young friend fill my boots so to speak.\n<br> Enter Big Rich, and he really is Big as in about 6'6 in height.\n<br> He is not new to the VW scene and his work is varied, from beetles to T5-6s, welding to complete fitting and converting later transporters.\n<br> I've been watching his work on a Baywindow and I'm surprised, his level of work is very thorough, his welding is first class and he has an eye for detail.\n<br> He is an honest guy, so you won't get your pants pulled, that in itself is reassuring as it still goes on.\n<br> He is having an open day, weather permitting, might be a barby, coffee etc, so if your in Trowbridge area, pop in, his workshop is next to my old place, The Dub Shop, 26 Marsh Farm, BA14 7 PJ\n<br> He has only been up and running around 6 months so still finding his feet, so come along and say hello.\n<br> Date...2nd Feb 2020\n<br> \n<br> Rocket Ron\n<br> VW Endangered Species",
    "lastEdited" : "Fri Jan 10, 2020 9:55 am"
  }, {
    "postId" : "927436",
    "author" : {
      "username" : "vwbuzzers",
      "userId" : "927436",
      "joined" : "Thu Apr 17, 2003 11:24 am",
      "profileRank" : "SSVC Member",
      "location" : "posh part of Salford",
      "postCount" : "11919",
      "avatarPath" : "./download/file.php%3Favatar=34_1253389696.jpg"
    },
    "content" : "Nice one Ron good to see new blood on the scene. I'm sure he will never fill your boots pal \n<img class=\"smilies\" src=\"./images/smilies/icon_wink.gif\" width=\"15\" height=\"15\" alt=\":wink:\" title=\"Wink\"> \n<br> \n<br> Buzzers",
    "lastEdited" : "Thu Jan 16, 2020 10:31 pm"
  }, {
    "postId" : "927441",
    "author" : {
      "username" : "Rocket Ron",
      "userId" : "927441",
      "joined" : "Fri Jun 06, 2003 7:55 pm",
      "profileRank" : "SSVC Member",
      "location" : "wiltshire",
      "postCount" : "1574",
      "avatarPath" : null
    },
    "content" : "Thanks Kerion for those kind words, however, there are better and more skilled workshops than mine could ever be but for me, it's the few who continue to sell there wares only to take the money with no consequences to them and leave people not only out of pocket but dreams shattered.\n<br> Rich used to visit our shop as he is a VW nut but I was unaware of his ability to work on VWs.\n<br> I've allways avoided recommendations in case it comes back to bite me but I feel sure that won't happen in this case.\n<br> Long time no see...we are now both retired and we travel during the summer mainly to France, that is one big country and so must to see but as time goes on I dare say we will be doing a few shows just to catch up with whoever is left, got a bit boring to be honest....still playing with cars...having a Fiat 500 L restored for Ang as she has allways wanted one, should be ready for paint soon, not a total rot box but still had all the outer panels inc doors replaced with new.\n<br> We drive a T5 VW Colorado Karmann, great vans it's our third we have imported, this one is a 2005 with just 32,000 miles from new so it's a great bus.\n<br> Let's hope we see you soon.\n<br> \n<br> Ron &amp; Ang",
    "lastEdited" : "Fri Jan 17, 2020 9:17 am"
  } ]
}