{
  "forumId" : "2",
  "threadId" : "102964",
  "title" : "Usual word of warning!!",
  "originalUrl" : "https://ssvc.org.uk/phpbb/viewtopic.php?f=2&t=102964&start=15",
  "breadcrumbs" : [ ],
  "totalPosts" : 23,
  "pageNumber" : 2,
  "totalPages" : 2,
  "posts" : [ {
    "postId" : "784700",
    "author" : {
      "username" : "matt d",
      "userId" : "784700",
      "joined" : "Tue Nov 30, 2010 6:00 pm",
      "profileRank" : "Registered user",
      "location" : "South Devon.",
      "postCount" : "1773",
      "avatarPath" : null
    },
    "content" : "<blockquote>\n <div>\n  <cite>Sweet Rides wrote:</cite>ATT BLEEDING MOODY - REALLY IMPORTANT WARNING REGARDING THE R9 HOSE THAT YOU HAVE JUST FITTED!!!\n  <br>\n  <br>I fitted this exact hose in september of last year. Bought as a kit from Halfords, looks identical to the stuff you have just fitted.\n  <br>\n  <br>Was checking my bus over today as was having some tickover issues (non related to fuel lines) but whist there I noticed the R9 fuel line I fitted in September 13 was totally shot! I couldn`t belive what I was seeing - heavily perished and deeply cracked fuel line just waiting to fully split open at any scecond. \n  <img class=\"smilies\" src=\"./images/smilies/icon_eek.gif\" alt=\"8O\" title=\"eek\"> \n  <img class=\"smilies\" src=\"./images/smilies/icon_evil.gif\" alt=\":evil:\" title=\"Evil\"> \n  <br>\n  <br>Will be avoidng this stuff in the future! Now looking at that expensive stuff from vwaircooledworks.co.uk suitable for modern ethanol based fuels (he claims this is what is fitted to brand new Vw`s) at £42.50 for a 1.5meter kit it`s not cheap - but if it actually does what it says on the tin then it has to be worth 10 times that initial cost to any of us. \n  <br>\n  <br>Link - \n  <!-- m -->\n  <a class=\"postlink\" href=\"http://www.vwaircooledworks.co.uk/Biofuel-safe-fuel-lines-.html\">http://www.vwaircooledworks.co.uk/Biofu ... ines-.html</a>\n  <!-- m --> (Scroll down to bottom of page for the \"ethanol resistant fuel hose\" at £42.50 for the single carb kit)\n  <br>\n  <br>I think that`s what I`m going to order unless I can find anything even better over the next couple of days.\n </div>\n</blockquote>\n<br>\n<br>\n<br>You are now our official tester, congratulations. Please let us know how you get on \n<img class=\"smilies\" src=\"./images/smilies/icon_biggrin.gif\" alt=\":D\" title=\"Big Grin\">",
    "lastEdited" : "Thu May 15, 2014 9:17 pm"
  }, {
    "postId" : "784782",
    "author" : {
      "username" : "Waterttoair",
      "userId" : "784782",
      "joined" : "Thu Aug 30, 2012 6:48 pm",
      "profileRank" : "Registered user",
      "location" : "-",
      "postCount" : "99",
      "avatarPath" : null
    },
    "content" : "If it's the same stuff as they( VWACW )sell in ebay it's still R9!",
    "lastEdited" : "Fri May 16, 2014 1:53 pm"
  }, {
    "postId" : "784793",
    "author" : {
      "username" : "Bleedingmoody",
      "userId" : "784793",
      "joined" : "Sat Oct 02, 2004 1:19 pm",
      "profileRank" : "SSVC Member",
      "location" : "Northampton",
      "postCount" : "2016",
      "avatarPath" : "http://img.photobucket.com/albums/v204/bleedingmoody/E48F4248-BF30-429F-8F0E-364036735599_zpslebuyhry.jpg"
    },
    "content" : "Will be good to see how you get on with it. I purchased my r9 stuff from machine 7 I think I might send an email to make sure they still think it's ok.",
    "lastEdited" : "Fri May 16, 2014 2:52 pm"
  }, {
    "postId" : "802011",
    "author" : {
      "username" : "rabbitracinguk",
      "userId" : "802011",
      "joined" : "Thu Sep 11, 2014 8:58 am",
      "profileRank" : "Registered user",
      "location" : "-",
      "postCount" : "7",
      "avatarPath" : null
    },
    "content" : "Hello. \n<br>\n<br>First post here and this topic stood out to me. \n<br>Thought I would share my story and how I have figured this out. \n<br>ANY rubber hose is dire in my experience. Even those here that have said they've had failures with R9. With the cost of these vans and how much we spend, I would be looking at something else.\n<br>\n<br>In MSA racing, there is a rule that states that any flexible hose longer than 6inches has to be stainless over-braided... \n<br>Now my issue with ANY over-braid is that the first you know that the rubber has perished is the wet braid. This is NOT COOL!. \n<br>At least with the R9 type stuff, you can do a quick health check (bend it slightly to check for cracks..) before you set off. But regs are regs, and I had to sort something out. \n<br>\n<br>So during my hunt for fancy red/blue aeroquip fittings to plumb my fuel and oil on the 2276, I discovered PTFE / Teflon hoses. \n<br>\n<br>This is a hard PTFE inner with a Kevlar / Stainless overbraid. You choose. But basically this stuff is good for Hydraulics, (if you run a high pressure Fuel Injection. ) but also it will run Race Fuel and Ethanol without perishing. \n<br>\n<br>It's that good, that it's MSA approved in Rally cars to be run INSIDE the cockpit. This is one of those rules that is normally a massive NO NO. NO FUEL LINES IN THE CAR... But this stuff is that good. \n<br>\n<br>It is more expensive, (upwards of £10 per meter) but not a whole heap when you factor in the cost of relentlessly replacing rubber hose because you've had it a yr and don't want it starting a fire. That R9 stuff is not cheap either. \n<br>\n<br>Now Granted, it's meant to be used with the AN / JIC style fittings, but this is not mandatory. If you have the right size hardline or (PTFE hose that matches your hardline..) and a good fuel clip it's fine. My engine is all AN style fittings but my hardline from the tank is just a hard line so one end that feeds the Fuel Reg is mounted with a Hose Clip. \n<br>Tho spending out on the AN Fittings has saved my life many a time. When I'm taking the engine out, or carbs off, I'm not having to constantly fight a hose stuck on a barb. I just use the wrench and refit it. Plus the fittings are reusable if you do end up replacing the hose.\n<br>\n<br>I am using 8mm hardline so I purchased AN6 Hose. But it can be in smaller sizes. \n<br>\n<br>I'm not affiliated with anyone so am not selling this to you (Even tho it sounds like an advert and this is my first post! \n<img class=\"smilies\" src=\"./images/smilies/icon_biggrin.gif\" alt=\":D\" title=\"Big Grin\"> ) , I'm trying to save your necks and frustrations here. I saw the topic and had to pipe up. (no pun intended)\n<br>Buy from your own preferred supplier. \n<br>You can buy it from Earls etc, or like I did, from \n<a href=\"http://www.torques.co.uk\" class=\"postlink\">http://www.torques.co.uk</a> \n<br>\n<br>\n<a href=\"http://stores.ebay.co.uk/Torques-U-K/_i.html?_nkw=teflon&amp;submit=Search&amp;_sid=81447352\" class=\"postlink\">Teflon Products</a>\n<br>\n<br>If it's good enough to satisfy an MSA Scrutineer then I'd say it's gonna be WAY ok for your street car. \n<img class=\"smilies\" src=\"./images/smilies/icon_biggrin.gif\" alt=\":D\" title=\"Big Grin\">\n<br>\n<br>If anyone wants to see this stuff I can get some photos of a few spare bits I have and also the install on the car.",
    "lastEdited" : "Thu Sep 11, 2014 4:51 pm"
  }, {
    "postId" : "802022",
    "author" : {
      "username" : "Claushema",
      "userId" : "802022",
      "joined" : "Sun Oct 06, 2013 8:32 pm",
      "profileRank" : "SSVC Member",
      "location" : "Amsterdam/central France",
      "postCount" : "906",
      "avatarPath" : "./download/file.php%3Favatar=38574_1386788824.jpg"
    },
    "content" : "Think I'll get to changing over all my fuel lines right away. After reading this ,not going to put it off any longer. Thanks for the motivation!",
    "lastEdited" : "Thu Sep 11, 2014 5:57 pm"
  }, {
    "postId" : "804709",
    "author" : {
      "username" : "Max Last",
      "userId" : "804709",
      "joined" : "Fri Dec 26, 2008 7:56 pm",
      "profileRank" : "SSVC Member",
      "location" : "Spalding, R b!",
      "postCount" : "1479",
      "avatarPath" : "http://i249.photobucket.com/albums/gg224/spikecrewcab/Mobile%20Uploads/1F5FCDF5-C368-43E9-9DF7-0322EBDEF445_zpsvtexhnfv.png"
    },
    "content" : "I have always tried to change my fuel lines each winter since having my bus, I bought the machine7 bundle each time, last year I checked the fuel lines but never got round to actually changing them, finally last weekend I got round to it, the r9 stuff I took off has been on for at least 22 months, possibly more, everything that came off was fine, it showed no signs of cracking/perishing. I normally use supermarket fuel although some folks advise that it can be a bit ropey, I guess its still better quality than what was available when splits were new. So to sum up, I`ve fitted the r9 bundle from m7 again, as always I check the engine bay before starting up the bus so it`ll be under observation too!",
    "lastEdited" : "Mon Sep 29, 2014 7:28 pm"
  }, {
    "postId" : "828973",
    "author" : {
      "username" : "AnGeL",
      "userId" : "828973",
      "joined" : "Sun Mar 17, 2013 8:04 pm",
      "profileRank" : "Registered user",
      "location" : "Ely, Cambs",
      "postCount" : "27",
      "avatarPath" : null
    },
    "content" : "Just to add to this thread and to the above comment about supermarket fuel......\n<br>\n<br>My father-in-law drives for a company that operate artic fuel tankers, which pick up from Tilbury docks' fuel terminals and distribute petrol and diesel etc to petrol stations, farms, factories and haulage yards etc.\n<br>\n<br>90(odd)% of the fuel that we put into our cars from UK forecourts comes from the same storage tanks, the only exception being Esso and Shell as they have their own additives (Tiger juice and ground up sea shells apparently) and thus have their own storage tanks. EVERYTHING else comes from the same tanks and gets transported to every other destination. Supermarket fuel is no worse / better than buying from BP, Jet etc or even Esso or Shell if you take the additive out.\n<br>\n<br>Well, I thought it was interesting anyway and (possibly) does away with a myth.......",
    "lastEdited" : "Sat Apr 04, 2015 2:41 pm"
  }, {
    "postId" : "832674",
    "author" : {
      "username" : "Netty",
      "userId" : "832674",
      "joined" : "Sat Jan 31, 2015 12:40 am",
      "profileRank" : "SSVC Member",
      "location" : "-",
      "postCount" : "14",
      "avatarPath" : null
    },
    "content" : "Have had vwaircooledworks fuel lines fitted for two years now and still look brand new \n<img class=\"smilies\" src=\"./images/smilies/icon_smile.gif\" alt=\":)\" title=\"Grin\"> after a very near disaster with split braided fuel line, over hot manifold !!! It's nice that you get a good product and also piece of mind when fitted with the fire extinguisher kit like we have. Lovely people to do business with and I think their product lines are worth every penny, as for the backup and advice they also give, second to none.",
    "lastEdited" : "Wed Apr 29, 2015 10:16 pm"
  } ]
}