{
  "forumId" : "2",
  "threadId" : "104124",
  "title" : "Camper and Porsche Hire Business Help Advice",
  "originalUrl" : "https://ssvc.org.uk/phpbb/viewtopic.php?f=2&t=104124",
  "breadcrumbs" : [ {
    "url" : "./viewforum.php?f=2&sid=f54d3ba408e3e3ef9ddc811f146d7b31",
    "label" : "VW Related Chat"
  } ],
  "totalPosts" : 10,
  "pageNumber" : 1,
  "totalPages" : 1,
  "posts" : [ {
    "postId" : "791808",
    "author" : {
      "username" : "graingey",
      "userId" : "791808",
      "joined" : "Wed Dec 05, 2012 5:05 am",
      "profileRank" : "Registered user",
      "location" : "Shrewsbury",
      "postCount" : "45",
      "avatarPath" : "./download/file.php%3Favatar=37279_1365857260.jpg"
    },
    "content" : "Hi there,\n<br>\n<br>I am considering leaving my job and setting up a very small vehicle hire business and yet i have no idea if this is something that is worth the consideration and if people have found it to be successful. I live in Shropshire and there seems no one in this area that provides this service, I have the following vehicles and i was after any advice at all on how to go about this and if this is something that would be profitable at all. Probably a long shot but i would really appreciate any input from people that have done this and been successful or unsuccessful. I do have the finance to possibly buy one more bus or maybe a Beetle for example. Thank you very much. \n<br>\n<br>1966 Patina VW Splitscreen 1914cc Turbo new engine-everything been done on i. Patina but lovely\n<br>1995 Porsche 911 993 Twin Turbo- Mint condition\n<br>\n<br>Thanks. Nick",
    "lastEdited" : "Wed Jul 02, 2014 7:10 am"
  }, {
    "postId" : "791815",
    "author" : {
      "username" : "clymoj",
      "userId" : "791815",
      "joined" : "Tue Mar 27, 2012 12:10 pm",
      "profileRank" : "Registered user",
      "location" : "London & Birmingham",
      "postCount" : "1132",
      "avatarPath" : "http://i1068.photobucket.com/albums/u451/clymoj/Bus/Bus005_zps44edd617.jpg"
    },
    "content" : "I did a little research into occasionally renting my bus and decided not to. I know someone who used to look after a rental fleet and he pointed out that most people don't understand these vehicles and how to drive them so through no real malice they will trash your pride and joy. \n<br>\n<br>Buying stock, functional vehicles specifically for a rental business and accepting this rate of wear, tear and damage is fine. Renting the one you've put your heart and your money into may not be such a happy or profitable experience. \n<br>\n<br>That's the reason most people go down the wedding / chauffeur driven route.",
    "lastEdited" : "Wed Jul 02, 2014 7:50 am"
  }, {
    "postId" : "791822",
    "author" : {
      "username" : "maddison",
      "userId" : "791822",
      "joined" : "Fri Feb 01, 2008 1:56 pm",
      "profileRank" : "SSVC Member",
      "location" : "up norf",
      "postCount" : "5518",
      "avatarPath" : "./download/file.php%3Favatar=15870_1360143264.png"
    },
    "content" : "large engined turbo splitty for hire !!! \n<img class=\"smilies\" src=\"./images/smilies/icon_eek.gif\" alt=\"8O\" title=\"eek\"> \n<img class=\"smilies\" src=\"./images/smilies/icon_eek.gif\" alt=\"8O\" title=\"eek\"> \n<img class=\"smilies\" src=\"./images/smilies/icon_eek.gif\" alt=\"8O\" title=\"eek\"> \n<br>\n<br>your gonna have a very limited market, its gonna be pricey.....oh....and your splitty is gonna get totalled \n<img class=\"smilies\" src=\"./images/smilies/icon_blackeye.gif\" alt=\":blackeye:\" title=\"blackeye\">",
    "lastEdited" : "Wed Jul 02, 2014 8:35 am"
  }, {
    "postId" : "791823",
    "author" : {
      "username" : "maddison",
      "userId" : "791823",
      "joined" : "Fri Feb 01, 2008 1:56 pm",
      "profileRank" : "SSVC Member",
      "location" : "up norf",
      "postCount" : "5518",
      "avatarPath" : "./download/file.php%3Favatar=15870_1360143264.png"
    },
    "content" : "...if your gonna do it, sell the bus, buy a nice shiny one with stock running gear",
    "lastEdited" : "Wed Jul 02, 2014 8:36 am"
  }, {
    "postId" : "791833",
    "author" : {
      "username" : "58and60",
      "userId" : "791833",
      "joined" : "Thu Jun 06, 2013 11:21 am",
      "profileRank" : "SSVC Member",
      "location" : "Towcester",
      "postCount" : "144",
      "avatarPath" : "./download/file.php%3Favatar=38012_1371138261.jpg"
    },
    "content" : "A man after my own heart here.... I used to concours, co run an owners club, hoon around in and wirte about Porsches in articles etc. I congratulate you on the 993T - up there amongst the very best (but I am biased having been there!)\n<br>\n<br>As to my opinion and I cant state this enough \n<span style=\"font-weight: bold\"><span style=\"text-decoration: underline\">please do not hire out the 993 T</span></span>. Any profit you make will in my opinion be wiped out the moment a new buyer knows its history. 993 buyers are scrupulous on history and vehicle records and make accountants seem reckless. If they find out it was a hire car you could take your sale price and take 20% off at the very least (and that is a lot for a 993T). Also I had for a while a 993T and 996T - i looked in at hiring the 996T out but the insurance was crippling it made it totally pointless.\n<br>\n<br>However I did think about starting up some sort of business where vehicles were invloved (VW given I was also a VW nut!) so went down the wedding route. I spoke to a lot of people who hired them out for holiday and the damage casused was often heartbreaking. You loan it ouf for £600 a week, it comes back and most of the time it needs work. Its your pride and joy but to someone else its just a holiday van. I would also say that the holiday market likes super shiny vans looking top notch - a patina van may be hard to sell in. However I went down the wedding route and it brings in just enough to keep all the vehicles in tip top condition and of course keep buying them and looking after them (currently looking for a nice Dove blue example....anyone?) However you will not make a lot of money out of it unless you run the buses to the ground cash in and then go. I would say you could make 50% margin on each trip but in reality its a lot less. The buses and beetle get booked up years in advance and it has to look as good in 2016 and yes we have 2017 booking... as it does right now. That can only happen with OCD servicing and attention to detail. Keep the buses looking good and then perhaps they themselves are your pension fund !!\n<br>\n<br>However the weddings have one benefit, only you or trusted people drive, its never out of your sight, its 5 hours (ISH) for a price not far short of a week rental and it can work. ...............oh and two other things \n<br>1 - Nerves of steel when it goes wrong on the wedding morning - we now have a spare Bus every friday and Saturday \n<br>2 - THe admin work before the day itself. You will need a way of keeping track of the numerous calls, changes of details, colour changes for ribbons that you go through for every single bride. We do c 200 a year now and it is so labour intensive we have admin support !\n<br>\n<br>SO dont do the Porsche ...pleeeeeeasse\n<br>Do weddings but dont plan on a ton of cash - do weddings to keep your pride and joys, you need to love the VW and see the weddings as keeping them top dollar for later years\n<br>Hire out for hols- as above with added stress\n<br>\n<br>If you would like to chat about the wedding side then feel free to PM or call one day. I make it sond dismal its not, but too many people think its easy. And one last thing I get really annoyed with people who think the wedding side is selling out. Its not given my comments above, but you need to remind yourself what it was they were intended for in the first place.",
    "lastEdited" : "Wed Jul 02, 2014 8:59 am"
  }, {
    "postId" : "791861",
    "author" : {
      "username" : "blistered",
      "userId" : "791861",
      "joined" : "Tue Jun 05, 2012 11:13 am",
      "profileRank" : "SSVC Committee Member",
      "location" : "Coventry",
      "postCount" : "219",
      "avatarPath" : null
    },
    "content" : "So going by the post above.... (and playing a light hearted devil's advocate)\n<br>\n<br>£600 a week for holiday rental...\n<br>\n<br>Or...\n<br>\n<br>5 hours (ISH) for a price not far short of a week rental... so work on £500... and you do 200 weddings a year... thats £100k!!!\n<br>\n<br>And then you say \"Do weddings but dont plan on a ton of cash\". You're obviously much better off than most if £100k isn't a ton of cash to you... Good luck to ya! haha!\n<br>\n<br>There's a ton of other companies doing holiday rentals and wedding rentals.. maybe think outside the box and see if you can think of something different you could do instead?",
    "lastEdited" : "Wed Jul 02, 2014 1:03 pm"
  }, {
    "postId" : "791866",
    "author" : {
      "username" : "58and60",
      "userId" : "791866",
      "joined" : "Thu Jun 06, 2013 11:21 am",
      "profileRank" : "SSVC Member",
      "location" : "Towcester",
      "postCount" : "144",
      "avatarPath" : "./download/file.php%3Favatar=38012_1371138261.jpg"
    },
    "content" : "£100k ..i wish \n<img class=\"smilies\" src=\"./images/smilies/icon_lol.gif\" alt=\":lol:\" title=\"LOL\">...........that would bring me in to VAT land and I wont be going there . I think its fair to say the average trip price is lower than £500 - then you discount if more than one goes out to the same wedding etc etc We have 6 with combined age of 290 and the list of bills for that side of the family makes your eyes water !! \n<br>\n<br>Getting back to the OP, not wanting to hijack this thread - my point was you can bring in a decent amount but my word you shell out a lot too. People see the cash coming in but tend to have rose coloured spectacles on and forget about expenses. I may be at odds with others who seek a quick quid but once the bills are paid it all goes back to keeping the VW's splits / bay / beetle in the condition I want them in, used and on the road. I am passionate about each one of the 6, they bring a huge amount of happiness to hundreds of people a year and they will more than likely be heading in the direction of my kids when old enough as we do use them for fun and family purposes too. They will only be sold if they dont want them and I cant drive!! Maybe wrongly I see them as all our personal collection................... and we know what happens with collections, they tend to just grow and grow !\n<br>\n<br>I have to say the thought of doing something slightly different is a good one. We see splitty ice creams, bakery, coffee - but one that we are sometimes asked for is a strawberries and cream for summer weddings and summer fetes. However whatever you do, do it for the VW's benefit not yours because you happen to have one.",
    "lastEdited" : "Wed Jul 02, 2014 1:48 pm"
  }, {
    "postId" : "791873",
    "author" : {
      "username" : "Ollie",
      "userId" : "791873",
      "joined" : "Wed Oct 05, 2005 11:45 am",
      "profileRank" : "SSVC Member",
      "location" : "On the beach",
      "postCount" : "958",
      "avatarPath" : "./download/file.php%3Favatar=1749_1264418851.jpg"
    },
    "content" : "People will thrash the pants off your cars and break them!\n<br>\n<br>I certainly would not hire out a 'personal' vehicle...\n<br>\n<br>Regards,\n<br>\n<br>Ollie",
    "lastEdited" : "Wed Jul 02, 2014 3:10 pm"
  }, {
    "postId" : "792067",
    "author" : {
      "username" : "Ebeneezer",
      "userId" : "792067",
      "joined" : "Fri May 21, 2010 2:25 pm",
      "profileRank" : "SSVC Member",
      "location" : "-",
      "postCount" : "513",
      "avatarPath" : "./download/file.php%3Favatar=34265_1399465709.jpg"
    },
    "content" : "Talking to someone who is involved in the hire side and they budget for a new, stock 1600 engine to go an at the end of the season ready for the following year - ouch!",
    "lastEdited" : "Thu Jul 03, 2014 7:04 pm"
  }, {
    "postId" : "792302",
    "author" : {
      "username" : "graingey",
      "userId" : "792302",
      "joined" : "Wed Dec 05, 2012 5:05 am",
      "profileRank" : "Registered user",
      "location" : "Shrewsbury",
      "postCount" : "45",
      "avatarPath" : "./download/file.php%3Favatar=37279_1365857260.jpg"
    },
    "content" : "All,\n<br>\n<br>Apologies for the delay in responding, thank you very much for all the information and as some of you have suggested quite a difficult route to go down. I was actually only thinking of the wedding route and special occasions and i completely forgot to say that in my initial post, sorry about that, you are right that the 993 would have to be very expensive else it would lose more on devaluing the car due to higher mileage as its only at 34k now. Thats probably why i cant find one person doing it on the net for a turbo. I think you are right on all counts and i have taken that on board, thank you all very much. \n<br>Nick",
    "lastEdited" : "Sat Jul 05, 2014 1:33 pm"
  } ]
}