{
  "forumId" : "2",
  "threadId" : "124116",
  "title" : "Shipping question",
  "originalUrl" : "https://ssvc.org.uk/phpbb/viewtopic.php?f=2&t=124116",
  "breadcrumbs" : [ {
    "url" : "./viewforum.php?f=2&sid=aef17cbe7db09decae24ebe79125d5da",
    "label" : "VW Related Chat"
  } ],
  "totalPosts" : 6,
  "pageNumber" : 1,
  "totalPages" : 1,
  "posts" : [ {
    "postId" : "926787",
    "author" : {
      "username" : "frilly",
      "userId" : "926787",
      "joined" : "Wed Jul 30, 2014 8:50 pm",
      "profileRank" : "Registered user",
      "location" : "-",
      "postCount" : "450",
      "avatarPath" : null
    },
    "content" : "Good evening all. I'm looking for some advise and help in shipping a camper from Seattle Washington, has anyone done this? How do I start /what to look for! Kind regards neil . Ps anyone know how much it would cost",
    "lastEdited" : "Tue Nov 26, 2019 9:02 pm"
  }, {
    "postId" : "926788",
    "author" : {
      "username" : "65splitpanel",
      "userId" : "926788",
      "joined" : "Sun Oct 06, 2019 12:38 pm",
      "profileRank" : "Registered user",
      "location" : "-",
      "postCount" : "27",
      "avatarPath" : null
    },
    "content" : "I've brought in about 5 buses and bugs over the last few years (personal use, not a business) and always use a shipping company (based in Ipswich) that i can give you the number for if you like (PM me if you wish). They give me a quote - door to door and arrange everything in between. Saves you the hassle (as I did with my first one years ago, of going to collect it from the port and having no idea about all the paperwork). When I want a price from them, I just give them the vehicle type, the zip code of the collection address in the States and the delivery address here in the UK and they give me a quote, all in.\n<br> \n<br> My bus I just brought in a couple of months ago cost £ 2,300 (from LA to Felixstowe) and that included collection and delivery to the port in the States and delivery to my home address once here. Door to door, it generally takes around 10 weeks, give or take a week.\n<br> \n<br> You pay the shippers 50% of the shipping cost up front on booking and then the other 50% on arrival at the UK port. \n<br> \n<br> On top of that fee, there's obviously the cost of the vehicle and 5% duty on the cost of the vehicle AND shipping plus £300 that HMRC add on just because they can, it seems. Marine insurance is also extra and I would advise getting that.\n<br> \n<br> The worst part about shipping is that you must get lucky with the vendor. The guy I just bought my Panel from was superb and couldn't do enough to help. He even extended me an invite to go and visit him when I'm over there which is awesome. Others have not been so helpful. Hope some of that is useful information.\n<br> \n<br> Oh yes, I forgot to say, if you do go ahead and do it, a couple of things to bear in mind:\n<br> \n<br> Whatever vehicle you buy, make sure it has the original title (US equivalent of our V5) rather than just a bill of sale. If you only get a bill of sale, that can cause headaches with DVLA on occasion when you come to register it here. \n<br> \n<br> Always get the vendor to take plenty of photos when the vehicle is being loaded on collection etc.\n<br> \n<br> And lastly, some ports in the States are more difficult than others - Miami now apparently is a nightmare for shippers to get classic vehicles out of. LA on the other hand is fine.",
    "lastEdited" : "Tue Nov 26, 2019 11:50 pm"
  }, {
    "postId" : "926811",
    "author" : {
      "username" : "acmecustom",
      "userId" : "926811",
      "joined" : "Mon Apr 16, 2007 7:50 am",
      "profileRank" : "SSVC Member",
      "location" : "Newqvegas, Kernow. UK",
      "postCount" : "2926",
      "avatarPath" : "./download/file.php%3Favatar=5095_1258390691.jpg"
    },
    "content" : "I can highly recommend Kingstown Shipping, they are helping me with a camper I have bought from Sacramento at the moment. Super helpful and able to assist with every stage of the process.",
    "lastEdited" : "Thu Nov 28, 2019 7:54 pm"
  }, {
    "postId" : "926818",
    "author" : {
      "username" : "westwopa",
      "userId" : "926818",
      "joined" : "Fri Feb 19, 2010 5:06 pm",
      "profileRank" : "Registered user",
      "location" : "-",
      "postCount" : "592",
      "avatarPath" : null
    },
    "content" : "I've used US shipping companies which have been great and cheaper than getting someone to do it for you in the UK, try \n<a href=\"https://www.shipdei.com/\" class=\"postlink\">https://www.shipdei.com/</a>",
    "lastEdited" : "Fri Nov 29, 2019 7:58 pm"
  }, {
    "postId" : "926886",
    "author" : {
      "username" : "Nocky",
      "userId" : "926886",
      "joined" : "Sat Oct 19, 2019 9:06 pm",
      "profileRank" : "SSVC Member",
      "location" : "Quarry Bonk, West Mids",
      "postCount" : "106",
      "avatarPath" : "./download/file.php%3Favatar=43395_1571902448.jpg"
    },
    "content" : "I used Kingstown when I shipped my first Latebay over, it cost £2000 all in from San Francisco port to Kent. I paid no duty as I filled for historic vehicle with hmrc which was accepted. I provided all the documentation to Kingstown for that and they handled it with hmrc so I paid no import duty whatsoever. To do that you need the vehicle birth certificate from vw, pictures of the incoming vehicle and just print plenty of pages about the vehicle history. I also got my intended vehicle insurer as well as the Latebay website to provide written proof that it is historic. It cost me a further £175 to ship from Kent to West Midlands.\n<br> \n<br> All told, it took 12 weeks door to door.\n<br> \n<br> The guy I brought it off arranged shipping to the port, and the guy from Kingstown called me when it arrived to confirm arrival. I then did the bank transfer to the USA seller.",
    "lastEdited" : "Wed Dec 04, 2019 7:47 pm"
  }, {
    "postId" : "927297",
    "author" : {
      "username" : "susta",
      "userId" : "927297",
      "joined" : "Tue Dec 10, 2013 10:26 pm",
      "profileRank" : "SSVC Member",
      "location" : "sutton",
      "postCount" : "363",
      "avatarPath" : "./download/file.php%3Favatar=38749_1398105271.png"
    },
    "content" : "LA won't let it leave without a Bill of Title",
    "lastEdited" : "Tue Jan 07, 2020 4:09 pm"
  } ]
}