{
  "forumId" : "2",
  "threadId" : "98691",
  "title" : "History of your bus",
  "originalUrl" : "https://ssvc.org.uk/phpbb/viewtopic.php?f=2&t=98691",
  "breadcrumbs" : [ {
    "url" : "./viewforum.php?f=2&sid=0b5620862d60b74ab15941de173eb9f3",
    "label" : "VW Related Chat"
  } ],
  "totalPosts" : 6,
  "pageNumber" : 1,
  "totalPages" : 1,
  "posts" : [ {
    "postId" : "754752",
    "author" : {
      "username" : "trash116",
      "userId" : "754752",
      "joined" : "Thu Apr 12, 2012 10:04 pm",
      "profileRank" : "SSVC Member",
      "location" : "Kinver, West Midlands",
      "postCount" : "113",
      "avatarPath" : "./download/file.php%3Favatar=36484_1379446803.jpg"
    },
    "content" : "Hi\n<br> \n<br> I just wondered if anybody has been interested in/managed to trace the life history of their bus? and if so any tips on how to do so?\n<br> \n<br> So far I've got a VW birth certificate - that was interesting and clarified a few things, but on destination it just said USA. The last UK owner told me where in the states it came from, and I've also emailed the last known owner in the USA - Nate at Wagenswest (I'm waiting for him to reply).\n<br> \n<br> What I'd like to do is try and find out as much about the life of my bus as I can - but not sure if this is realistic or impossible to do. Any tips/stories appreciated.\n<br> \n<br> Thanks \n<img class=\"smilies\" src=\"./images/smilies/icon_biggrin.gif\" width=\"15\" height=\"15\" alt=\":D\" title=\"Big Grin\">",
    "lastEdited" : "Tue Oct 29, 2013 3:03 pm"
  }, {
    "postId" : "754761",
    "author" : {
      "username" : "clymoj",
      "userId" : "754761",
      "joined" : "Tue Mar 27, 2012 12:10 pm",
      "profileRank" : "Registered user",
      "location" : "London & Birmingham",
      "postCount" : "1355",
      "avatarPath" : null
    },
    "content" : "Mine came with lots of paperwork: photocopies of registration docs with the first 20-25 years of owners and addresses (as well as original registration details, exact model details etc.). Not sure where youd get these from but someone obviously has at some point. It also has every bill since then so probably another 25 years worth with various garages, suppliers and a couple more owners. And a photo album of its big restoration in the mid nineties with things like material samples for the interior and correspondence on spec choices etc. Finally I got boxes of bits with leftovers of install kits, original bits replaced, offcuts of materials, wires, original cardboard boxes etc. All gives you a surprising feel for the whole story, where it's been, who's done the work on it, what's been upgraded and when. I've then called some of the people who've worked on it in the past when I've needed to find out details or understand why something is the way it is or where bits were sourced from. And a lot of google searching and forum trawling of what was in vogue at the time when various mods were done (particularly on my suspension).\n<br> \n<br> Not much help for you maybe but you did ask for stories \n<img class=\"smilies\" src=\"./images/smilies/icon_smile.gif\" width=\"15\" height=\"15\" alt=\":)\" title=\"Grin\">",
    "lastEdited" : "Tue Oct 29, 2013 4:36 pm"
  }, {
    "postId" : "754869",
    "author" : {
      "username" : "maddison",
      "userId" : "754869",
      "joined" : "Fri Feb 01, 2008 1:56 pm",
      "profileRank" : "SSVC Member",
      "location" : "up norf",
      "postCount" : "5538",
      "avatarPath" : "./download/file.php%3Favatar=15870_1360143264.png"
    },
    "content" : "history of a US bus thats been through a few hands....not gonna be easy\n<br> \n<br> \n<br> but.....i'm sure you'll have an amazing time trying\n<br> obviously, with a UK bus i'd be looking to the DVLA and requesting as much information as possible with regards to previous owners, then contacing / visiting them\n<br> \n<br> not sure if the US has an equivilant or whether they would release the info now the bus has been exported (and quite possibly just been sat unused for many years)\n<br> \n<br> (with Uk buses - i found if you just go to vanfest and drive around a while, sooner or later you'll bump into someone who knows your buses history - and in my case, even did some welding on it in the 80/90's)",
    "lastEdited" : "Wed Oct 30, 2013 7:59 am"
  }, {
    "postId" : "754873",
    "author" : {
      "username" : "maddison",
      "userId" : "754873",
      "joined" : "Fri Feb 01, 2008 1:56 pm",
      "profileRank" : "SSVC Member",
      "location" : "up norf",
      "postCount" : "5538",
      "avatarPath" : "./download/file.php%3Favatar=15870_1360143264.png"
    },
    "content" : "...and you will probably find it lived a boring life\n<br> \n<br> \n<br> what i would suggest, is you think up a really interesting history for the bus, then spend the time you would have wasted researching its past, put to good use, faking some evidence of the new interesting past you created\n<br> \n<br> \n<img class=\"smilies\" src=\"./images/smilies/wink.gif\" width=\"15\" height=\"15\" alt=\";-)\" title=\"Wink\">",
    "lastEdited" : "Wed Oct 30, 2013 8:26 am"
  }, {
    "postId" : "754892",
    "author" : {
      "username" : "clymoj",
      "userId" : "754892",
      "joined" : "Tue Mar 27, 2012 12:10 pm",
      "profileRank" : "Registered user",
      "location" : "London & Birmingham",
      "postCount" : "1355",
      "avatarPath" : null
    },
    "content" : "<blockquote>\n <div>\n  <cite>maddison wrote:</cite> what i would suggest, is you think up a really interesting history for the bus, then spend the time you would have wasted researching its past, put to good use, faking some evidence of the new interesting past you created\n  <br> \n  <br> \n  <img class=\"smilies\" src=\"./images/smilies/wink.gif\" width=\"15\" height=\"15\" alt=\";-)\" title=\"Wink\">\n </div>\n</blockquote> Yeah doesn't your dove blue one have bullet holes in it? You could make up all sorts of excitement...",
    "lastEdited" : "Wed Oct 30, 2013 11:28 am"
  }, {
    "postId" : "754944",
    "author" : {
      "username" : "DubMinx",
      "userId" : "754944",
      "joined" : "Fri Feb 08, 2013 8:06 pm",
      "profileRank" : "Registered user",
      "location" : "North Yorkshire",
      "postCount" : "132",
      "avatarPath" : "./download/file.php%3Favatar=37396_1378069415.jpg"
    },
    "content" : "(with Uk buses - i found if you just go to vanfest and drive around a while, sooner or later you'll bump into someone who knows your buses history - and in my case, even did some welding on it in the 80/90's)[/quote]\n<br> \n<br> We have a proper North Easter Geordie bus (rock hard) and were flagged down by some previous owners coming out of Springdub earlier this year. We had noted them in there as they were very creatively dressed amongst the hoodies, vans and bodywarmers. I friended them in FB and after viewing some of their photos and parties and further creative dressing dreaded to think what our bus might have been up to! \n<br> \n<br> Husband creature works in cramlington and works with a bloke who knows the guy who sprayed it etc etc \n<br> \n<br> Seriously though they are great people and did most of the resto in in van and have helped us loads. \n<br> \n<br> Waiting for a party invite....",
    "lastEdited" : "Wed Oct 30, 2013 5:23 pm"
  } ]
}