{
  "forumId" : "2",
  "threadId" : "121994",
  "title" : "Collecting my first splitty - what should I check for?",
  "originalUrl" : "https://ssvc.org.uk/phpbb/viewtopic.php?f=2&t=121994&start=15",
  "breadcrumbs" : [ {
    "url" : "./viewforum.php?f=2&sid=cf02563ab9a8d854eb62bd93c91be7b0",
    "label" : "VW Related Chat"
  } ],
  "totalPosts" : 44,
  "pageNumber" : 2,
  "totalPages" : 3,
  "posts" : [ {
    "postId" : "913346",
    "author" : {
      "username" : "andy",
      "userId" : "913346",
      "joined" : "Thu May 01, 2003 6:35 pm",
      "profileRank" : "SSVC Member",
      "location" : "Norfhamptonville",
      "postCount" : "475",
      "avatarPath" : null
    },
    "content" : "Maybe ask the old owner when last service was carried out by a garage and when the fuel lines were last changed, take a fire extinguisher, depending on your route plot out a few vw garages along the way that are open. check your oil and wheel nuts before leaving. Safe travels .",
    "lastEdited" : "Thu Jun 07, 2018 11:55 am"
  }, {
    "postId" : "913360",
    "author" : {
      "username" : "Cornwall1986",
      "userId" : "913360",
      "joined" : "Mon Jun 04, 2018 7:59 pm",
      "profileRank" : "SSVC Member",
      "location" : "-",
      "postCount" : "22",
      "avatarPath" : "./download/file.php%3Favatar=42764_1528739439.jpg"
    },
    "content" : "Thanks all for the further input - all useful stuff. Cannot bring a fire extinguisher unfortunately though as going by plane.\n<br> \n<br> Insurance sorted (RH), 1 way tickets booked, looking forward to it! \n<img class=\"smilies\" src=\"./images/smilies/icon_biggrin.gif\" width=\"15\" height=\"15\" alt=\":D\" title=\"Big Grin\"> \n<br> \n<br> Mark",
    "lastEdited" : "Thu Jun 07, 2018 7:26 pm"
  }, {
    "postId" : "913363",
    "author" : {
      "username" : "Starsky2727",
      "userId" : "913363",
      "joined" : "Thu Jun 15, 2017 8:12 pm",
      "profileRank" : "SSVC Member",
      "location" : "-",
      "postCount" : "177",
      "avatarPath" : "./download/file.php%3Favatar=42213_1499353155.jpg"
    },
    "content" : "Hi Mark\n<br> I leave in St Neots if you have any concerns you can give me a call cheers Aaron",
    "lastEdited" : "Thu Jun 07, 2018 8:52 pm"
  }, {
    "postId" : "913370",
    "author" : {
      "username" : "Cornwall1986",
      "userId" : "913370",
      "joined" : "Mon Jun 04, 2018 7:59 pm",
      "profileRank" : "SSVC Member",
      "location" : "-",
      "postCount" : "22",
      "avatarPath" : "./download/file.php%3Favatar=42764_1528739439.jpg"
    },
    "content" : "Thanks Aaron!",
    "lastEdited" : "Fri Jun 08, 2018 5:48 am"
  }, {
    "postId" : "913375",
    "author" : {
      "username" : "malum",
      "userId" : "913375",
      "joined" : "Fri Jul 22, 2011 7:12 pm",
      "profileRank" : "SSVC Member",
      "location" : "West Sussex",
      "postCount" : "558",
      "avatarPath" : null
    },
    "content" : "I picked mine up and drove it home a 250 miles, although I had previously rented one for a weekend.\n<br> From a driving home point of view (and you've already bought it so looking for things that are wrong with it when you get there seems a little late) these were my experiences of that first drive:\n<br> \n<br> • The brakes may be poor, the one I rented had terrible brakes, the one I bought had very much better brakes (all drums, so just a question of \n<br> adjustment) be prepared to stand on the brakes to stop it.\n<br> • The free play in the steering means you'll have to concentrate, hard, the whole time. If there's a cross wind on a motorway it will make you \n<br> sweat. If you take one hand off the wheel you’ll be all over the road (crosswind or not). Before I fitted a steering rack I drove in France on the \n<br> motorway in a strong crosswind and driving rain. I think I knocked 5 years off my life that day\n<br> • If a lorry overtakes you (and they will) it will feel like you are being sucked into the same lane as the lorry, you'll get used to bracing yourself \n<br> when you see one coming.\n<br> • It’s LHD so if you in the UK overtaking on the motorway (and you might have to) might be tricky if you have bad mirrors (I did) there’s a huge blind \n<br> spot\n<br> • You’ll get used to the sloppy gears pretty quickly\n<br> • If the oil light comes on stop driving.\n<br> \n<br> From an ongoing point of view:\n<br> \n<br> • King pin play might just be lack of grease, pump them full and see if it’s still there.\n<br> • Check the fuel lines ASAP for cracking, replace them all if in any doubt\n<br> • If you want to solve the steering get the box refurbed or fit a steering rack, I did the latter. Can now drive in a straight line with one hand on \n<br> the wheel, one of the best upgrades I did.\n<br> • I went front discs and a servo for the brakes, stops like a modern car now but I have a big lump in the back so I needed the stopping power.\n<br> • Get a convex mirror for the offside so you can see in the blind spot, turns a lottery into a breeze.\n<br> • If the gears are really sloppy get the bushings changed and fit a short shifter for a much more precise change (I went short shifter and it was \n<br> very much better) but you will get used to the ‘stick in porridge’ method of gear change.",
    "lastEdited" : "Fri Jun 08, 2018 9:31 am"
  }, {
    "postId" : "913377",
    "author" : {
      "username" : "miles",
      "userId" : "913377",
      "joined" : "Thu Oct 17, 2002 4:01 pm",
      "profileRank" : "Registered user",
      "location" : ".... Amersham",
      "postCount" : "4259",
      "avatarPath" : "./download/file.php%3Favatar=4_1435778539.jpg"
    },
    "content" : "Hello Mark, \n<br> \n<br> You have PM. If you need assistance on your way back (and are near(ish)) Amersham / Watford, please give me a shout.\n<br> \n<br> Cheers\n<br> \n<br> Miles.",
    "lastEdited" : "Fri Jun 08, 2018 10:21 am"
  }, {
    "postId" : "913391",
    "author" : {
      "username" : "Starsky2727",
      "userId" : "913391",
      "joined" : "Thu Jun 15, 2017 8:12 pm",
      "profileRank" : "SSVC Member",
      "location" : "-",
      "postCount" : "177",
      "avatarPath" : "./download/file.php%3Favatar=42213_1499353155.jpg"
    },
    "content" : "Didn’t hear from you Mark so I assume your on the way home. Let us know tomorrow on your experience \n<br> Cheers\n<br> Aaron\n<br> \n<br> \n<br> Sent from my iPhone using Tapatalk",
    "lastEdited" : "Fri Jun 08, 2018 7:41 pm"
  }, {
    "postId" : "913393",
    "author" : {
      "username" : "miles",
      "userId" : "913393",
      "joined" : "Thu Oct 17, 2002 4:01 pm",
      "profileRank" : "Registered user",
      "location" : ".... Amersham",
      "postCount" : "4259",
      "avatarPath" : "./download/file.php%3Favatar=4_1435778539.jpg"
    },
    "content" : "Mark - hope the trip went OK / to plan \n<img class=\"smilies\" src=\"./images/smilies/icon_smile.gif\" width=\"15\" height=\"15\" alt=\":)\" title=\"Grin\">",
    "lastEdited" : "Fri Jun 08, 2018 11:06 pm"
  }, {
    "postId" : "913394",
    "author" : {
      "username" : "Cornwall1986",
      "userId" : "913394",
      "joined" : "Mon Jun 04, 2018 7:59 pm",
      "profileRank" : "SSVC Member",
      "location" : "-",
      "postCount" : "22",
      "avatarPath" : "./download/file.php%3Favatar=42764_1528739439.jpg"
    },
    "content" : "Hi All,\n<br> \n<br> A really quick update so I can go back on the road. So first things first, I did obviously buy it! \n<img class=\"smilies\" src=\"./images/smilies/icon_biggrin.gif\" width=\"15\" height=\"15\" alt=\":D\" title=\"Big Grin\"> \n<img class=\"smilies\" src=\"./images/smilies/icon_biggrin.gif\" width=\"15\" height=\"15\" alt=\":D\" title=\"Big Grin\"> \n<br> \n<br> I was happy with everything after having a good look over it and the seller had loads of paperwork for everything which had ever been done etc which was reassuring. I have all the pictures from when it was resprayed and things like.\n<br> \n<br> Managed to tick off more than half (160 miles ish) last night taking it very slowly (48 to 50mph on gps \n<img class=\"smilies\" src=\"./images/smilies/icon_lol.gif\" width=\"15\" height=\"15\" alt=\":lol:\" title=\"LOL\"> ) before stopping in a services for a few hours. I must have a few greys from the initial hour - particularly from the overtaking lorries as malum mentioned! Made me smile though as I had 3 people ask me about it / take pictures within 10 mins of arriving at the services.\n<br> \n<br> Now I do have one problem which I would love to know your thoughts on. When the seller was taking me for a drive it did stall on him a couple of times which I thought was perhaps just a cold engine or his driving. It has however been stalling on me too. It starts no problem and normally idles OK initially. It is then after driving when coming to a stop that the revs just drop and it will stall if I do not get a chance to give it some power. I am hoping that it is something fairly simple as when constantly on the move, it did the 160 miles without any hesitation. Doing a very very quick google, looks like this could be any number of things such as the choke adjuster screw, air flow screw, air leaks in the inlet system, rubbish in fuel lines etc. Would I be best getting a garage to look at this or are there some simple checks I can do first to rule things out one by one?\n<br> \n<br> Another thank you to everyone. I am blown away by the help from everyone and offers of assistance!\n<br> \n<br> Mark",
    "lastEdited" : "Sat Jun 09, 2018 5:58 am"
  }, {
    "postId" : "913395",
    "author" : {
      "username" : "Who.Me?",
      "userId" : "913395",
      "joined" : "Thu May 15, 2014 8:13 pm",
      "profileRank" : "SSVC Member",
      "location" : "West Sussex",
      "postCount" : "1067",
      "avatarPath" : "./download/file.php%3Favatar=39206_1498850951.jpg"
    },
    "content" : "<blockquote cite=\"./viewtopic.php?p=913394&amp;sid=cf02563ab9a8d854eb62bd93c91be7b0#p913394\">\n <div>\n  <cite><a href=\"./memberlist.php?mode=viewprofile&amp;u=42764&amp;sid=cf02563ab9a8d854eb62bd93c91be7b0\">Cornwall1986</a> wrote: <a href=\"./viewtopic.php?p=913394&amp;sid=cf02563ab9a8d854eb62bd93c91be7b0#p913394\" data-post-id=\"913394\" onclick=\"if(document.getElementById(hash.substr(1)))href=hash\">↑</a><span class=\"responsive-hide\">Sat Jun 09, 2018 5:58 am</span></cite> It starts no problem and normally idles OK initially. It is then after driving when coming to a stop that the revs just drop and it will stall if I do not get a chance to give it some power. ... Would I be best getting a garage to look at this or are there some simple checks I can do first to rule things out one by one? \n </div>\n</blockquote> It may just need a tune up, but check what carburettor(s) it's got, as the procedures are different for different years.\n<br> \n<br> You've said that it's got a 1600 engine. Others can help if it's got twin carbs (mounted to either side of the engine), but if it's still got a single carb (mounted centrally over the engine) it'll likely either be a 34PICT3 or H30/31 made by any one of a number of manufacturers.\n<br> \n<br> If it's a single carb, it will be marked with embossed letters on the left hand side toward the back. Stick your phone back there and take a picture then report back what it says.\n<br> \n<br> I've learned by trial and error and a lot of readying that the 34PICT3 single carbs on 1600 are fussy. They were designed at a time when VW were reacting to emissions control laws in California and need to be set up right to idle and start correctly. After eliminating air leaks, timing, tuning etc. etc. I eventually fixed mine with a larger idle jet, but your case may (probably will) be different.\n<br> \n<br> If it is a 34PICT3, set aside a couple of hours one morning when the engine is cold and start here... \n<a href=\"http://www.vw-resource.com/34pict3.html\" class=\"postlink\">http://www.vw-resource.com/34pict3.html</a>",
    "lastEdited" : "Sat Jun 09, 2018 7:31 am"
  }, {
    "postId" : "913398",
    "author" : {
      "username" : "Starsky2727",
      "userId" : "913398",
      "joined" : "Thu Jun 15, 2017 8:12 pm",
      "profileRank" : "SSVC Member",
      "location" : "-",
      "postCount" : "177",
      "avatarPath" : "./download/file.php%3Favatar=42213_1499353155.jpg"
    },
    "content" : "Pic from eBay\n<br> \n<img src=\"//uploads.tapatalk-cdn.com/20180609/838e5c3e7a602f03ac06a44cea2c6dd6.png\" class=\"postimage\" alt=\"Image\">\n<br> \n<br> \n<br> Sent from my iPhone using Tapatalk",
    "lastEdited" : "Sat Jun 09, 2018 7:45 am"
  }, {
    "postId" : "913410",
    "author" : {
      "username" : "Who.Me?",
      "userId" : "913410",
      "joined" : "Thu May 15, 2014 8:13 pm",
      "profileRank" : "SSVC Member",
      "location" : "West Sussex",
      "postCount" : "1067",
      "avatarPath" : "./download/file.php%3Favatar=39206_1498850951.jpg"
    },
    "content" : "<blockquote cite=\"./viewtopic.php?p=913398&amp;sid=cf02563ab9a8d854eb62bd93c91be7b0#p913398\">\n <div>\n  <cite><a href=\"./memberlist.php?mode=viewprofile&amp;u=42213&amp;sid=cf02563ab9a8d854eb62bd93c91be7b0\">Starsky2727</a> wrote: <a href=\"./viewtopic.php?p=913398&amp;sid=cf02563ab9a8d854eb62bd93c91be7b0#p913398\" data-post-id=\"913398\" onclick=\"if(document.getElementById(hash.substr(1)))href=hash\">↑</a><span class=\"responsive-hide\">Sat Jun 09, 2018 7:45 am</span></cite> Pic from eBay \n </div>\n</blockquote> That's a dual port inlet manifold and the carb is bolted straight on to it without a spacer/adaptor, so I'd say it's a 34PICT3 carb.\n<br> \n<br> Start with the VW Resource tune-up guide that I linked to above. It won't cost you anything and I'd do all that it says in that link if I'd just bought.\n<br> \n<br> It's worth checking the maker's name on the side though as the repros made by BOCAR are a bit cr&amp;ppy and you might find that you're better off sourcing a rebuilt SOLEX original (Or possibly trying a new EMPI one. Some guys on The Samba said they make a decent one today.) Try the VW Resource tune up stuff first though.\n<br> \n<br> Then read the rest of their guides when you have time, they're well written and simple to follow.\n<br> \n<br> Other quick fixes below. Don't let these put you off. You've got a running, driving road-legal splitty. These are just fixes that will help you keep it like that...\n<br> \n<br> Check that there is a paper element in that pancake filter on top of the carb. There was one like that on my single cab when I got it and it was empty, so nothing to stop grit going down in to the engine.\n<br> \n<br> Check also whether there is a 1/2\" spigot on the underside of that filter. It should have a tube linking it to a similar spigot by the oil filler (although your oil filler is not stock, so it might not have one). The purpose of that is to provide positive crank case ventilation (PCV). It scavenges any exhaust gasses that 'blow by' the piston rings. Without it, you may find that it blows oil out from behind the pulley at the front of the engine and makes a mess in the engine bay.\n<br> \n<br> It looks like someone deleted the stock heating but didn't fill the holes in the breast tin (See yellow arrows below). Do something to blank those holes off. They're letting heat up from your exhaust so your cooling fan will be blowing hotter air over the cylinder heads. . They did at least blank off the outlets from the fan shroud though (red arrows).\n<br> \n<br> You're also missing two little pieces of tin that seal around the heat risers (where my blue arrows are pointing). They have little fiber seals that go in there. See here . \n<a href=\"http://1967beetle.com/heat-riser-tube/\" class=\"postlink\">http://1967beetle.com/heat-riser-tube/</a> VW Heritage sell the seals (I replaced mine a couple of weeks ago), not sure if they do the tin though. Again, you'll be getting hot air from below coming up in to the engine compartment and getting blown back over the engine by the fan.\n<br> \n<br> When you get a chance, it'd be a good idea to pull the engine out to check if any other bits are missing.\n<br> \n<div class=\"inline-attachment\"> \n <dl class=\"thumbnail\"> \n  <dt>\n   <a href=\"./download/file.php?id=29769&amp;sid=cf02563ab9a8d854eb62bd93c91be7b0&amp;mode=view\"><img src=\"./download/file.php?id=29769&amp;t=1&amp;sid=cf02563ab9a8d854eb62bd93c91be7b0\" class=\"postimage\" alt=\"InkedInked838e5c3e7a602f03ac06a44cea2c6dd6.png_LI.jpg\" title=\"InkedInked838e5c3e7a602f03ac06a44cea2c6dd6.png_LI.jpg (92.31 KiB) Viewed 2030 times\"></a>\n  </dt> \n </dl> \n</div>",
    "lastEdited" : "Sat Jun 09, 2018 6:33 pm"
  }, {
    "postId" : "913420",
    "author" : {
      "username" : "JonnyCJ",
      "userId" : "913420",
      "joined" : "Thu Mar 14, 2013 6:50 pm",
      "profileRank" : "SSVC Member",
      "location" : "Heswall",
      "postCount" : "3072",
      "avatarPath" : null
    },
    "content" : "As above - however, with the blanking plugs that cover the two “arms” that come out of the fan shroud (red arrows) they’ll be disrupting the airflow inside the fan shroud a bit, causing inefficient cooling. I’d be tempted to drill a 10mm hole in them to allow the air out that should have gone to the heater tubes.\n<br> \n<br> That way the airflow will be more as VW intended.\n<br> \n<br> In terms of blocking off the big holes (yellow arrows) see if any of the grommet suppliers do a large enough blanking grommet to cover those.\n<br> \n<br> Be interested in seeing your exhaust set up as well.\n<br> \n<br> None of the above is major, but definitely worth attending to.\n<br> \n<br> Welcome to the fun world of bus ownership \n<img class=\"smilies\" src=\"./images/smilies/icon_cool.gif\" width=\"15\" height=\"15\" alt=\"8)\" title=\"Cool\">",
    "lastEdited" : "Sat Jun 09, 2018 9:53 pm"
  }, {
    "postId" : "913422",
    "author" : {
      "username" : "Dougie",
      "userId" : "913422",
      "joined" : "Tue Feb 21, 2006 8:31 am",
      "profileRank" : "SSVC Committee Member",
      "location" : "Redditch",
      "postCount" : "922",
      "avatarPath" : "./download/file.php%3Favatar=2106_1498983016.jpg"
    },
    "content" : "Glad you're home safe and enjoyed your first drive. I told you strangers would come and talk to you....\n<br> The stalling thing is annoying but you should be able to sort it fairly easily. I can't quite see from the engine picture, but the carb has a small brass tube that is not used but will draw in air, weakening the mixture and making you stall at junctions. It is usually blocked off with a small black rubber cap. It's easy to see as it faces you as you look at the carb. Even insulation tape will seal it till you get round to finding a cap that fits. \n<br> This minor annoyances are all just part of the fun of owning these old buses, there's always something and they are never 'finished'..",
    "lastEdited" : "Sun Jun 10, 2018 4:55 am"
  }, {
    "postId" : "913477",
    "author" : {
      "username" : "Cornwall1986",
      "userId" : "913477",
      "joined" : "Mon Jun 04, 2018 7:59 pm",
      "profileRank" : "SSVC Member",
      "location" : "-",
      "postCount" : "22",
      "avatarPath" : "./download/file.php%3Favatar=42764_1528739439.jpg"
    },
    "content" : "Sorry for the late reply - it's been a bit manic since getting him home.\n<br> \n<br> Picture of carb attached - a Solex 30PICT-3. Is that much different from the 34PICT-3? Wow a few things to check above! Will start looking at these in more detail tomorrow. Like you say Dougie, all part of the fun \n<img class=\"smilies\" src=\"./images/smilies/icon_smile.gif\" width=\"15\" height=\"15\" alt=\":)\" title=\"Grin\">. Can't wait to get the stalling sorted though as its currently making me a bit nervous moving it around, putting in the garage etc when always having to be on the accelerator and handbrake to stop etc!\n<br> \n<br> On a separate note, I was a bit worried that I wouldn't have any splitscreen specialists near me - I only moved to Cornwall from Essex a few months ago. Turns out I have Matt Keene / Airkraft in the same village who I hear is well regarded and Westcost VW (from Camper Van Crisis?) 10 mins away. Handy! Going to get quotes from both for replacing roof lining and adding seatbelts.\n<br> \n<br> Mark",
    "lastEdited" : "Mon Jun 11, 2018 5:39 pm"
  } ]
}