{
  "forumId" : "2",
  "threadId" : "112349",
  "title" : "Bugs/Buses @ the Brewery",
  "originalUrl" : "https://ssvc.org.uk/phpbb/viewtopic.php?f=2&t=112349",
  "breadcrumbs" : [ ],
  "totalPosts" : 2,
  "pageNumber" : 1,
  "totalPages" : 1,
  "posts" : [ {
    "postId" : "847437",
    "author" : {
      "username" : "Pete67",
      "userId" : "847437",
      "joined" : "Tue Nov 09, 2010 10:02 pm",
      "profileRank" : "Registered user",
      "location" : "-",
      "postCount" : "43",
      "avatarPath" : null
    },
    "content" : "Any of you SSVC guys over on the Emerald Isle on hols or fancy a road trip you are more than welcome to book in for the following show - new to the NI aircooled vw community over here. Lots if buzz about this and wish us well guys! We are taking steps to get our wee vw community firing again in Northern Ireland. And it is working. Game of Thrones road trips, campouts etc This is our new one day static show at the Hilden Brewery Lisburn. \n<br>\n<br>Bugs@theBrewery Press release:\n<br>\n<br>Gates open at 10am for show cars and as much as possible if cars can be in place by 10:30am. ALL ARE WELCOME for a great day dub or dub-less! However, space within the Brewery site will be needed for show cars, so if you are coming in a daily driver (and please do), simply park outside the Hilden Brewery gates in the ample parking and dander in. NBOC and friends have been given the run of Hilden for the day with two very atmospheric main areas for vdub parking:\n<br>\n<br>Front of the Georgean House (we are thinking for our campervans/vans)\n<br>\n<br>And just around the corner in the Hilden Stables Courtyard (we are thinking for our beetles, karmann ghias, buggys etc).\n<br>\n<br>ENTRY PACK. £10 for adults and £5 for children for the show. \n<br>\n<br>The Entry Pack includes:\n<br>\n<br>The TAP ROOMS GOURMET BBQ. Hilden is also famous for their food. Hilden Brewery Tap Rooms Restaurant are providing and cooking a gourmet BBQ. The menu for adults includes 2 Dorans Pork and Leek Sausages, a Cajun Chicken Drumstick and a prime ground beef burger in a bun along with dressed salad and coleslaw. For children there will be plenty of burgers and hot-dogs and extras. So no getting out the disposables this day, we can all sit back, chill and enjoy.\n<br>\n<br>An ICE CREAM will be provided by the vintage ice cream company.\n<br>\n<br>Young Northern Dubbers Activities: we plan to make this a real family friendly show with lots to keep the young ones happy. Including a Young Northern Dubbers Craft Corner, facepainting, a treasure hunt, garden games, competitions and all free and as part of the day.\n<br>\n<br>WET WEATHER – NO PROBLEM. We have access to much of the Tap Rooms atmospheric gallery and bar for the day.\n<br>\n<br>Sunny Weather – Happy Days! As well as front of house and the atmospheric Stables Courtyard, to the rear of the Tap Rooms we have sole access to a contained walled garden and picnic table area – perfect for the Young Northern Dubbers!\n<br>\n<br>Travelling a distance?/After-show Why not book Lisburn Premier Inn who have rooms from £39 and let the craic continue. Some have booked already!\n<br>\n<br>NBOC also plan to hold a fundraiser on this day such as a raffle and proceeds will be given to the Scullion family for them to give to a charity of their choice in little Oliver Scullion's memory after his tragic passing.\n<br>\n<br>PAYPAL YOUR SUPPORT FOR Bugs@theBrewery at \n<!-- m -->\n<a class=\"postlink\" href=\"http://www.nboc.co.uk\">http://www.nboc.co.uk</a>\n<!-- m -->\n<br>\n<br>All in all we hope this will be a very special day for the vw community and ask for your support to join us on this special day. Do invite friends and family who will enjoy a great day in a unique location and pack the place out! Now for the hard sell! NBOC are putting so much into this to make it a great day. PLEASE do support us by coming and also by using the online PayPal service (see \n<!-- m -->\n<a class=\"postlink\" href=\"http://www.nboc.co.uk\">http://www.nboc.co.uk</a>\n<!-- m -->) in advance as we really need to give Hilden approximate numbers for catering. Let's make this a day to remember. \n<br>\n<br>Approximate timings of the day:\n<br>\n<br>10am onwards: Arrive, park up, settle in and enjoy!\n<br>Throughout the day: music, garden games, Young Northern Dubbers craft corner, facepainting.\n<br>From 1pm: The Tap Rooms Gourment BBQ.\n<br>2pm: Ice Cream.\n<br>2:30pm Young Northern Dubbers Treasure Hunt and craft display.\n<br>3:30pm: announcements, awards for Young Northern Dubbers, spot prizes (just a bit of fun really).\n<br>4pm ish onwards Cruise into the Evening Sun or to the Premier Inn!",
    "lastEdited" : "Mon Aug 31, 2015 10:30 pm"
  }, {
    "postId" : "847438",
    "author" : {
      "username" : "Pete67",
      "userId" : "847438",
      "joined" : "Tue Nov 09, 2010 10:02 pm",
      "profileRank" : "Registered user",
      "location" : "-",
      "postCount" : "43",
      "avatarPath" : null
    },
    "content" : "<!-- m -->\n<a class=\"postlink\" href=\"http://www.forum.nboc.co.uk/bugs2.jpg\">http://www.forum.nboc.co.uk/bugs2.jpg</a>\n<!-- m -->",
    "lastEdited" : "Mon Aug 31, 2015 10:31 pm"
  } ]
}