{
  "forumId" : "28",
  "threadId" : "93823",
  "title" : "BWA all time top racers categories...........",
  "originalUrl" : "https://ssvc.org.uk/phpbb/viewtopic.php?f=28&t=93823",
  "breadcrumbs" : [ {
    "url" : "./viewforum.php?f=28&sid=cf1895cf85236285e940e997e82c9311",
    "label" : "BWA"
  } ],
  "totalPosts" : 8,
  "pageNumber" : 1,
  "totalPages" : 1,
  "posts" : [ {
    "postId" : "720053",
    "author" : {
      "username" : "gazmate",
      "userId" : "720053",
      "joined" : "Sat Jul 29, 2006 3:57 pm",
      "profileRank" : "Registered user",
      "location" : "hastings england",
      "postCount" : "462",
      "avatarPath" : null
    },
    "content" : "I know this was discussed some time ago not sure what the outcome and if it was decided its not a good option I will say sorry now, but if it is still is an idea floating about and up for discussion I thought I will just chip in………………\n<br> \n<br> Was looking on the cal look lounge and there all time top racers list (great title by the way, allways going to draw you in) so looking through I thought it really is a good way to do it with different categories, is it better than bwa I don’t know, but is it interesting and maybe brings you back to look more often maybe yes?\n<br> \n<br> So I thought how could we do it and just broke it up into 3 categories as a discussion starter……….. \n<br> \n<br> \n<span style=\"color:#0000BF\">\"Split Bus Street racer\":</span>\n<br> Splitscreens road legal, VW classic engines only without any supercharging, NOS or Turbo. \n<br> \n<br> \n<span style=\"color:#4000FF\">\"Split Bus Pro Street\":</span>\n<br> Splitscreens road legal, VW classic engines without any supercharging, but can have NOS or Turbo\n<br> \n<br> \n<span style=\"color:#BF00FF\">\"Split Bus Pro Comp\":</span>\n<br> All Splitscreens road legal or not, (any engine type????) supercharging, NOS or Turbo allowed. These should be some of the fastest busses in the world. \n<br> \n<br> And it could be \n<br> • all time list ……….. respect and credit due to all racers form when ever was their time\n<br> • and a yearly list…………… lets people know who’s out there this year, who’s the target to better this year, which should keep interest high",
    "lastEdited" : "Thu May 02, 2013 6:35 am"
  }, {
    "postId" : "720066",
    "author" : {
      "username" : "orb",
      "userId" : "720066",
      "joined" : "Wed Jan 14, 2004 6:00 pm",
      "profileRank" : "Registered user",
      "location" : "Kingston upon Thames",
      "postCount" : "2475",
      "avatarPath" : null
    },
    "content" : "Great idea Darren.\n<br> There was a distinct lack of buses on the strip at Big Bang this year, I know some of the main protagonists engines are still in the build phase but it was still disappointing. Maybe a rejig will re-ignite it a bit (I think the weather will help)\n<br> \n<br> Part of the problem is the lack of track time! Something always seems to go wrong at the pod, weather, oil downs, bikes jumping the que etc. we discussed trying to organise something along the lines of Das Drag Day - VW only, racing only, no silly hat stalls, no ponchos, non profit just hard core racers doing what they love. The Pod and Shakey would be too expensive but maybe North Weald or apparently there's a venue in Lincs that could work (isn't there something down Tuftys way in the West Country too?)\n<br> \n<br> I guess the financial climate has taken its toll on some but what about the rest? Is the interest in buses beginning to wain? Are people just building stout road buses rather than racers? We all know its a slippery slope and its easy to cross the line of what's useable on a daily basis.\n<br> \n<br> I like you proposed classes, especially as they'd favour myself \n<img class=\"smilies\" src=\"./images/smilies/icon_wink.gif\" width=\"15\" height=\"15\" alt=\":wink:\" title=\"Wink\"> \n<br> My bus is fast slipping out of the top 20 but if you put it in a list of currently running and being used and all of a sudden she's back in the top 10 \n<img class=\"smilies\" src=\"./images/smilies/icon_cheers.gif\" width=\"24\" height=\"24\" alt=\":cheers:\" title=\"cheers\"> \n<br> Mines only ever going to be a street bus so the chances of me ever beating Frank, Jarvis, Trevor or Steve is super slim! - until it bites hard, I win the lottery and buy a panel/pickup \n<img class=\"smilies\" src=\"./images/smilies/icon_wink.gif\" width=\"15\" height=\"15\" alt=\":wink:\" title=\"Wink\"> \n<br> \n<br> I'd be up for a change and would be happy to help on whatever capacity I can. \n<br> \n<br> Orb",
    "lastEdited" : "Thu May 02, 2013 7:30 am"
  }, {
    "postId" : "720105",
    "author" : {
      "username" : "gazmate",
      "userId" : "720105",
      "joined" : "Sat Jul 29, 2006 3:57 pm",
      "profileRank" : "Registered user",
      "location" : "hastings england",
      "postCount" : "462",
      "avatarPath" : null
    },
    "content" : "Orb that’s the point bang on, getting the interest going and get the enthusiasm back. Everyone likes having a pop at getting into the top 10, with 3 different levels maybe it gives more people a chance?\n<br> \n<br> As I say absolutely noting wrong with what BWA is doing and its what makes it great and why I wanted to get it, but just thought different classes could make it a bit more to aim for and also prompt more people to have a go, and then aim to step up each class even?\n<br> \n<br> As orb also said,Id be happy to help with this or any other stuff i know how hard it is to keep stuff updated and organising stuff\n<br> \n<br> \n<br> Gaz",
    "lastEdited" : "Thu May 02, 2013 10:50 am"
  }, {
    "postId" : "720185",
    "author" : {
      "username" : "tufty65",
      "userId" : "720185",
      "joined" : "Tue Oct 04, 2005 7:37 pm",
      "profileRank" : "Registered user",
      "location" : "Taunton, cider capital",
      "postCount" : "1408",
      "avatarPath" : null
    },
    "content" : "Is a good idea but I don't think people are put off/not intersted in racing buses because of the one category the people that are interested/enthusiastic are the ones racing today. \n<br> \n<br> Having the one category gives everyone the same benchmark to reach I.e beating the current fastest bus vw air cooled powered only and I don't think that having classes would suddenly attract loads of people to start racing. other than having stock buses competing against each other which while exciting for the driver it's not that interesting to watch a bus do 26sec 1/4 mile IMO and I'm probably not on my own on that one. \n<br> That's what makes the BWA a bit exclusive I guess. \n<br> \n<br> Also getting track time at the pod at vw meets is horrendous at the best of times and just trying to get buses paired off in the fire up lane at any show is nearly impossible trust me some of the BWA try every year and it never works. \n<br> \n<br> Even the night racing at vw action has its headaches doing this and this is sub 18 sec buses and invite only!\n<br> \n<br> I started out struggling to get 18 seconds with my bus but I got the bug after trying and it's been bigger and faster ever since. It's getting in the top 20 that attracted me and as I live miles from Santa pod I look forward to trying to move up the list even if I can only make it once a year. \n<br> \n<br> There is a place near me that holds drag racing a few times a year it's not a prepped track and no records will be made but you can do loads of runs. I did 6 last time in about 2 hours and called it a day after that and the track was open for another 2 hours. I put a thread on here and all the other forums every time there is an event but I was the only vw there every meet bar one.\n<br> I know not everyone with buses uses the forums but I'm sure the majority do so its not like it goes unnoticed. \n<br> \n<br> Also you have to be very careful in how you word 'racing' with categories.\n<br> If you start having heads up racing with classes then you may attract the attention of race licence people MSA/FIA etc and the owner of santa pod which would then result in roll cages, helmets and licences for people to take part which is expensive. Look what happened to the OFF guys years back.\n<br> \n<br> Like I said good idea but I reckon your struggle to get any more interest than there already is. \n<br> Who knows I could be talking s**t though \n<img class=\"smilies\" src=\"./images/smilies/icon_smile.gif\" width=\"15\" height=\"15\" alt=\":)\" title=\"Grin\">",
    "lastEdited" : "Thu May 02, 2013 4:27 pm"
  }, {
    "postId" : "720446",
    "author" : {
      "username" : "gazmate",
      "userId" : "720446",
      "joined" : "Sat Jul 29, 2006 3:57 pm",
      "profileRank" : "Registered user",
      "location" : "hastings england",
      "postCount" : "462",
      "avatarPath" : null
    },
    "content" : "Totally .... i don’t think that any changes will bring droves of people and the intention was not to do away with the 18 second rule as that is the benchmark for entry. \n<br> \n<br> The interest I was talking about is with the racers I go to race meets with Jarv and his firebus all the time and we race each other all the time and while I love it and would not change that in reality with Jarv pulling an extra 100bhp in NOS i am never going to realistically challenge him. \n<br> \n<br> Naturally if Jarv and I are racing and Pascal pulls up behind Jarv will naturally want to race him as its more of a challenge and more of a match…. Hence the interest point I make it is more interesting as a racer to be up against similar spec busses and that was the only point. \n<br> \n<br> As Orb was saying at big bang there was not much of a turn out for racing in busses Now the weather naturally affected this but I was at big bang and yes the weather contributed to my decision to race or not. For me if I realistically had a chance to progress up the top 20 list maybe that would have given me more incentive to race? Again I am not saying a list makes me want to race it just makes it slightly more interesting if you are gong up the list.\n<br> \n<br> Now I have rebuilt my engine over the winter with a race only cam and other bits so I only have to go a fraction quicker to get in the top 20 which I am hoping to have a go at sometime soon. \n<br> \n<br> I also get the point its exclusive and it should be hard to get in the top 20 so with this in mind maybe yes we should just leave alone and don’t try and fix something that is not broken.\n<br> \n<br> I was just kinda thinking aloud and sharing my thoughts \n<br> \n<br> \n<img class=\"smilies\" src=\"./images/smilies/icon_biggrin.gif\" width=\"15\" height=\"15\" alt=\":D\" title=\"Big Grin\">",
    "lastEdited" : "Fri May 03, 2013 3:16 pm"
  }, {
    "postId" : "720456",
    "author" : {
      "username" : "tufty65",
      "userId" : "720456",
      "joined" : "Tue Oct 04, 2005 7:37 pm",
      "profileRank" : "Registered user",
      "location" : "Taunton, cider capital",
      "postCount" : "1408",
      "avatarPath" : null
    },
    "content" : "<blockquote>\n <div>\n  <cite>gazmate wrote:</cite>Totally .... i don’t think that any changes will bring droves of people and the intention was not to do away with the 18 second rule as that is the benchmark for entry. \n  <br> \n  <br> The interest I was talking about is with the racers I go to race meets with Jarv and his firebus all the time and we race each other all the time and while I love it and would not change that in reality with Jarv pulling an extra 100bhp in NOS i am never going to realistically challenge him. \n  <br> \n  <br> Naturally if Jarv and I are racing and Pascal pulls up behind Jarv will naturally want to race him as its more of a challenge and more of a match…. Hence the interest point I make it is more interesting as a racer to be up against similar spec busses and that was the only point. \n  <br> \n  <br> As Orb was saying at big bang there was not much of a turn out for racing in busses Now the weather naturally affected this but I was at big bang and yes the weather contributed to my decision to race or not. For me if I realistically had a chance to progress up the top 20 list maybe that would have given me more incentive to race? Again I am not saying a list makes me want to race it just makes it slightly more interesting if you are gong up the list.\n  <br> \n  <br> Now I have rebuilt my engine over the winter with a race only cam and other bits so I only have to go a fraction quicker to get in the top 20 which I am hoping to have a go at sometime soon. \n  <br> \n  <br> I also get the point its exclusive and it should be hard to get in the top 20 so with this in mind maybe yes we should just leave alone and don’t try and fix something that is not broken.\n  <br> \n  <br> I was just kinda thinking aloud and sharing my thoughts \n  <br> \n  <br> \n  <img class=\"smilies\" src=\"./images/smilies/icon_biggrin.gif\" width=\"15\" height=\"15\" alt=\":D\" title=\"Big Grin\">\n </div>\n</blockquote> \n<br> It's all about having that advantage of being the fastest I guess. \n<br> \n<br> I know what you mean about some being way faster than the rest! I went up against pascal at action last year and knowing he was easily the quickest there I knew I had no chance but I gave it my all that run and although he beat me (be it with a non road legal full on drag bus against my road legal bus) I actually got a PB \n<img class=\"smilies\" src=\"./images/smilies/icon_smile.gif\" width=\"15\" height=\"15\" alt=\":)\" title=\"Grin\"> \n<br> \n<br> Jarv, Frank and pascal actually gave me the idea of adding NOS which I'm in the process of doing now.\n<br> \n<br> If you can't beat em join em \n<img class=\"smilies\" src=\"./images/smilies/icon_smile.gif\" width=\"15\" height=\"15\" alt=\":)\" title=\"Grin\">",
    "lastEdited" : "Fri May 03, 2013 4:10 pm"
  }, {
    "postId" : "720525",
    "author" : {
      "username" : "gazmate",
      "userId" : "720525",
      "joined" : "Sat Jul 29, 2006 3:57 pm",
      "profileRank" : "Registered user",
      "location" : "hastings england",
      "postCount" : "462",
      "avatarPath" : null
    },
    "content" : "<blockquote>\n <div>\n  <cite>tufty65 wrote:</cite>If you can't beat em join em \n  <img class=\"smilies\" src=\"./images/smilies/icon_smile.gif\" width=\"15\" height=\"15\" alt=\":)\" title=\"Grin\">\n </div>\n</blockquote> the thought has crossed my mind more than once.............\n<br> \n<br> ru going down the \"Wizards of NOS\" route?",
    "lastEdited" : "Fri May 03, 2013 9:39 pm"
  }, {
    "postId" : "720609",
    "author" : {
      "username" : "tufty65",
      "userId" : "720609",
      "joined" : "Tue Oct 04, 2005 7:37 pm",
      "profileRank" : "Registered user",
      "location" : "Taunton, cider capital",
      "postCount" : "1408",
      "avatarPath" : null
    },
    "content" : "<blockquote>\n <div>\n  <cite>gazmate wrote:</cite>\n  <blockquote>\n   <div>\n    <cite>tufty65 wrote:</cite>If you can't beat em join em \n    <img class=\"smilies\" src=\"./images/smilies/icon_smile.gif\" width=\"15\" height=\"15\" alt=\":)\" title=\"Grin\">\n   </div>\n  </blockquote> the thought has crossed my mind more than once.............\n  <br> \n  <br> ru going down the \"Wizards of NOS\" route?\n </div>\n</blockquote> \n<br> I'm fitting his controller and pulsoids but keeping all the Holley braided lines and bottle as it looks nice.\n<br> I don't like the look of the won plastic lines especially in an air cooled engine bay.",
    "lastEdited" : "Sat May 04, 2013 9:40 pm"
  } ]
}