{
  "forumId" : "28",
  "threadId" : "102050",
  "title" : "Extra cooling on a turbo engine",
  "originalUrl" : "https://ssvc.org.uk/phpbb/viewtopic.php?f=28&t=102050",
  "breadcrumbs" : [ {
    "url" : "./viewforum.php?f=28&sid=7f95d72bd374baade05236ab72405530",
    "label" : "BWA"
  } ],
  "totalPosts" : 6,
  "pageNumber" : 1,
  "totalPages" : 1,
  "posts" : [ {
    "postId" : "778655",
    "author" : {
      "username" : "so rude",
      "userId" : "778655",
      "joined" : "Mon Apr 25, 2011 12:56 pm",
      "profileRank" : "Registered user",
      "location" : "-",
      "postCount" : "7",
      "avatarPath" : null
    },
    "content" : "Hi\n<br> \n<br> So I've just about finished my turbo dual cab 1965 bus.\n<br> \n<br> It's a 2276 EFI turbo engine pulling 267hp at the fly. A few teething problems but I'm just about there.\n<br> \n<br> Cooling wise it has an external oil cooler and and water/air cooler for the turbo.\n<br> \n<br> The daily temp here in Australia is heigh and I'm having a few small running issues so I have a few questions:\n<br> \n<br> I've read that people have been cutting holes behind their number plates to try and get more air flow. I've done a few searches but can't find much info on this, does it work? I'd also though about putting vents in the engine hatch, would this be a good idea?\n<br> \n<br> What about vents above the engine in the tray of the bus?\n<br> \n<br> I want to stay away from scoops!\n<br> \n<br> Have people put in dual external oil coolers?\n<br> \n<br> It's a massive motor in a small space so I think I need to let more air in.\n<br> \n<br> Sorry for the quality of the photo.\n<br> \n<br> \n<img src=\"http://i1216.photobucket.com/albums/dd367/sorudevw/Marble%20Bar/DC/dd0a7620003a0b50d6c63fc7fa36ec7b_zps0e042bb0.jpg\" class=\"postimage\" alt=\"Image\">\n<br> \n<br> Scott",
    "lastEdited" : "Sun Apr 06, 2014 2:11 am"
  }, {
    "postId" : "778660",
    "author" : {
      "username" : "bushi",
      "userId" : "778660",
      "joined" : "Wed Feb 03, 2010 8:07 pm",
      "profileRank" : "SSVC Member",
      "location" : "Budapest, Hungary",
      "postCount" : "775",
      "avatarPath" : null
    },
    "content" : "for the oil cooler part of it I'm just putting in a 2270 / 165 HP non-turpo type4 engine and will use the concept racing oil cooler that's complete with a spal fan which is a multipass oil cooler to be mounted under bus complete with an air scoop to help force air through the core and a spal fan to draw air through the core when required. check it here: \n<a href=\"http://www.conceptracing.co.uk/online-shop-volkswagen/\" class=\"postlink\">http://www.conceptracing.co.uk/online-shop-volkswagen/</a>\n<br> or on their facebook page: \n<a href=\"https://www.facebook.com/conceptracing/photos/a.210135165732612.52420.146457758767020/619685248110933/?type=1&amp;theater\" class=\"postlink\">https://www.facebook.com/conceptracing/ ... =1&amp;theater</a>\n<br> \n<br> \n<img src=\"http://www.conceptracing.co.uk/wp-content/uploads/2012/02/DSCN3591-425x425.jpg\" class=\"postimage\" alt=\"Image\">\n<br> \n<br> all I can say is that it is amazing quality\n<br> \n<br> bushi",
    "lastEdited" : "Sun Apr 06, 2014 4:37 am"
  }, {
    "postId" : "778661",
    "author" : {
      "username" : "so rude",
      "userId" : "778661",
      "joined" : "Mon Apr 25, 2011 12:56 pm",
      "profileRank" : "Registered user",
      "location" : "-",
      "postCount" : "7",
      "avatarPath" : null
    },
    "content" : "I have one of the empi 96 plate coolers on at the moment, that one looks so much better!",
    "lastEdited" : "Sun Apr 06, 2014 5:37 am"
  }, {
    "postId" : "778662",
    "author" : {
      "username" : "so rude",
      "userId" : "778662",
      "joined" : "Mon Apr 25, 2011 12:56 pm",
      "profileRank" : "Registered user",
      "location" : "-",
      "postCount" : "7",
      "avatarPath" : null
    },
    "content" : "Anyone use a turbo jacket and thermal wrap?",
    "lastEdited" : "Sun Apr 06, 2014 5:37 am"
  }, {
    "postId" : "779382",
    "author" : {
      "username" : "tufty65",
      "userId" : "779382",
      "joined" : "Tue Oct 04, 2005 7:37 pm",
      "profileRank" : "Registered user",
      "location" : "Taunton, cider capital",
      "postCount" : "1408",
      "avatarPath" : null
    },
    "content" : "I'm not too sure about opening up the engine bay by cutting holes in the deck lid etc but it has been done. \n<br> I run super flo heads which run hotter than most so have scoops on the intakes. I also have an external oil cooler which helps. \n<br> Like you I have the chargecooler in the engine bay.\n<br> \n<br> A turbo blanket must be a good idea and I'm thinking dual oil coolers in line would be another good idea for you I'm sure.\n<br> \n<br> I have my air filter like yours but would also like to place the air filter outside of the engine bay to draw air in from outside instead of drawing warmer air from the engine bay (especially in traffic) but I cannot come to a solution without cutting away part of the lower inner wing area.",
    "lastEdited" : "Thu Apr 10, 2014 10:13 pm"
  }, {
    "postId" : "779466",
    "author" : {
      "username" : "vwJim",
      "userId" : "779466",
      "joined" : "Thu Apr 24, 2003 6:05 pm",
      "profileRank" : "SSVC Committee Member",
      "location" : "under a bus in Hampshire...",
      "postCount" : "20146",
      "avatarPath" : "./download/file.php%3Favatar=124_1300829071.jpg"
    },
    "content" : "I've got the air intake under the bus (under the battery tray) so all the air in the engine bay is for the cooling fan and none for the engine induction.\n<br> \n<br> Have you measured any intake air temps relative to ambient temps? Biggest worry I'd have in hot conditions is IF your charge cooler can't keep the inlet temps down. Mine even on high loads only raises a few degrees over ambient so I was super happy with that.\n<br> \n<br> Have a good sized rad' on the charge cooler circuit, with fan attached will help that. My fan and pump is connected to a heat switch, so if the engine gets over 180f (oil) the fan on both the oil cooler and the charge cooler rad' come on, and stay on when the engine is turned off.\n<br> \n<br> So if you've you've been pushing it, then pull in for fuel, the pump and fans still run on, this helps prevent heat soak in the induction system / heads, then when you re-start the bearings get a nice burst of \"chilled\" oil and the heads don't get hit with elevated air temps.\n<br> \n<br> If I pull in for fuel at 180f, within a mile or two of driving away again the temps have dropped 10+degrees.\n<br> \n<br> On yours, I'd duct air from under the chassis into the engine bay. I've seen that done, and owners have reported big temp' drops as the engine is force feed air when at speed, rather than rely on the fan sucking it in through side vents. It must make the fan more efficient and increase air flow over the barrels / heads etc.",
    "lastEdited" : "Fri Apr 11, 2014 4:52 pm"
  } ]
}