{
  "forumId" : "33",
  "threadId" : "103265",
  "title" : "Delivery companies DPD DUMP PARCEL DISAPPEAR",
  "originalUrl" : "https://ssvc.org.uk/phpbb/viewtopic.php?f=33&t=103265",
  "breadcrumbs" : [ ],
  "totalPosts" : 1,
  "pageNumber" : 1,
  "totalPages" : 1,
  "posts" : [ {
    "postId" : "786465",
    "author" : {
      "username" : "type21f",
      "userId" : "Unknown",
      "joined" : "-",
      "profileRank" : "-",
      "location" : "-",
      "postCount" : "-",
      "avatarPath" : "http://i6.photobucket.com/albums/y226/phish1070/anime.gif"
    },
    "content" : "Yet another useless delivery experience.....\n<br>Replacement request to VWH seems to have resulted in an unsolicited, unexpected communication from \n<span style=\"font-size: 200%; line-height: normal\">D ump P arcel D isappear</span> that they have a delivery for me...\n<br>\n<br>Item from VWH? I think...OOOOH that must be my...replacement part....\n<br>Delivery information says coming to me...\n<br>I do not want it delivering there....want It delivering to my restorer so he can take off the defective part and MOT my bus..\n<br>\n<br>\n<span style=\"font-size: 200%; line-height: normal\">DO NOT EXPECT IF YOU ASK FOR PARCEL TO BE DELIVERED TO ANOTHER ADDRESS THEY WILL COMPLY DESPITE SAYING MY REQUEST HAS BEEN ACCEPTED</span>\n<br>\n<br>Despite saying my request has been accepted....they still try to deliver it to my home and when I am not in and then leave it with a neighbour who has dimentia and will forget it was ever delivered to him, by the time I ask him he will have forgotten he received it and probably where he has put it!\n<br>\n<span style=\"font-size: 200%; line-height: normal\">DUMP PARCEL &amp; DISAPPEAR</span>\n<br>\n<br>When you complain and ask for it to be collected from the wrong address and to be delivered where I requested..\n<br>\n<br>\"SORRY WE DO NOT HAVE A CONTRACT WITH YOU\"\n<br>\n<br>I hate these delivery companies witha Passion!\n<br>***ty LINKS deliver thins to neighbours and leave no cards\n<br>Business Post dump parcels at other address and leave no card and say It's your job to ask your neighbours\n<br>DPD say they have received your instruction and then ignore it..\n<br>\n<br>\n<span style=\"font-size: 200%; line-height: normal\">I HATE DELIVERY COMPANIES who do this<br>I am fast running out of faith in any of them</span>",
    "lastEdited" : "Tue May 27, 2014 12:23 pm"
  } ]
}