{
  "forumId" : "4",
  "threadId" : "61151",
  "title" : "CLASSIFIED SECTION - ALL ADVERTS REQUIRE A PRICE",
  "originalUrl" : "https://ssvc.org.uk/phpbb/viewtopic.php?f=4&t=61151",
  "breadcrumbs" : [ {
    "url" : "./viewforum.php?f=4&sid=eb2816c4a0dab41f77887327eaca7563",
    "label" : "Bus Parts For Sale"
  } ],
  "totalPosts" : 1,
  "pageNumber" : 1,
  "totalPages" : 1,
  "posts" : [ {
    "postId" : "472055",
    "author" : {
      "username" : "paneldave",
      "userId" : "472055",
      "joined" : "Fri Mar 04, 2005 7:39 am",
      "profileRank" : "Registered user",
      "location" : "north west wales",
      "postCount" : "2676",
      "avatarPath" : "./download/file.php%3Favatar=1252_1295716958.jpg"
    },
    "content" : "please read the following for sale guidlines.\n<br>\n<br>firstly absolutly no \"offers\"! a price followed by \"or offers\" is acceptable.\n<br>(if your unsure of an asking price then post up with an ono \"or nearest offer\"\n<br>\n<br>location is a must!!!\n<br>\n<br>links to ebay are just as bad as posts not having prices on and are just plain frustrating\n<br>\n<br>_________dibs____________________\n<br>\n<br> \"dibs\" on the ssvc for sale forum goes like so,\n<br>\n<br>1, if you would like to purchase somthing on the forum then its \"first dibs\"!!! following up with a pm to sort payment details.\n<br>(this is clear to the seller that you are intending to purchase the item)\n<br>\n<br>2,if you would like some more info on the item then either post up the question and pm them.\n<br>\n<br>3, \"first dibs\" (thus securing the item) and then asking for pics or further information is frowned upon!!\n<br>\n<br>frowned upon also is negative or non contributary commenting on a for sale thread!!!!\n<br>\n<br>if you`ve multiple items then its often a good idea to merge them all together in a single thread.\n<br>\n<br>please note that if a seller advertises his goods elsewhere then there is a chance it might sell elsewhere!!!!\n<br>likewise the seller has the right to sell to whom he wishes!\n<br>\n<br>goods sell frequently by pm (its fact of life, it happens!!)\n<br>dont forget the seller has his own perogative who he sells to (again a fact of life)\n<br>if a mod pm`s you and asks you to price the item and you dont it will be deleted/or locked.\n<br>\n<br>ambiguity is also a fact and it rears its ugly head only to often so these simple guidlines are in place to make the section a friendlier place",
    "lastEdited" : "Mon Nov 23, 2009 8:40 pm"
  } ]
}