{
  "forumId" : "42",
  "threadId" : "125005",
  "title" : "Potential New Ownership",
  "originalUrl" : "https://ssvc.org.uk/phpbb/viewtopic.php?f=42&t=125005",
  "breadcrumbs" : [ {
    "url" : "./viewforum.php?f=42&sid=f1aa4995578a8a0a5c8d530a51f4a403",
    "label" : "Split Screens Seen"
  } ],
  "totalPosts" : 3,
  "pageNumber" : 1,
  "totalPages" : 1,
  "posts" : [ {
    "postId" : "931500",
    "author" : {
      "username" : "James13009",
      "userId" : "931500",
      "joined" : "Wed Jul 29, 2020 12:30 pm",
      "profileRank" : "Registered user",
      "location" : "-",
      "postCount" : "2",
      "avatarPath" : null
    },
    "content" : "I am wanting to own my first splitscreen. I've test driven one and unsurprisingly the brakes and the steering do not provide confidence. Nor do the reports on constant breakdowns. However I understand owning one is a life style choice and I've converted campers and built my own kit cars in the past so not afraid to get my hand dirty. I would look forward to this. \n<br> \n<br> However the breakdown aspect is holding me back. Sitting at the side of the road specifically. I planned to buy a solid bus and aim to spend £10,000 to make it more pleseant and reliable to drive (although I appreciate this a open to interpretation). Rack and Pinon steering, disc brake new master cylinder springs to mind. \n<br> \n<br> I only intend to use it a few times a year after which it will be parked in a garage. \n<br> \n<br> My question is it really possible to throw money at these busses to get the reliable. Is there a reasonable (aka I don't mean a subaru conversion) solution for the majority of the problems?",
    "lastEdited" : "Sat Aug 01, 2020 10:38 am"
  }, {
    "postId" : "931502",
    "author" : {
      "username" : "Dougie",
      "userId" : "931502",
      "joined" : "Tue Feb 21, 2006 8:31 am",
      "profileRank" : "SSVC Committee Member",
      "location" : "Redditch",
      "postCount" : "921",
      "avatarPath" : "./download/file.php%3Favatar=2106_1498983016.jpg"
    },
    "content" : "Constant breakdowns? Look after it properly and it will serve you very well. I've had mine on the road for 13 years and broken down twice, dead battery once, points gap closed the second time. The other I've had 6 years and never broken down. \n<br> I would highly recommend a servo and drums instead of discs but that's just personal opinion.\n<br> You don't have to throw money at it, regular maintenance is your best bet.",
    "lastEdited" : "Sat Aug 01, 2020 1:19 pm"
  }, {
    "postId" : "931505",
    "author" : {
      "username" : "james309",
      "userId" : "931505",
      "joined" : "Sun Nov 10, 2013 10:10 pm",
      "profileRank" : "SSVC Member",
      "location" : "Gloucestershire",
      "postCount" : "610",
      "avatarPath" : "./download/file.php%3Favatar=38673_1541889555.jpg"
    },
    "content" : "As above, I've driven all over europe and never broken down once ! Maintenance and being considerate to an older vehicle goes a long way. \n<br> \n<br> Personally i would also stick with drums &amp; a servo - no need for more IMO.\n<br> \n<br> \n<br> \n<br> Sent from my SM-G973F using Tapatalk\n<br> \n<br>",
    "lastEdited" : "Sat Aug 01, 2020 6:42 pm"
  } ]
}