{
  "forumId" : "46",
  "threadId" : "107615",
  "title" : "Torvette Help Please",
  "originalUrl" : "https://ssvc.org.uk/phpbb/viewtopic.php?f=46&t=107615&start=30",
  "breadcrumbs" : [ ],
  "totalPosts" : 63,
  "pageNumber" : 3,
  "totalPages" : 5,
  "posts" : [ {
    "postId" : "815786",
    "author" : {
      "username" : "barndoorz",
      "userId" : "815786",
      "joined" : "Fri Feb 13, 2009 5:13 am",
      "profileRank" : "Registered user",
      "location" : "New Zealand",
      "postCount" : "93",
      "avatarPath" : null
    },
    "content" : "<blockquote>\n <div>\n  <cite>TractionMan wrote:</cite>\n  <br>I hope they help.\n  <br>\n  <br>\n  <img src=\"https://www.dropbox.com/s/fhtt9mbkirkim0j/DSC00494.jpg?raw=1\" class=\"postimage\" alt=\"Image\">\n  <br>\n </div>\n</blockquote>\n<br>\n<br>Perfect, especially this one!!\n<br>\n<br>Just awesome, this is the first time I have seen a Torvette interior set up so complete. It is the finer details of how the cabinets mount that I am keen for more info on.\n<br>The last four photos showing how the floor cabinets fit to the bulkhead are just what I was after, never seen this before!!!\n<br>A huge thank you for posting these.\n<br>\n<br>And that floor!!!!",
    "lastEdited" : "Tue Jan 06, 2015 7:52 pm"
  }, {
    "postId" : "816088",
    "author" : {
      "username" : "barndoorz",
      "userId" : "816088",
      "joined" : "Fri Feb 13, 2009 5:13 am",
      "profileRank" : "Registered user",
      "location" : "New Zealand",
      "postCount" : "93",
      "avatarPath" : null
    },
    "content" : "Neil (TractionMan)\n<br>\n<br>A couple of questions for you .......... I was just looking closer at the stove, it looks as though it sits in a sheet metal 'frame', I have the same stove but not this piece. How does the stove attach to this, does it just sit in there or is it on some sort of hinge/swivel system?\n<br>For the stove to sit back against side in closed position, is it sitting in flush mount brackets?\n<br>\n<br>The other query I have is regarding the floor furniture and how the backs mount to the bulkhead, would love to see more detailed photos of this area, I am pretty sure I have all these pieces, (need to drag it out of storage to confirm). In particular the piece along the bottom of the spare wheel well in bulkhead, how is this fixed?\n<br>\n<br>Also, in the first photo of the series of photos you posted, it shows the cushions attached in place with push/snap clips, the bottom cushion the clip looks as though it is sewn to a black strip attached to the cushion? \n<br>\n<br>I have seen a Duracour cover that I think clips in to cover the area behind these floor cabinets, from memory the water containers were behind them, the photo I am thinking of is in David Eccles book, Pg57? \n<br>\n<br>Sean looks like he may have this piece? \n<img src=\"http://i471.photobucket.com/albums/rr80/Tsunamivw/IMG_1814_zps8b43dbfe.jpg\" class=\"postimage\" alt=\"Image\">\n<br>Cheers",
    "lastEdited" : "Fri Jan 09, 2015 4:13 am"
  }, {
    "postId" : "816089",
    "author" : {
      "username" : "type21f",
      "userId" : "816089",
      "joined" : "Tue May 29, 2007 12:55 pm",
      "profileRank" : "SSVC Member",
      "location" : "West Midlands",
      "postCount" : "7409",
      "avatarPath" : "http://i6.photobucket.com/albums/y226/phish1070/anime.gif"
    },
    "content" : "Indeed I was very interested in the cooker mount. Not seen that before on any other bus.\n<br>I also noticed the poppers on the edge of the buddy seat and the division panel. I was gong to say these were I believe originally there to hold the triangular cover but did not want to mislead at this stage. This IS the cover piece I have only ever seen on one other picture as you say from David Eccles\n<br> G",
    "lastEdited" : "Fri Jan 09, 2015 5:22 am"
  }, {
    "postId" : "816090",
    "author" : {
      "username" : "barndoorz",
      "userId" : "816090",
      "joined" : "Fri Feb 13, 2009 5:13 am",
      "profileRank" : "Registered user",
      "location" : "New Zealand",
      "postCount" : "93",
      "avatarPath" : null
    },
    "content" : "<blockquote>\n <div>\n  <cite>type21f wrote:</cite>Indeed I was very interested in the cooker mount. Not seen that. \n  <br>I also noticed the poppers on the edge of the buddy seat and the division panel. I was gong to say this but did not want to mislead at this stage. This IS the cover piece I have seen on one other picture.\n  <br> G\n </div>\n</blockquote>\n<br>\n<br>Thanks Graeme, there is so much awesome detail in those photos, I keep going back to them and seeing something new each time.",
    "lastEdited" : "Fri Jan 09, 2015 6:27 am"
  }, {
    "postId" : "816104",
    "author" : {
      "username" : "TractionMan",
      "userId" : "816104",
      "joined" : "Sun Sep 11, 2011 10:36 am",
      "profileRank" : "Registered user",
      "location" : "South West",
      "postCount" : "17",
      "avatarPath" : null
    },
    "content" : "First the stove:\n<br>\n<br>The complete panel behind the stove is sheet metal. On that panel is a tray that the stove sits in when folder up and a hinged lid that clips to the top of the stove to secure it when stowed. There are two clips mounted to the panel (near the top of the tray) that attach to the back of the stove when in use. To setup the stove, you unclip the hinged lid and lift up to fold flat over the window, lift the stove out of the tray, rotate and lower the stove onto the clips which mate with brackets on the back of the stove. The base of the cooker sits on the edge of the tray.\n<br>\n<br>\n<img src=\"https://www.dropbox.com/s/j6jnr7uia28zlgu/torvette%20stove%20back.jpg?raw=1\" class=\"postimage\" alt=\"Image\">",
    "lastEdited" : "Fri Jan 09, 2015 10:56 am"
  }, {
    "postId" : "816105",
    "author" : {
      "username" : "TractionMan",
      "userId" : "816105",
      "joined" : "Sun Sep 11, 2011 10:36 am",
      "profileRank" : "Registered user",
      "location" : "South West",
      "postCount" : "17",
      "avatarPath" : null
    },
    "content" : "The four cushions against the bulkhead have a little black piece of webbing with a push/snap clip attached. The clip either attaches to a clip on the furniture or the clip on the adjoining cushion. I don't know if these are original, my feeling is they were added at a later date. They do stop them falling about while driving.\n<br>\n<br>I do have the holes on the side of the bulkhead seat and underside of the bulkhead cupboard where the clips were originally mounted for the cover piece to attach. Maybe they were reused to make the cushion straps. I don't have the cover piece.\n<br>\n<br>Going back to an earlier question from Graeme about legs. Unfortunately I only have a single table leg.\n<br>\n<br>I'll do a bit of investigation re the mounting of the bulkhead seats.",
    "lastEdited" : "Fri Jan 09, 2015 11:14 am"
  }, {
    "postId" : "816113",
    "author" : {
      "username" : "maddison",
      "userId" : "816113",
      "joined" : "Fri Feb 01, 2008 1:56 pm",
      "profileRank" : "SSVC Member",
      "location" : "up norf",
      "postCount" : "5103",
      "avatarPath" : "./download/file.php%3Favatar=15870_1360143264.png"
    },
    "content" : "<blockquote>\n <div>\n  <cite>tsunamivw wrote:</cite>Hi G\n  <br>\n  <br>There are only two curtains and they may be up for grabs? if you're interested \n  <img class=\"smilies\" src=\"./images/smilies/icon_smile.gif\" alt=\":)\" title=\"Grin\"> I have four short (maybe 6 inch) and four long legs, I appear to have two of the sliding piece seat top bits with one having an attached speaker in the same cloth and on with a water pump, really confusing\n  <br>\n  <br>Cheers\n  <br>\n  <br>Sean\n </div>\n</blockquote>\n<br>\n<br>\n<br>Hi sean - Give me a shout if you decide not to keep the curtains and no-one else is in front….i'm gonna see how long it takes to collect a full set…hahaha",
    "lastEdited" : "Fri Jan 09, 2015 1:16 pm"
  }, {
    "postId" : "816230",
    "author" : {
      "username" : "type21f",
      "userId" : "816230",
      "joined" : "Tue May 29, 2007 12:55 pm",
      "profileRank" : "SSVC Member",
      "location" : "West Midlands",
      "postCount" : "7409",
      "avatarPath" : "http://i6.photobucket.com/albums/y226/phish1070/anime.gif"
    },
    "content" : "There is always someone in front of you Maddy. .I graciously allowed you the Devon Car tent...\n<br>I have one but I think mine is labelled a Devon Tent and I reckon looks to be smaller than yours.\n<br>I digress . \n<br>If the curtains are for sale I would like a chance.\n<br>I did want to see if I could get a quote to have some material woven..\n<br>So wanted some of this colourway.\n<br>Does anyone have a copy of the 1964 Interior materials and fabrics? \n<br>I only have one from 1967...\n<br>LoL",
    "lastEdited" : "Sat Jan 10, 2015 8:29 am"
  }, {
    "postId" : "816235",
    "author" : {
      "username" : "type21f",
      "userId" : "816235",
      "joined" : "Tue May 29, 2007 12:55 pm",
      "profileRank" : "SSVC Member",
      "location" : "West Midlands",
      "postCount" : "7409",
      "avatarPath" : "http://i6.photobucket.com/albums/y226/phish1070/anime.gif"
    },
    "content" : "Just re read from start to finish and with everyone's permission I will be downloading all the photos into my file. It is the detail you learn from such photos.\n<br>I believe the wooden strips on the bulkhead were held by screws through from the other side.\n<br>When looking at other bare Devon buses to try to help identify the origin I have been able to match holes for example to tall Devon cupboards.\n<br>Most of the Devon cupboards had a curved infill piece which sat tight against the inside of the B post. This infill had a letter box slot cut in it to allow the check strap to go through and engage on the pin. You can fit the pin from inside the tall cupboard.\n<br>So I always look at the inside of the B post.\n<br>VW fitted a very small fingers spur tab behind the lower door hinge on the inside to brace the panel and stop the opening and closing bending the B post.\n<br>Devon removed it and slotted their curved infill panel and cupboard in place tight against the inside. This had a caulk seal and was held by three black Japanned dome headed screws through from the seal channel in the B post.\n<br>So no bracket...three screw holes equals probably a Caravette. Plus the awning rail and M code...No seats in the rear etc.\n<br>But with a bracket....now what model was this...\n<br>The cooker mount is interesting. I expected there to be flushmount fittings to hang the cooker on it but thought they might be on the side panel.\n<br>Also I am fascinated by the orange gas pipe run from the rear....I expected a gas tap by the easicool and solid piping inside to that..\n<br>Does the cooker frame also have leg plates on the bottom of it to allow the cooker to be stood outside?\n<br>Are there any flushmount fittings on the door panels so you could use it on the open door?\n<br>Also I was surprised at the short cut off legs. I have one/ two from a Bay I think but think they may be slightly longer.\n<br>I thought someone had butchered mine because they have no feet. I was disappointed but now understand. \n<br>Looks like someone took a saw to a standard leg after the bus was in use. Now I recognise Devon craftsman ship...\n<br>Maybe they just sawed ones they had in two!\n<br>I have seen a perfectly formed short leg on a Moortown conversion. Just one in Terry clip mount with a foot. Used to hold the lid of the cooker cupboard horizontal for the cooker to sit on.\n<br>So much detail from just one new source.\n<br>I love the flintstone flooring too. Will be refitting in Peebles.",
    "lastEdited" : "Sat Jan 10, 2015 9:24 am"
  }, {
    "postId" : "816281",
    "author" : {
      "username" : "tsunamivw",
      "userId" : "816281",
      "joined" : "Sun Sep 16, 2012 10:11 am",
      "profileRank" : "SSVC Member",
      "location" : "Lancashire",
      "postCount" : "256",
      "avatarPath" : "./download/file.php%3Favatar=37028_1351876392.jpg"
    },
    "content" : "Right you Devon detectives now starts the challenge \n<img class=\"smilies\" src=\"./images/smilies/icon_smile.gif\" alt=\":)\" title=\"Grin\"> I can figure out some bits but others are leaving me completely lost so I'll put up pic by pic questions if thats ok? On the curtains they are no use to me, approximately 31 x 18 inches and seem structural sound, I'd rather trade inside the club than sell so watch this space. \n<br>\n<br>1st Pic I think this is fairly straightforward, 2 rear cupboards and a top cupboard all seem intact\n<br>\n<br>\n<a href=\"http://s471.photobucket.com/user/Tsunamivw/media/2015-01-10141344_zps8e970dfe.jpg.html\" class=\"postlink\"><img src=\"http://i471.photobucket.com/albums/rr80/Tsunamivw/2015-01-10141344_zps8e970dfe.jpg\" class=\"postimage\" alt=\"Image\"></a>\n<br>\n<br>2nd pic Again I'm reasonable happy with this one, a rear seat back support base and kick panel, I'm assuming the easicool and surround go at the end.\n<br>\n<br>\n<a href=\"http://s471.photobucket.com/user/Tsunamivw/media/2015-01-10142335_zpsa96aff80.jpg.html\" class=\"postlink\"><img src=\"http://i471.photobucket.com/albums/rr80/Tsunamivw/2015-01-10142335_zpsa96aff80.jpg\" class=\"postimage\" alt=\"Image\"></a>\n<br>\n<br>3rd pic - this is more complicated, clearly they're the seat tops/back and they seem to be for a walkthrough rather than a bulkhead, but how would the sliders work? how would the water pump work? and why is there a speaker on the top? I've laid them out in that arrangement as they match colours in the middle.\n<br>\n<br>\n<a href=\"http://s471.photobucket.com/user/Tsunamivw/media/2015-01-10140944_zpse8adbcb0.jpg.html\" class=\"postlink\"><img src=\"http://i471.photobucket.com/albums/rr80/Tsunamivw/2015-01-10140944_zpse8adbcb0.jpg\" class=\"postimage\" alt=\"Image\"></a>\n<br>\n<br>End of part 1 \n<img class=\"smilies\" src=\"./images/smilies/icon_smile.gif\" alt=\":)\" title=\"Grin\">",
    "lastEdited" : "Sat Jan 10, 2015 2:59 pm"
  }, {
    "postId" : "816283",
    "author" : {
      "username" : "tsunamivw",
      "userId" : "816283",
      "joined" : "Sun Sep 16, 2012 10:11 am",
      "profileRank" : "SSVC Member",
      "location" : "Lancashire",
      "postCount" : "256",
      "avatarPath" : "./download/file.php%3Favatar=37028_1351876392.jpg"
    },
    "content" : "Detective questions part 2\n<br>\n<br>Pic 4 - I thought this was part of the walkthrough seats behind the driver but I can't see it, anyone know?\n<br>\n<br>\n<a href=\"http://s471.photobucket.com/user/Tsunamivw/media/2015-01-10141942_zps8bc37034.jpg.html\" class=\"postlink\"><img src=\"http://i471.photobucket.com/albums/rr80/Tsunamivw/2015-01-10141942_zps8bc37034.jpg\" class=\"postimage\" alt=\"Image\"></a>\n<br>\n<br>Pic 5- again I can see this as part of a walkthrough seat but how?\n<br>\n<br>\n<a href=\"http://s471.photobucket.com/user/Tsunamivw/media/2015-01-10142015_zpsf464e265.jpg.html\" class=\"postlink\"><img src=\"http://i471.photobucket.com/albums/rr80/Tsunamivw/2015-01-10142015_zpsf464e265.jpg\" class=\"postimage\" alt=\"Image\"></a>\n<br>\n<br>Pic 7 - Isn't this part of the seat near the door? \n<br>\n<br>\n<a href=\"http://s471.photobucket.com/user/Tsunamivw/media/2015-01-10142011_zpsb07b88d7.jpg.html\" class=\"postlink\"><img src=\"http://i471.photobucket.com/albums/rr80/Tsunamivw/2015-01-10142011_zpsb07b88d7.jpg\" class=\"postimage\" alt=\"Image\"></a>\n<br>\n<br>Pic 8 - Lots of cushions, 6 smaller rectangles, an 'L' shaped one and one with no covering on the bottom plus two longer ones that seem to be the long seat back and base, the rectangles I can see as the walkthrough seat and the bottomless one I assume goes on the cooler cover but what are they all the rest for?\n<br>\n<br>\n<a href=\"http://s471.photobucket.com/user/Tsunamivw/media/2015-01-10143136_zpse5dc7d2e.jpg.html\" class=\"postlink\"><img src=\"http://i471.photobucket.com/albums/rr80/Tsunamivw/2015-01-10143136_zpse5dc7d2e.jpg\" class=\"postimage\" alt=\"Image\"></a>\n<br>\n<br>Cheers all, I'm beginning to think it might be wrong to convert this to LHD \n<img class=\"smilies\" src=\"./images/smilies/icon_sad.gif\" alt=\":(\" title=\"Sad\">",
    "lastEdited" : "Sat Jan 10, 2015 3:07 pm"
  }, {
    "postId" : "816285",
    "author" : {
      "username" : "type21f",
      "userId" : "816285",
      "joined" : "Tue May 29, 2007 12:55 pm",
      "profileRank" : "SSVC Member",
      "location" : "West Midlands",
      "postCount" : "7409",
      "avatarPath" : "http://i6.photobucket.com/albums/y226/phish1070/anime.gif"
    },
    "content" : "Answers - or lack of them!\n<br>\n<br>My answers are based on the fact this was made for a RHD bus and so passenger = NS\n<br>Driver = OS\n<br>\n<br>Picture 1\n<br>RHD as you have it laid out with tall cupboard on passenger side\n<br>The rear cupboards look fine to be restored!\n<br>\n<br>Picture 2\n<br>RHD as you have it laid out\n<br>I would have expected the seat back to have been one piece.. but this looks to have been modfied and cut to have a fixed peice on the driver's side and hinges fitted so that the seat back can be hinged forwards or back wards..\n<br>This may have been to allow the luggage are to be in the bed? or to carry long things?\n<br>The cut looks to be where the top of the slope finishes to the over engine panel.\n<br>This looks like a PO modification?\n<br>\n<br>Picture 3\n<br>I reckon this was a Division long slider doored cupboard.. on the driver RHD side the short piece coming down and the gap is just like a standard Caravette slider. \n<br>Maybe the speaker cupboard was a headrest as well?\n<br>Looks like the drop down pieces were designed to be that depth to retain the cushion?\n<br>\n<br>Picture 4\n<br>Looks to be driver side on a RHD bus along the long side... The short side is against the division is where your radiator is! LOL. The long side is down the long panel of the bus\n<br>I would have expected the flap to have the lip on the front and the hinge to been down the surface wih the fixed bit at the back...But it is fitted with the flap lip pointing to the centre. So the small notch cut out to corrspond to the rib between the division and the long side panel. I believe the large cut out has been made to allow it to sit up against the wheel well. So this one is driver's side i.e OS\n<br>So you will want to swap this round to go on the passenger side in your LHD\n<br>\n<br>Picture 5\n<br>\n<br>Ditto\n<br>The indent is where the wheel well on the division fits\n<br>Is the white top you show a loose panel on the top...so looks like the spec way picture zip have posted in the link...\n<br>\n<br>Picture 6\n<br>MISSING\n<br>\n<br>Picture 7\n<br>\n<br>Does look like the one by the RHD door shown in the picture above from tractionman of the seats less the cushions...there are holes on the LH edge of the picture to take the hinges to hold the flap... Also looks to have the popper on the edge..to hold the triangular cover..\n<br>Do you have the flap?\n<br>\n<br>Picture 8\n<br>Cushions \n<br>Each buddy seat a back and a base oblong = 4\n<br>Rear seat a longer back and base =2 \n<br>Over engine area/ luggage area three cushioms and L and two oblongs =3\n<br>The one with the material missing on the bottom would be to go onto the wooden slider over the easicool. I think the wooden top has a fold away metal leg under it but I always believed it slid inside the top of the easicool housing so why a cushion with no bottom = 1 material maybe where the material used for speaker came from?\n<br>\n<br>What sizes are these oblongs and the longer ones please?\n<br>Want to If my cushions are the same sizes..\n<br>\n<br>Total =10?\n<br>\n<br>Maybe take pictures with all sides \n<br>PART 1 all three sides so we can see all aspects and screw holes and lips..\n<br>PART 2 etc.\n<br>PART 3 etc.\n<br>\n<br>This is the BJ1 spaceway RHD WT interior in a LHD bus...shows how the rear seat and the easicool would look.\n<br>\n<!-- l -->\n<a class=\"postlink-local\" href=\"http://www.ssvc.org.uk/phpbb/viewtopic.php?f=51&amp;t=95223&amp;hilit=spaceway\">viewtopic.php?f=51&amp;t=95223&amp;hilit=spaceway</a>\n<!-- l -->\n<br>BJ1 did a thread on converting the buddy seat somehwere...will look for it.. so when you try the seats you can decide..\n<br>I posted pictures of a cooker on a WT division somewhere...looking\n<br>\n<br>here..\n<br>\n<br>\n<!-- l -->\n<a class=\"postlink-local\" href=\"http://www.ssvc.org.uk/phpbb/viewtopic.php?f=46&amp;t=83551&amp;start=30\">viewtopic.php?f=46&amp;t=83551&amp;start=30</a>\n<!-- l --> \n<br>\n<br>At a tangent here is the buddy seat arangement pictures with the cooker on the division\n<br>\n<br>\n<!-- l -->\n<a class=\"postlink-local\" href=\"http://www.ssvc.org.uk/phpbb/viewtopic.php?f=46&amp;t=52668&amp;hilit=buddy\">viewtopic.php?f=46&amp;t=52668&amp;hilit=buddy</a>\n<!-- l -->",
    "lastEdited" : "Sat Jan 10, 2015 4:06 pm"
  }, {
    "postId" : "817413",
    "author" : {
      "username" : "tsunamivw",
      "userId" : "817413",
      "joined" : "Sun Sep 16, 2012 10:11 am",
      "profileRank" : "SSVC Member",
      "location" : "Lancashire",
      "postCount" : "256",
      "avatarPath" : "./download/file.php%3Favatar=37028_1351876392.jpg"
    },
    "content" : "Thanks for the reply, I'm beginning to conclude that I have a collection of Devon stuff as the buddy seat bits don't seen to fit together.\n<br>The rear cupboards and seats make sense but with I have too many bit for the buddy seats or some don't make sense.\n<br>I could reconstruct the rear seat with the easicool and its sliding seat which I think would be cool but I can't see any way to sensibly reconstruct the buddy seats from RHD to LHD \n<img class=\"smilies\" src=\"./images/smilies/icon_sad.gif\" alt=\":(\" title=\"Sad\">\n<br>Does anyone want to trade? Perhaps for some LHD bits? Depending on what you have part or all of the pieces I have are available. Let me know your thoughts \n<br>\n<br>Cheers\n<br>\n<br>Sean",
    "lastEdited" : "Sun Jan 18, 2015 5:05 pm"
  }, {
    "postId" : "817478",
    "author" : {
      "username" : "type21f",
      "userId" : "817478",
      "joined" : "Tue May 29, 2007 12:55 pm",
      "profileRank" : "SSVC Member",
      "location" : "West Midlands",
      "postCount" : "7409",
      "avatarPath" : "http://i6.photobucket.com/albums/y226/phish1070/anime.gif"
    },
    "content" : "Well it is a RHD interior and designed for a RHD bus...\n<br>I only know of a very very few LHD Devons..Rippers has a genuine LHD 63 Devon interior..\n<br>\n<br>To make this work..\n<br>I would do it by stages...\n<br>Looking from the back..\n<br>\n<br>The tall rear cupboard is made for the LHS of the bus and the double cupboard the RHS so I would leave that as is.\n<br>Then I would make a new rear seat back to suit and move the bench seat base over so that the easicool is on the door side.\n<br>\n<br>Then look at the buddy seats so that the bed works... \n<br>\n<br>You couild play with flipping the photos to see what each one would look like!\n<br>\n<br>Like this!\n<br>\n<br>\n<a href=\"http://s619.photobucket.com/user/type21f/media/1967%20Torvette/DSC00494flipped_zps7e96b3db.jpg.html\" class=\"postlink\"><img src=\"http://i619.photobucket.com/albums/tt273/type21f/1967%20Torvette/DSC00494flipped_zps7e96b3db.jpg\" class=\"postimage\" alt=\"Image\"></a>\n<br>\n<br>I can flip them all and post them on the page if you want...LOL",
    "lastEdited" : "Sun Jan 18, 2015 9:12 pm"
  }, {
    "postId" : "817491",
    "author" : {
      "username" : "tsunamivw",
      "userId" : "817491",
      "joined" : "Sun Sep 16, 2012 10:11 am",
      "profileRank" : "SSVC Member",
      "location" : "Lancashire",
      "postCount" : "256",
      "avatarPath" : "./download/file.php%3Favatar=37028_1351876392.jpg"
    },
    "content" : "I get what you mean, nice lateral thinking on the photo flip \n<img class=\"smilies\" src=\"./images/smilies/icon_smile.gif\" alt=\":)\" title=\"Grin\">, but I can't make sense of the walkthrough seats as RHD, I don't think there a coherent set of seats and it looks to me like I'd have to essentially trash them to get them to work LHD if i can figure them out and I'm loath to trash them as there are some good bits.\n<br>\n<br>I agree on the rear cupboards and I think I can recreate the bench seat but the walkthrough bit is beating me",
    "lastEdited" : "Sun Jan 18, 2015 9:50 pm"
  } ]
}