{
  "forumId" : "46",
  "threadId" : "113850",
  "title" : "March 1962 Caravette Crockery Cargo Door Cupboard",
  "originalUrl" : "https://ssvc.org.uk/phpbb/viewtopic.php?f=46&t=113850",
  "breadcrumbs" : [ {
    "url" : "./viewforum.php?f=45&sid=e8d66eb604f59abb4e62e863046cb37c",
    "label" : "Interiors/Conversions"
  }, {
    "url" : "./viewforum.php?f=46&sid=e8d66eb604f59abb4e62e863046cb37c",
    "label" : "Devon"
  } ],
  "totalPosts" : 7,
  "pageNumber" : 1,
  "totalPages" : 1,
  "posts" : [ {
    "postId" : "858314",
    "author" : {
      "username" : "type21f",
      "userId" : "858314",
      "joined" : "Tue May 29, 2007 12:55 pm",
      "profileRank" : "SSVC Member",
      "location" : "West Midlands",
      "postCount" : "10386",
      "avatarPath" : "http://i6.photobucket.com/albums/y226/phish1070/anime.gif"
    },
    "content" : "OK I know these changed over the years...\n<br>Anyone have a photo I could agree with..?\n<br>\n<br>I am enquiring about one to fit this door panel...\n<br>\n<br>\n<img src=\"https://uploads.tapatalk-cdn.com/20151221/830905a7fc76b354b1124bd9bff0fc2f.jpg\" class=\"postimage\" alt=\"Image\">\n<br>\n<br>\n<img src=\"https://uploads.tapatalk-cdn.com/20151222/c51cdf2fc1282c33974219cfed61af96.jpg\" class=\"postimage\" alt=\"Image\">",
    "lastEdited" : "Mon Dec 21, 2015 8:40 pm"
  }, {
    "postId" : "858338",
    "author" : {
      "username" : "clymoj",
      "userId" : "858338",
      "joined" : "Tue Mar 27, 2012 12:10 pm",
      "profileRank" : "Registered user",
      "location" : "London & Birmingham",
      "postCount" : "1124",
      "avatarPath" : "http://i1068.photobucket.com/albums/u451/clymoj/Bus/Bus005_zps44edd617.jpg"
    },
    "content" : "I have one (two) of those cupboards at my house. One is mine, one Steve's (Etiennevert's). I have no door card for it yet, still looking. \n<br>\n<br>I'm at that house on the 23/24th Dec. What do you need?",
    "lastEdited" : "Tue Dec 22, 2015 2:10 am"
  }, {
    "postId" : "858340",
    "author" : {
      "username" : "clymoj",
      "userId" : "858340",
      "joined" : "Tue Mar 27, 2012 12:10 pm",
      "profileRank" : "Registered user",
      "location" : "London & Birmingham",
      "postCount" : "1124",
      "avatarPath" : "http://i1068.photobucket.com/albums/u451/clymoj/Bus/Bus005_zps44edd617.jpg"
    },
    "content" : "Copied from my other reply for reference later:\n<br>\n<br>\n<br>\n<br>There's actually loads of details to them - the curve to fit flush to the door, the metal clips to hold mug handles, the screws and rubber stops that hold the top door flush with its edges when closed (but preserves a gap between it and the door card), the captive hinges to keep the doors at 90 degrees when open, the leather straps to keep the bowls in place, the plastic over foil trim that edges the middle shelf to match the style of the top of the mag rack, the brown small square (?) Formica on the inner shelf and back of doors, the slide catches for the two doors, the aluminium T strip between the doors, the aluminium and rubber trim for the top door... \n<br>\n<br>Later cupboards preserved the overall dimensions but had a wooden 'top' to the frame (instead of the gap where the top door closes). Later still the handles changed to black plastic in line with other cupboard doors. \n<br>\n<br>You know all this I'm sure. I can photo and measure everything you need or you can come round and get what you are after?\n<br>\n<br>\n<br>\n<br>I am still hunting panels don't forget. Did anyone buy Julian MonkeyKnuts' from him in the end? They were a good base I recall, not to his standards but maybe to mine \n<img class=\"smilies\" src=\"./images/smilies/wink.gif\" alt=\";)\" title=\"Wink\">",
    "lastEdited" : "Tue Dec 22, 2015 2:42 am"
  }, {
    "postId" : "858343",
    "author" : {
      "username" : "type21f",
      "userId" : "858343",
      "joined" : "Tue May 29, 2007 12:55 pm",
      "profileRank" : "SSVC Member",
      "location" : "West Midlands",
      "postCount" : "10386",
      "avatarPath" : "http://i6.photobucket.com/albums/y226/phish1070/anime.gif"
    },
    "content" : "Well, I am still collecting and getting parts together for Sherry. I have been collecting interior panels and chrome finishers.\n<br>I have panels from three sets in varying degrees of completeness.\n<br>\n<br>As it happens Sherry had a full microbus set fitted including division panels and drinks tray and decent kick panels. \n<br>\n<br>The second PO covered all of the interior panels with diamond pattern black foam sticky back vinyl. He also used some PVA type glue as well. I have stripped all the black vinyl off these but they are only of use as templates. I have very little OG silver grey vinyl and what there is has the diamond pattern in glue on it.\n<br>I am working on removing this glue.\n<br> He also covered the metal faces and dash tray with 1970s pebble pattern!\n<br>Classy...\n<br>\n<br>Most of these ended up as bare panels (kept as templates) or dusty fragments (fed to the log butner)\n<br>\n<br>I have been following/ stalking \n<img src=\"http://emoji.tapatalk-cdn.com/emoji33.png\"> people who have removed OG panels and if they are renewing bought all I could.\n<br>I actually bought the set from Steve.. etiennevert (from a 1963 (I think) Caravette)...so this one had no division panels or drinks tray. But it did have the rear luggage panels and bits that go round the rear hatch drawers and side bearers and remains of the side lids as templates.\n<br>\n<br>That panel pictured above was his. \n<br>\n<br>I also bought a part set from DoubleD....from a RHD microbus. He started trying to restore but then made replacements.\n<br>\n<br>I have nearly all the panels I need except short side...In varying conditions.\n<br>I am restoring the panels one by one. Takes ages...upwards of three days a panel..\n<br>The silver beige patterned vinyl in the centre of the panels has thick grey lines with a criss cross thin grey narrow line pattern in between.\n<br>Over 50 years of use (wear and cleaning) the faint pattern wears away/ off.\n<br>I restored the Panel set for Peebles and succeeded in flattening and patching and gluing splits and repairing holes by rebuilding missing bits/ corners etc.\n<br>I cleaned the Peebles vinyl with white spirit, upholstery cleaner and washing up liquid and a gentle brushing.\n<br>Cif is a No-No...It takes the surface and the pattern off.\n<br>\n<br>The set from etiennevert has the worn away witness of where the cupboard sat and Double D set is much more evenly all worn away.\n<br>\n<br>DoubleD had started to attempt to reuse the panels and had stripped the basalt grey from the top of several panels but it also stripped the top later off the millboard..so I am searching a suitable grey to reapply.\n<br>Spectrum/ Martrim/ Woollies all have possibles but not quite exact.\n<br>Trouble is each panel fades according to location..\n<br>Peebles had 50 shades of grey...As I found Humbrol only do 32 and I have a tin of each...Some of which were used to refresh worn off corners...scratches gouges splits etc. \n<br>Looks OK...Patina..\n<br>\n<br>So I came to the decision to wash clean both sides of the panel, flatten, clamp and glue/repair splits and reglue and tension the existing vinyl round the back and then patch any holes on the front...and then I am experimenting with redrawing the pale grey line pattern with waterproof fade proof ink.\n<br>Will see how this works out. I have a set of Rotring pens and several brands of grey fineliner..\n<br>I have a very pale full plain panel with a lot of damage and I have the etiennevert panel above. I was convinced the hole was a hack for a speaker....but on examination realised it was for the bowl base.\n<br>\n<br>I then thought about what storage I would get....With the Devonette layout it is very sparse...\n<br>I already have a 1962 tall cupboard with brown faint formica pattern top.which I plan to use as a construction example to get a tall Devonette cloned copy made along the lines of...My 1963 brochure pictures.\n<br>\n<br>This got me to thinking...\n<br>Maybe I should use the panel above and get or get a copy of a 1962 crockery cupboard made. I have sought without success some faint grey pattern formica..\n<br>I have been collecting a set of Rosa China (still incomplete) as used by Devon at this period..\n<br>Mugs were only made as specials I believe....and I have never even seen one...let alone one in Rosa.. I have pictures in Jade and failed to buy a set off fleabay...\n<br>The Devonette came without everything ... So the initial purchaser could buy what he wanted..\n<br>Maybe a crockery cupboard and Rosa China.....LOL\n<br>\n<br>So I am tempted to try to find make a cupboard and wander away from only having the Devonette interior and add the crockery cupboard to hold my china...\n<br>\n<br>I have a man who will make an exact copy for me..\n<br>\n<br>I have one pair of laser cut blanks for the drop down flaps.\n<br>These blanks were from a batch made by a forum member and replicate the plated and assembled set supplied to Bobley.\n<br>Sadly the maker has not been too well.\n<br>Get well soon Paul.\n<br>I now have access to a laser cutter to make some more.\n<br>Slide latches....mmm rocking horse POO..\n<br>Door Stops..I have some passable ones from 1950s kitchen units..\n<br>All collected to repair Peebles..\n<br>I have a spare wash flap with drop down hinges..but this was/is still promised to Boyden..\n<br>\n<br>Have been trying to buy a 1962 crockery cupboard complete..\n<br>Maddy had/has several but all were later I thought..\n<br>\n<br>So still looking..\n<br>Maybe could borrow/ measure/ copy / make or even find..\n<br>\n<br>No rush..\n<br>\n<br>Sherry the ship of Theseus needs a lot more planks replacing before she will sail again..\n<br>Pictures please would be most welcome.\n<br>\n<br>Merry Christmas to all the happy readers of this demented Devon thread...\n<br>\n<br>Anyone have a 1962 Devon Crockery cupboard for sale?\n<br>\n<br>\n<a href=\"http://s619.photobucket.com/user/type21f/media/Devon%20China/Caravetteint4.jpg.html\" class=\"postlink\"><img src=\"http://i619.photobucket.com/albums/tt273/type21f/Devon%20China/Caravetteint4.jpg\" class=\"postimage\" alt=\"Image\"></a>\n<br>\n<br>\n<a href=\"http://s619.photobucket.com/user/type21f/media/Devon%20China/Caravetteint5.jpg.html\" class=\"postlink\"><img src=\"http://i619.photobucket.com/albums/tt273/type21f/Devon%20China/Caravetteint5.jpg\" class=\"postimage\" alt=\"Image\"></a>",
    "lastEdited" : "Tue Dec 22, 2015 5:52 am"
  }, {
    "postId" : "858435",
    "author" : {
      "username" : "clymoj",
      "userId" : "858435",
      "joined" : "Tue Mar 27, 2012 12:10 pm",
      "profileRank" : "Registered user",
      "location" : "London & Birmingham",
      "postCount" : "1124",
      "avatarPath" : "http://i1068.photobucket.com/albums/u451/clymoj/Bus/Bus005_zps44edd617.jpg"
    },
    "content" : "Super detailed as always G. I'm not sure I could match your artistry on the panels; but we'll see what's out there, maybe the only option. \n<br>\n<br>Well you are welcome to borrow my cupboard to measure and copy if an original doesn't show up for you. \n<br>\n<br>It lives in Stourbridge. I live in Derby. I'm sure we could work it out.",
    "lastEdited" : "Wed Dec 23, 2015 4:09 pm"
  }, {
    "postId" : "858438",
    "author" : {
      "username" : "type21f",
      "userId" : "858438",
      "joined" : "Tue May 29, 2007 12:55 pm",
      "profileRank" : "SSVC Member",
      "location" : "West Midlands",
      "postCount" : "10386",
      "avatarPath" : "http://i6.photobucket.com/albums/y226/phish1070/anime.gif"
    },
    "content" : "Strange I did not know you worked in Derby...\n<br>I live North of Birmingham and work in Derby at a major employer....guess who...and travel everyday.... \n<br>\n<br>G",
    "lastEdited" : "Wed Dec 23, 2015 5:15 pm"
  }, {
    "postId" : "858573",
    "author" : {
      "username" : "type21f",
      "userId" : "858573",
      "joined" : "Tue May 29, 2007 12:55 pm",
      "profileRank" : "SSVC Member",
      "location" : "West Midlands",
      "postCount" : "10386",
      "avatarPath" : "http://i6.photobucket.com/albums/y226/phish1070/anime.gif"
    },
    "content" : "Merry Christmas to all the DICS\n<br>From G\n<br>\n<img src=\"https://uploads.tapatalk-cdn.com/20151225/665f03a2c972b651ceb11da3a652e5c6.jpg\" class=\"postimage\" alt=\"Image\">",
    "lastEdited" : "Fri Dec 25, 2015 12:07 pm"
  } ]
}