{
  "forumId" : "48",
  "threadId" : "102200",
  "title" : "any interest in repo canterbury pitt badge/decal",
  "originalUrl" : "https://ssvc.org.uk/phpbb/viewtopic.php?f=48&t=102200",
  "breadcrumbs" : [ ],
  "totalPosts" : 2,
  "pageNumber" : 1,
  "totalPages" : 1,
  "posts" : [ {
    "postId" : "779507",
    "author" : {
      "username" : "e m p i",
      "userId" : "779507",
      "joined" : "Fri Jan 28, 2005 3:51 pm",
      "profileRank" : "Registered user",
      "location" : "Essex but I'm nothing like the twats on the telly.",
      "postCount" : "5129",
      "avatarPath" : "./download/file.php%3Favatar=1186_1407682968.jpg"
    },
    "content" : "I am in the process of getting some Canterbury Pitt badges/decals/plaque professionally made up , the ones that go either on the side of the cooker or on the outside just below the swage line. They will be in the form of a sticker and not the original metal badge but will not be cheap and nasty. They will be in the correct 6cm x 4cm size and correct colour (black and shiny silver). They will also be laminated so they are durable and will not fade if put on the outside of your bus. I am planning to stick mine onto a piece of stainless or ally plate so it resembles the original plaque then bond it to the outside of my bus.\n<br>Obviously it is not cheap to get all this done as i will have to pay for the artwork to be re-done from a photo (cheers funky)so it is of a sufficient standard to be printed onto a sticker.\n<br>I am wondering if there is any interest before i commit to going ahead. I would anticipate that each sticker will cost about £4 each plus postage at cost ie a stamp.\n<br>If intersted please add your name below. If you say you want one please dont back out or i will be left considerably out of pocket.\n<br>\n<br>shalom, Lee",
    "lastEdited" : "Fri Apr 11, 2014 8:53 pm"
  }, {
    "postId" : "779520",
    "author" : {
      "username" : "e m p i",
      "userId" : "779520",
      "joined" : "Fri Jan 28, 2005 3:51 pm",
      "profileRank" : "Registered user",
      "location" : "Essex but I'm nothing like the twats on the telly.",
      "postCount" : "5129",
      "avatarPath" : "./download/file.php%3Favatar=1186_1407682968.jpg"
    },
    "content" : "If interested please reply on the below thread I'm chat. \n<br>\n<br>\n<!-- l -->\n<a class=\"postlink-local\" href=\"http://www.ssvc.org.uk/phpbb/viewtopic.php?f=2&amp;t=102198\">viewtopic.php?f=2&amp;t=102198</a>\n<!-- l -->",
    "lastEdited" : "Fri Apr 11, 2014 9:46 pm"
  } ]
}