{
  "forumId" : "49",
  "threadId" : "89724",
  "title" : "Advice please re complete interior conversion",
  "originalUrl" : "https://ssvc.org.uk/phpbb/viewtopic.php?f=49&t=89724",
  "breadcrumbs" : [ ],
  "totalPosts" : 5,
  "pageNumber" : 1,
  "totalPages" : 1,
  "posts" : [ {
    "postId" : "690903",
    "author" : {
      "username" : "relaxmax",
      "userId" : "690903",
      "joined" : "Fri Jul 06, 2012 4:32 pm",
      "profileRank" : "Registered user",
      "location" : "France",
      "postCount" : "24",
      "avatarPath" : null
    },
    "content" : "After a challenging couple of years (job loss, bereavement &amp; other family worries…) we decided that we needed a little sunshine in our lives… and finally found our 13-window DeLuxe (paid for in part by my redundancy package – naughty !!l). Drove the van home from NW Lancashire to near Paris (I’m British, Mr Relaxmax is French) on a very cold week-end in January this year. \n<br>\n<br>\n<!-- m -->\n<a class=\"postlink\" href=\"https://picasaweb.google.com/lh/photo/MQpSKqFFYUe5HSoYhzdRVtMTjNZETYmyPJy0liipFm0?feat=directlink\">https://picasaweb.google.com/lh/photo/M ... directlink</a>\n<!-- m -->\n<br>\n<br>Spent this year’s budget on bodywork &amp; re-spraying and had 2 weeks away in Périgord during August and then a week in Wye Valley/Hereford region &amp; then 2 nights Busfest…. and a few other mini trips. \n<br>We had only a bed (full size), curtains and nothing else !! (no fridge, no storage, no water….) We managed great with a 1-ring Camping Gaz unit, a set of 2 camping pans, the storage under the bed, a 5-litre waterbottle, 4 Ikea plastic storage boxes with lids for clothes, shoes etc.. a few bottles of wine and just bought food on a daily basis. Luckily the weather was great \n<br>\n<br>This winter’s project is to completely have the interior refitted, so that by next summer we can travel in a little more style! Unfortunately we’re not mechanically-minded and are totally in awe of all of you brilliant restorers out there who work with such passion on your projects. We’re having a bit of a hard time finding best way to go about this and hope some of you out there can offer suggestions. The van will be used mainly during the summer months in France &amp; S &amp; E Europe (but a few trips planned to UK too) – short 2-3 day trips and longer ones, hopefully in good weather areas. There isn’t the level of VW culture in France that there is in UK where there’s a great range of know-how and suppliers. We have 2 options : either drive the van to UK and leave it in the capable hands of (who??) to get it completely fitted out (the option I think we’ll go for OR have stuff delivered from UK and find a French VW specialist who can take on the job (looking into this..) The questions (and there will most likely be more) we have are as follows. Hopefully any answers will be useful to others who are restoring interiors themselves or having it done.\n<br>\n<br>1. Layout: we quite like the Vanwurks package with ¾ bed – seems to be the most efficient in terms of maximum usage of space. But after sleeping in a full-size bed, maybe we’ll find it a little restricting ? However we definitely hope to buy a Khayam awning for extra space\n<br>\n<br>2. We need to have electrics done – could we have this done to UK specs and then use an French adaptor for appliances - how to get round this problem? What do we need to know about electrics and what to avoid? We’ll need ipod/pad dock ! Lighting ?\n<br>\n<br>3. Insulation: what’s the best system for maximum effect – sound deadening and also to avoid and damp?\n<br>\n<br>4. Choice of fridge – how does the fridge function most efficiently ?\n<br>\n<br>5. We need to have the side and door panels upholstered and also headliner – anything we need to know ?\n<br>\n<br>Any other advice we need ? Thanks -- all help gratefully received ",
    "lastEdited" : "Sun Nov 04, 2012 12:53 pm"
  }, {
    "postId" : "691149",
    "author" : {
      "username" : "gregdonohue",
      "userId" : "691149",
      "joined" : "Wed Oct 24, 2012 9:33 am",
      "profileRank" : "Registered user",
      "location" : "-",
      "postCount" : "35",
      "avatarPath" : null
    },
    "content" : "Relaxman , I am also in the same boat as you so I hope you get all our answers.\n<br>good luck .",
    "lastEdited" : "Mon Nov 05, 2012 3:03 pm"
  }, {
    "postId" : "691188",
    "author" : {
      "username" : "relaxmax",
      "userId" : "691188",
      "joined" : "Fri Jul 06, 2012 4:32 pm",
      "profileRank" : "Registered user",
      "location" : "France",
      "postCount" : "24",
      "avatarPath" : null
    },
    "content" : "Well no replies so far, gregdonohue... let's keep fingers crossed. Seem to be many highly keen &amp; talented mechanics on the forum (just don't get their techie lingo )but not much interest in interiors....\n<br>\n<br>Any where are all the ladies on this forum ??? \n<img class=\"smilies\" src=\"./images/smilies/icon_smile.gif\" alt=\":)\" title=\"Grin\"> just sayin'......\n<br>\n<br>relaxmax",
    "lastEdited" : "Mon Nov 05, 2012 5:42 pm"
  }, {
    "postId" : "691195",
    "author" : {
      "username" : "whit",
      "userId" : "691195",
      "joined" : "Mon Aug 09, 2010 4:05 pm",
      "profileRank" : "SSVC Member",
      "location" : "-",
      "postCount" : "820",
      "avatarPath" : null
    },
    "content" : "Devon",
    "lastEdited" : "Mon Nov 05, 2012 6:12 pm"
  }, {
    "postId" : "692668",
    "author" : {
      "username" : "Jenni",
      "userId" : "692668",
      "joined" : "Mon May 24, 2004 3:17 pm",
      "profileRank" : "SSVC Member",
      "location" : "SW Suffolk",
      "postCount" : "1823",
      "avatarPath" : "http://img.photobucket.com/albums/v237/JenniG/dogwalkemoticon.gif"
    },
    "content" : "Hi.\n<br>These interiors forums get less traffic than some of the others. Maybe worth posting in 'VW Related Chat'?",
    "lastEdited" : "Wed Nov 14, 2012 8:59 pm"
  } ]
}