{
  "forumId" : "51",
  "threadId" : "116188",
  "title" : "1967 LHD Splitscreen - £23,500 ONO will consider a PX/swap with a 4 berth T5 to same value",
  "originalUrl" : "https://ssvc.org.uk/phpbb/viewtopic.php?f=51&t=116188",
  "breadcrumbs" : [ ],
  "totalPosts" : 5,
  "pageNumber" : 1,
  "totalPages" : 1,
  "posts" : [ {
    "postId" : "876199",
    "author" : {
      "username" : "Niblett31",
      "userId" : "876199",
      "joined" : "Mon Nov 04, 2013 6:36 pm",
      "profileRank" : "Registered user",
      "location" : "-",
      "postCount" : "22",
      "avatarPath" : null
    },
    "content" : "[b]** Update** \n<br>\n<br>Now all holidays have finished I really need to look for Patsy to be spending the winter months in a nice warm garage rather than under a fancy breathable cover on my drive. She has motored around 800 miles this summer on various camping trips both in the UK and abroad! I didn't have one cough, one splutter or one trip to the hard shoulder - in short she was amazing. We got upto 70 miles an hour in her no problem on the motorway. I have had a lot of interest and a few tyre kickers but I feel that people would prefer for her to look a million dollars rather than be able to drive reliably. Therefore I have listened to feedback and dropped the price in the hope she will go to a loving home soon.\n<br>\n<br>\n<br>Here is our 1967 Splitty that we as a family have grown out of - full mechanical refurb in 2013/14 with Johnson Autoworks and runs like a dream - even after 4 months stationary on the drive. Looking to get a T5 (4 berth) for the family so will happily swap to equal value.\n<br>\n<br>Work required - surface rust bubbles to drivers wheel arch and behind front bumper - not terminal and should sand down easily. Widow seals are water tight but will need work in the future (cosmetic mainly). Cosmetic stuff really as all the following was covered off on the refurb......however please be aware that all buses of this age will need work of some description and upkeep.\n<br>\n<br>\n<!-- m -->\n<a class=\"postlink\" href=\"http://youtu.be/Q-zX3DBz-9M\">http://youtu.be/Q-zX3DBz-9M</a>\n<!-- m --> See footage of my bus in real time on the above link. (copy and paste into google and it will take you there) \n<br>\n<br>Work completed to date - Re-con 1641cc engine from TES Bay Window IRS conversion Re-con 1330 Gear Box Vehicle Lowered onto 1st Spline - can go lower if desired Suspension Overhaul, CV Joints, New Drive Shaft Replacement of rear brakes, lines, shoes Replaced front axle Fitted new brake pipes, brake lines and flexi hoses Dual circuit master cylinder Fitted front discs, callipers, pads, new ball joints 4x new track rods and track rod ends Creative Engineering Steering Rack fitted and lowered to match rear Exhaust (single quiet pack) 2x Heat Exchangers Rear Seat Belts x 2 fitted to EU standards 4x Hub Caps Clutch 75 + Ht Leads and Coil Partial re-wire using bay window loom to upgrade Full Width Rock n Roll Bed 4x Steels 15\" + Tyres Partial body re-spray of lower half Full Waxoyl of under carriage and wheel arches\n<br>\n<br>Included in sale is drive away awning - cab hammock (to be fitted) and table to match interior.\n<br>\n<br>Please call on 07968849667 if interested (and I mean interested) or email me on \n<!-- e -->\n<a href=\"mailto:zoeniblett@hotmail.co.uk\">zoeniblett@hotmail.co.uk</a>\n<!-- e -->",
    "lastEdited" : "Mon Jun 06, 2016 10:08 pm"
  }, {
    "postId" : "881369",
    "author" : {
      "username" : "Niblett31",
      "userId" : "881369",
      "joined" : "Mon Nov 04, 2013 6:36 pm",
      "profileRank" : "Registered user",
      "location" : "-",
      "postCount" : "22",
      "avatarPath" : null
    },
    "content" : "Just updated the spec - open to offers",
    "lastEdited" : "Wed Aug 17, 2016 10:34 am"
  }, {
    "postId" : "881900",
    "author" : {
      "username" : "Martinrab",
      "userId" : "881900",
      "joined" : "Tue Aug 09, 2016 2:49 pm",
      "profileRank" : "Registered user",
      "location" : "-",
      "postCount" : "21",
      "avatarPath" : null
    },
    "content" : "it is still for sale\n<br>I go in uk dice on August 28 to visit, we could meet\n<br>Martin\n<br>Excuse mi for my english i from swizerland",
    "lastEdited" : "Wed Aug 24, 2016 11:44 am"
  }, {
    "postId" : "882330",
    "author" : {
      "username" : "Martinrab",
      "userId" : "882330",
      "joined" : "Tue Aug 09, 2016 2:49 pm",
      "profileRank" : "Registered user",
      "location" : "-",
      "postCount" : "21",
      "avatarPath" : null
    },
    "content" : "I am in Milton Keynes, can come and see \n<!-- e -->\n<a href=\"mailto:m.raboud@bluewin.ch\">m.raboud@bluewin.ch</a>\n<!-- e -->, thank you",
    "lastEdited" : "Tue Aug 30, 2016 3:38 pm"
  }, {
    "postId" : "883451",
    "author" : {
      "username" : "Niblett31",
      "userId" : "883451",
      "joined" : "Mon Nov 04, 2013 6:36 pm",
      "profileRank" : "Registered user",
      "location" : "-",
      "postCount" : "22",
      "avatarPath" : null
    },
    "content" : "Price dropped to enusre a sale before the winter months kick in - would love her to go to a loving home soon. Open to offers but nothing much below what I have advertised please as I am already massively out of pocket on this figure. I have spent so much on the mechanics she really does run like a dream.",
    "lastEdited" : "Tue Sep 13, 2016 12:07 pm"
  } ]
}