{
  "forumId" : "51",
  "threadId" : "116884",
  "title" : "57 OG paint patina'd Pressed Bumper single cab",
  "originalUrl" : "https://ssvc.org.uk/phpbb/viewtopic.php?f=51&t=116884",
  "breadcrumbs" : [ {
    "url" : "./viewforum.php?f=51",
    "label" : "Buses For Sale"
  } ],
  "totalPosts" : 5,
  "pageNumber" : 1,
  "totalPages" : 1,
  "posts" : [ {
    "postId" : "880469",
    "author" : {
      "username" : "squareweave",
      "userId" : "880469",
      "joined" : "Sun Jun 27, 2010 3:41 pm",
      "profileRank" : "Registered user",
      "location" : "-",
      "postCount" : "9",
      "avatarPath" : null
    },
    "content" : "Late 57 Single Cab Very Complete with awesome patina\n<br>\n<br>Here is a very complete late 1957 single cab in all original Dove Blue paint, it has a great fade/patina, a combination only mother nature and time can produce. The last time this bus was plated was 1966. \n<br>\n<br>The body on this bus is ALL original paint and all original parts to the bus. It is NOT assembled of mismatching original paint parts. It has the original paint pressed front and truck only rear bumper and splash pans. It also comes with the 15\" crows feet rims that came with the bus. Its still sport the original and not broken Canadian \"Volkswagen\" logo on the back pass corner, tail lights, silver white og front emblem and the list goes on and on. It also comes with an original set of tilt hoops!! Battery trays are solid. The body is impressive for being unhacked after so many years and has typical bus rust but with just the mechanicals done it would be great driver \"as is\" drawing more interest than shiny restored examples. \n<br>\n<br>The interior is complete and original. Being all original to the bus it has a flat back front seat, clear needle 70mph speedo, grey commercial headliner, sun visor, door and kick panels and original floor mat etc. All glass is matching SEKURIT while the windshields are SIGLA. \n<br>\n<br>Mechanically this bus is untouched and never been messed with. It is a great canvas to go through and not having to deal with many past botched attempts at being \"fixed\" It still has a split case transmission and locked up non original 36hp motor. A perfect candidate to put a driver motor in a mechanical refresh. \n<br>\n<br>All in all I think this beautiful patina'd pressed bumper era single cab is an easy starting point to take to the level you want. The fact that it is complete saves the hidden variables of trying to find those correct and hard to find bits and pieces. \n<br>\n<br> \n<br>\n<br>The reason for the sale is that I have another single cab and don't need two.I would be interested in trading with cash for an original paint Lowlight Ghia \n<br>\n<br>Located in Vancouver BC. I have shipped vehicles to Europe and UK before\n<br>\n<br>Sold\n<br>\n<br>\n<img src=\"http://images.thesamba.com/vw/gallery/pix/1533741.jpg\" class=\"postimage\" alt=\"Image\">\n<br>\n<br>\n<img src=\"http://images.thesamba.com/vw/gallery/pix/1533740.jpg\" class=\"postimage\" alt=\"Image\">",
    "lastEdited" : "Wed Aug 03, 2016 5:34 pm"
  }, {
    "postId" : "880526",
    "author" : {
      "username" : "squareweave",
      "userId" : "880526",
      "joined" : "Sun Jun 27, 2010 3:41 pm",
      "profileRank" : "Registered user",
      "location" : "-",
      "postCount" : "9",
      "avatarPath" : null
    },
    "content" : "Pending",
    "lastEdited" : "Thu Aug 04, 2016 3:40 pm"
  }, {
    "postId" : "881232",
    "author" : {
      "username" : "toby58",
      "userId" : "881232",
      "joined" : "Fri Mar 25, 2016 9:24 am",
      "profileRank" : "Registered user",
      "location" : "-",
      "postCount" : "3",
      "avatarPath" : null
    },
    "content" : "Hi, please can i ask how much you are asking ????",
    "lastEdited" : "Mon Aug 15, 2016 8:41 am"
  }, {
    "postId" : "881732",
    "author" : {
      "username" : "thomasjames1985",
      "userId" : "881732",
      "joined" : "Fri Apr 01, 2016 8:33 pm",
      "profileRank" : "Registered user",
      "location" : "-",
      "postCount" : "4",
      "avatarPath" : null
    },
    "content" : "Hi, is this still available?",
    "lastEdited" : "Sun Aug 21, 2016 11:16 pm"
  }, {
    "postId" : "882485",
    "author" : {
      "username" : "squareweave",
      "userId" : "882485",
      "joined" : "Sun Jun 27, 2010 3:41 pm",
      "profileRank" : "Registered user",
      "location" : "-",
      "postCount" : "9",
      "avatarPath" : null
    },
    "content" : "No, sorry. It has been sold. Just waiting for payment to clear.",
    "lastEdited" : "Thu Sep 01, 2016 3:43 pm"
  } ]
}