{
  "forumId" : "51",
  "threadId" : "109015",
  "title" : "Unique Volksworld featured 1966 split for sale",
  "originalUrl" : "https://ssvc.org.uk/phpbb/viewtopic.php?f=51&t=109015",
  "breadcrumbs" : [ ],
  "totalPosts" : 5,
  "pageNumber" : 1,
  "totalPages" : 1,
  "posts" : [ {
    "postId" : "825342",
    "author" : {
      "username" : "DAZW12",
      "userId" : "Unknown",
      "joined" : "-",
      "profileRank" : "-",
      "location" : "-",
      "postCount" : "-",
      "avatarPath" : "./download/file.php%3Favatar=40064_1425903408.jpg"
    },
    "content" : "REDUCED NOW @ £42,000\n<br>\n<br>Full restoration done in 2009 by Larry at Resto Custom in Hertfordshire.\n<br>Always dry stored, Only done about 200 miles in 5 years.\n<br>\n<br>\n<br>All the work done listed below:\n<br>\n<br>BODYWORK\n<br>THIS BUS IS A 1966 RIGHT HAND DRIVE VOLKSWAGEN TYPE 2 KOMBI WHICH WAS ORIGINALLY A 13 WINDOW SLIDING SUNROOF MODEL. THE VEHICLE HAS BEEN SUBJECTED TO A PROFESSIONAL CUSTOM ELEVATING ROOF CONVERSION,(BELIEVED TO BE DONE IN THAILAND) ALLOWING THE CENTRAL ROOF SECTION TO BE OPENED 90 DEGREES FROM INSIDE THE VEHICLE AND THE NEARSIDE SIDE WINDOWS DROP DOWN 90 DEGREES. THIS HAS BEEN ACCOMPLISHED USING BOTH ORIGINAL AREAS OF THE VEHICLE AND DONOR SECTIONS FROM ANOTHER VEHICLE. OTHERWISE, THE VEHICLE BODYWORK IS AS STOCK FORM AND IS ENTIRELY RUST FREE AND IN EXCELLENT CONDITION.\n<br>\n<br>SUSPENSION AND BRAKES\n<br>THE VEHICLE FEATURES A PROFESSIONALLY BUILT AND FITTED ADJUSTABLE HEIGHT FOUR INCH NARROWED FRONT AXLE AND FULLY RECONDITIONED 2.5 INCH DROPPED SPINDLES. \n<br>THE BRAKING SYSTEM HAS BEEN UPGRADED TO A DUAL CIRCUIT SYSTEM AND FEATURES A BILLET AFTERMARKET FRONT DISC BRAKE SYSTEM. ALL STEERING COMPONENTS HAVE BEEN REPLACED FOR NEW ITEMS AND THE ORIGINAL STEERING BOX HAS BEEN RECONDITIONED AND RE-BUSHED.\n<br>THE REAR SUSPENSION HAS BEEN UPGRADED THROUGH A STRAIGHT AXLE CONVERSION UTILISING ADJUSTABLE HEIGHT SPRINGPLATES AND FEATURES A FULLY REBUILT VW 1500 TYPE 1 GEARBOX WITH TALLER RATIOS THAN STANDARD. BRAKES ARE THE WIDER MORE EFFECTIVE VW TYPE 3 ITEMS AND FEATURE ALL NEW BRAKE COMPONENTS.\n<br>\n<br>WHEELS\n<br>THE VEHICLE HAS A SET OF FOUR REPRODUCTION BRM ALLOY WHEELS IN GLOSS BLACK FINISH WITH POLISHED HIGHLIGHTS AND 160/50/15 TYRES ON THE FRONT WHEELS AND 185/65/15 TYRES ON THE REAR. \n<br>\n<br>ENGINE\n<br>THE ENGINE IS A NEW 1641CC TWIN PORT UNIT. THE STOCK CARBURETTOR HAS BEEN REPLACED WITH TWIN WEBER 34ICT CARBURETTORS AND THE STANDARD VACUUM ADVANCE UNIT HAS BEEN REPLACED WITH A 009 CENTRIFUGAL ADVANCE UNIT. THE EXHAUST FEATURES A MERGED HEADER RUNNING J TUBES TO REPLACE THE STANDARD HEAT EXCHANGERS AND THE MUFFLER IS A MONDO STYLE AFTERMARKET TYPE.\n<br>ENGINE DETAILING FEATURES POWDERCOATED GLOSS BLACK ENGINE TINWARE AND FAN HOUSING AND A FULLY POLISHED ALTERNATOR HOUSING.\n<br>\n<br>ELECTRICAL\n<br>THE VEHICLE FEATURES A NEW REPLACEMENT WIRING HARNESS THROUGHOUT AND HEADLAMPS, INDICATOR AND TAIL LIGHT HOUSINGS ARE BRAND NEW AFTERMARKET ITEMS. THE VEHICLE ALSO FEATURES AN AUXILLARY CIRCUIT POWERED BY AN 85AH LEAD ACID BATTERY, RUNNING A SPLIT CHARGE RELAY SYSTEM FROM THE STOCK ALTERNATOR. AN AUXILLARY CIRCUIT FUSEBOX HAS BEEN ADDED TO THE FRONT OF THE VEHICLE WHICH POWERS AN IN-CAR STEREO SYSTEM FEATURING A CLARION HEAD UNIT MOUNTED IN A CUSTOM PANEL UNDER THE DASHBOARD WITH 2X SPEAKERS IN THE FRONT CAB DOOR CARDS, 2 X SPEAKERS IN THE REAR SEAT KICK PANEL AND 2 X TWEETERS MOUNTED EITHER SIDE IN THE CUSTOM UNDER DASH PANEL. A CIGARETTE LIGHTER SOCKET IS ALSO MOUNTED IN THE CUSTOM PANEL UNDER THE DASH. THE VEHICLE ALSO FEATURES A VDO OIL TEMPERATURE GAUGE AND VDO OIL PRESSURE GAUGE MOUNTED IN THE OVERHEAD FAN CONSOLE. THE VEHICLE ALSO FEATURES 2 X SONY BRAVIA TELEVISION SCREENS MOUNTED ON THE CARGO DOORS AND 2 X SPEAKERS AND 2 X TWEETERS IN CUSTOM BUILT PODS MOUNTED IN A SCUPLTED HOUSING BELOW. A SONY PLAYSTATION 3, SONY AMPLIFIER AND HDMI SPLITTER ARE LOCATED UNDER THE REAR SEAT. POWER TO THESE ITEMS IS PROVIDED BY A 240V HOOKUP SOCKET, MOUNTED UNDER THE CARGO FLOOR ON THE NEARSIDE REAR. THIS FEEDS A BANK OF FOUR DOUBLE SOCKETS VIA A 240V 4X16A MCB RCD UNIT WHICH IS ALSO CHASSIS EARTHED. THE VEHICLE IS ALSO FITTED WITH A FULL TRACKER SECURITY SYSTEM.\n<br>\n<br>INTERIOR\n<br>THE VEHICLE HAS A CUSTOM BUILT FULL VINYL UPHOLSTERED INTERIOR WITH A SCULPTED BULKHEAD PANEL. A CUSTOM REAR SEAT RESIDES IN THE REAR CARGO AREA OF WHICH THE UNDERSIDE IS HOME TO THE VARIOUS ELECTRICAL ANCILLARIES. THE CARGO FLOOR AREA FEATURES A QUICK RELEASE REMOVABLE CARPET AND THE HEADLINING IS TAILOR MADE TO THE MODIFIED ROOF UTILISING GREY VINYL. THE FRONT CAB AREA FEATURES A MOTO LITA 15 INCH FULLY POLISHED AND BLACK LEATHER RIMMED STEERING WHEEL AND A FULL WIDTH BENCH SEAT FROM A PRE-1960 VOLKSWAGEN TYPE 2 WHICH HAS BEEN UPHOLSTERED IN GREY VINYL TO MATCH THE REST OF THE INTERIOR. CUSTOM MADE CARGO DOOR PANELS FEATURE FIXING BRACKETS FOR TWO SONY BRAVIA TELEVISION SCREENS AND SCULPTED PODS TO HOUSE SPEAKERS AND TWEETERS.\n<br>\n<br>EXTERIOR\n<br>THE EXTERIOR OF THE VEHICLE IS PAINTED IN METALLIC AUDI LZ7X NIMBUS GREY PEARL THROUGHOUT, INCLUDING THE ENGINE BAY AREA. COLOUR CODED US SPECIFICATION TOWEL RAIL BUMPERS ARE FITTED TO BOTH THE FRONT AND REAR. FULLY POLISHED ALUMINIUM DELUXE TRIM IS FITTED TO THE SWAGE LINE AROUND THE ENTIRE VEHICLE AND FULLY POLISHED ALUMINIUM ‘SAFARI’ OPENING WINDSCREENS ARE FITTED TO THE FRONT. ELSEWHERE THROUGHOUT THE VEHICLE BRAND NEW DARK SMOKE TINTED WINDOW GLASS HAS BEEN FITTED WITH ALL NEW WINDOW RUBBER SEALS. ALL NEW DOOR HANDLES AND LOCKS HAVE BEEN FITTED THROUGHOUT THE VEHICLE. THE ROOF FEATURES TWO WESTFALIA STYLE TWIN BOW ROOF RACKS WITH VARNISHED WOOD SLATS AND FULLY POLISHED ALUMINIUM RAILS. THE VEHICLE HAS ALSO BEEN FITTED WITH NEW DOOR, TAILGATE AND ENGINE LID RUBBER SEALS THROUGHOUT.",
    "lastEdited" : "Mon Mar 09, 2015 12:27 pm"
  }, {
    "postId" : "825345",
    "author" : {
      "username" : "DAZW12",
      "userId" : "Unknown",
      "joined" : "-",
      "profileRank" : "-",
      "location" : "-",
      "postCount" : "-",
      "avatarPath" : "./download/file.php%3Favatar=40064_1425903408.jpg"
    },
    "content" : "MORE PICTURES:",
    "lastEdited" : "Mon Mar 09, 2015 12:49 pm"
  }, {
    "postId" : "825346",
    "author" : {
      "username" : "DAZW12",
      "userId" : "Unknown",
      "joined" : "-",
      "profileRank" : "-",
      "location" : "-",
      "postCount" : "-",
      "avatarPath" : "./download/file.php%3Favatar=40064_1425903408.jpg"
    },
    "content" : "MORE",
    "lastEdited" : "Mon Mar 09, 2015 12:50 pm"
  }, {
    "postId" : "825347",
    "author" : {
      "username" : "DAZW12",
      "userId" : "Unknown",
      "joined" : "-",
      "profileRank" : "-",
      "location" : "-",
      "postCount" : "-",
      "avatarPath" : "./download/file.php%3Favatar=40064_1425903408.jpg"
    },
    "content" : "MORE",
    "lastEdited" : "Mon Mar 09, 2015 12:51 pm"
  }, {
    "postId" : "829292",
    "author" : {
      "username" : "DAZW12",
      "userId" : "Unknown",
      "joined" : "-",
      "profileRank" : "-",
      "location" : "-",
      "postCount" : "-",
      "avatarPath" : "./download/file.php%3Favatar=40064_1425903408.jpg"
    },
    "content" : "PRICE REDUCED NOW @ £42,000.",
    "lastEdited" : "Tue Apr 07, 2015 4:22 pm"
  } ]
}