{
  "forumId" : "51",
  "threadId" : "68932",
  "title" : "Completely restored 1965 Splittie 'FatBoy'",
  "originalUrl" : "https://ssvc.org.uk/phpbb/viewtopic.php?f=51&t=68932&start=0",
  "breadcrumbs" : [ ],
  "totalPosts" : 2,
  "pageNumber" : 1,
  "totalPages" : 1,
  "posts" : [ {
    "postId" : "530406",
    "author" : {
      "username" : "sparkymctastic",
      "userId" : "Unknown",
      "joined" : "-",
      "profileRank" : "-",
      "location" : "-",
      "postCount" : "-",
      "avatarPath" : null
    },
    "content" : "This is the very sad sale of my 1965 Splittie. We imported 'Fatboy' from New England in 2006 and have spent the last 3 to 4 years restoring her from the bottom up. She has been stripped to bare chasis, dipped, professionally welded, coated, painted and restored to almost brand-new condition, all at huge cost. Unfortunately, my girlfriend and I are no longer together, hence the very reluctant sale.\n<br>\n<br>She is registered, MoT'd, Taxed, ready to rock. So far however, only the front seats are in place as we were having the interior done this winter. \n<br>\n<br>As you can see, she is in flawless condition and is ready for someone to add their own style to the interior. She also comes with an original large rear roofrack, 3/4 Just Kampers rock'n'roll bed ready to be fitted, original slat-type windows (newly powder-coated), custom vehicle cover and a host of spares worth 100s of pounds. It would be easier to list the parts which are not brand new on her, for instance the engine block is original (thoroughly tested and reconditioned) but almost all of the ancilliaries are new, including the 24V generator. The engine was tuned this summer and starts first time. The seats were professionally upholstered by All Wheel Trim of Witney and still have the plastic covers on. I also have the original body paint so that any nicks can be re-touched once the interior is in place. Everything on the van has a receipt. \n<br>\n<br>If you have any questions, please feel free to ask.\n<br>\n<br>Sparky\n<br>\n<br>Hmm, anyone know how I add images?",
    "lastEdited" : "Sat Aug 28, 2010 12:58 pm"
  }, {
    "postId" : "530408",
    "author" : {
      "username" : "richierich37",
      "userId" : "Unknown",
      "joined" : "-",
      "profileRank" : "-",
      "location" : "-",
      "postCount" : "-",
      "avatarPath" : null
    },
    "content" : "welcome to the ssvc! \n<img src=\"./images/smilies/icon_biggrin.gif\" alt=\":D\" title=\"Big Grin\"> \n<br>\n<br>photobucket, paste and copy img code for adding photos!\n<br>\n<br>much you want for it?",
    "lastEdited" : "Sat Aug 28, 2010 2:13 pm"
  } ]
}