{
  "forumId" : "51",
  "threadId" : "111795",
  "title" : "Ribbed mango 58 11 window for sale",
  "originalUrl" : "https://ssvc.org.uk/phpbb/viewtopic.php?f=51&t=111795",
  "breadcrumbs" : [ ],
  "totalPosts" : 5,
  "pageNumber" : 1,
  "totalPages" : 1,
  "posts" : [ {
    "postId" : "843940",
    "author" : {
      "username" : "Austin",
      "userId" : "843940",
      "joined" : "Wed Sep 01, 2010 5:10 pm",
      "profileRank" : "SSVC Member",
      "location" : "Newport Pagnell",
      "postCount" : "171",
      "avatarPath" : "./download/file.php%3Favatar=34614_1430571362.jpg"
    },
    "content" : "hmmm, I've given this a bit of thought, and have decided to put this up for sale.\n<br>\n<br>1958 ribbed mango 11 window non walkthrough kombi LHD\n<br>1600 TP good quality engine from a low mile early bay window\n<br>12v\n<br>new battery\n<br>RHD converted head lights\n<br>twin 34 ict carbs with sect bell crank linkage \n<br>scat pully\n<br>Bugpack ceramic header and back box\n<br>new leads\n<br>new plugs\n<br>german pre 2001 009 dizzy, new cap rotor and points\n<br>new coil\n<br>half moon fan shroud without heater outlets \n<br>SA conversion using parts from a beetle and a T3 everything is brand new from T2D apart from the shafts, which were not new, but bought from T2D\n<br>correct handbrake cables with no spacers\n<br>SA gearbox from a low mileage beetle\n<br>buttys bits gear box mounts\n<br>all new rear brakes with the exception of the rear drums which are original to the bus, but have had the nut face machined\n<br>adjustabe CE rear suspension plates\n<br>brand new BBT sprints 5.5 et10 at the back, no spacers or adaptors needed, with new 195 65 15 load rated bridgestone potenzas\n<br>brand new BBT sprints at the front 4.5 et34 with brand new 165 50 15 bridgstone potenzas\n<br>brand new scratch built T2D 4\" narrowed beam with adjustors and new T2D K&amp;L flipped spindles, new leaves, new steering arms, new track rod ends, new centre pin\n<br>brand new dual circuit MC with all new copped brake lines installed\n<br>buttys bits accelerator sprung return linkage\n<br>re con steering box\n<br>hayburner steering box raise kit fitted, with column shortened \n<br>new speedo cable fitted\n<br>i have replaced all glass rubber with german C&amp;C seals, i also have every single other rubber seal for the entire van which i have yet to fit\n<br>new cargo door sil inner, outer and strengthener from auto craft\n<br>\n<br>\n<br>All new tweed and vinyl trim, front bench, double buddy seat, full width rock and roll bed and rear foam.\n<br>full width rock and roll bed i have made, to be exactly like a westy, using original hinges, and sliding side panel brackets, double buddy seat i have mad from scratch exactly like a westy seat.\n<br>extendable westy flip up table from a late bay with cool 70's sticker!!\n<br>spice rack from an early bay, storage cupboard door from a late bay\n<br>all interior panels are new ply, including door cards, and kick panels\n<br>interior roof panels are new but only partial installed, both overly impressed wight the kit i bought, so I'm likely to make my own.\n<br>2 x new securon 3 point seat belts\n<br>new centre 3 point harness, this enables me to carry my 3 children safely on the back seats \n<br>really cool retractable period GM front lap belts x 3\n<br>the dash is un cut, but the vents are a bit bent!\n<br>original rubber cab mat\n<br>3 bow slatted roof rack\n<br>\n<br>Overall......\n<br>running driving totally usable ribbed mango 58, the lady i bough this from in the stats owned this for about 40 years, and this was her daily drive up until she sold to me. The preious owner also thought it would be a good idea to cover every single last bit of interior with a thick shag pile carpet, its was very well glued and screwed in, i have since removed this, leaving only a small scrap in the cab for fun and to remind me of how crackers this old school hippo was! She did also have a repaint in the states a very long time ago in red, but i am about 50 hours into scraping it all off, i have block sanded a few test patches, it has plenty of patina and i have gotten a good shine on it in the places i have experimented with. It also has had a replacement front clip in the states a very long time ago, its been done to a pretty good standard and has certainly lasted the test of time, thats why the front panel was different colour up front. It is virtually 80% original paint, the only filler the van has is in the rear quarter, i plan to scrape this out, polish and leave it with the minor dent the bond was meant to cover up. apart fro that there is nothing else to hide with the body work, it has some dents and scrapes on it, but i love it like that. it also had a factory eberspatcher heater installed which the hole is still present, (which i have temp sealed up to avoid fumes) i had planned to keep my eye out for one and put a heater back in. Also one of the jobs on my hit list is to change the front shift rod and install bushes as currently there are not any bushes!!\n<br>\n<br>so there you have it, this is a ratty looking patina'd van with nothing to hide, its MOT exempt, and also believed to be of only a few in production for a one month only period, due to its chassis number, bumpers, and colour. Its gonna be tough to let go of this, but if it doesn't sell by the time i move house, ill put it in the garage of my new house (where it will actually fit in!!) and gradually knock off random jobs on it over time. Ive spent a fortune on this getting the stance right, and making it better to drive and being family safe. Its not rotten and is ready to go. its not prefect by a long shot, but it is what it is. i won't go on about how I've justified the price or anything because anyone looking for a pre 60 split will know the market. i'd like £22K Ono its located in newport pagnell, and anyone is welcome to come and take a look. I also don't mind helping ship this anywhere in Europe if you need it.\n<br>\n<br>i'll bet i have forgotten some bits to this, as I've wrote all this in one sitting, so i'll update with bits if i need to. This is the only place i am going to advertise my bus, so if the ad is still here, its still for sale. Drop me a pm if you want my mobile number, or have any questions about it.\n<br>\n<br>cheers\n<br>\n<br>Austin\n<br>\n<br>\n<img src=\"http://images.tapatalk-cdn.com/15/07/31/43f0d5cf470a23538e604bf931190aba.jpg\" class=\"postimage\" alt=\"Image\">\n<img src=\"http://images.tapatalk-cdn.com/15/07/31/80fab8575eef8e9200c989f5c11ab779.jpg\" class=\"postimage\" alt=\"Image\">\n<img src=\"http://images.tapatalk-cdn.com/15/07/31/507a6953f91a10a362cf5aa2c4ca648f.jpg\" class=\"postimage\" alt=\"Image\">\n<img src=\"http://images.tapatalk-cdn.com/15/07/31/ed2fac6281d5ecb68136d2db018c80ca.jpg\" class=\"postimage\" alt=\"Image\">\n<img src=\"http://images.tapatalk-cdn.com/15/07/31/1cf0f492c1f7bc2a1cdafed371208bed.jpg\" class=\"postimage\" alt=\"Image\">\n<img src=\"http://images.tapatalk-cdn.com/15/07/31/6fc4aaae33328dcca7233b285e4a55e7.jpg\" class=\"postimage\" alt=\"Image\">\n<img src=\"http://images.tapatalk-cdn.com/15/07/31/644779b7cf1f5510ddaa170c8af994e9.jpg\" class=\"postimage\" alt=\"Image\">\n<img src=\"http://images.tapatalk-cdn.com/15/07/31/ce564b2f6482eb4a3199f5900c30fe90.jpg\" class=\"postimage\" alt=\"Image\">",
    "lastEdited" : "Fri Jul 31, 2015 7:57 pm"
  }, {
    "postId" : "843976",
    "author" : {
      "username" : "Krissg",
      "userId" : "843976",
      "joined" : "Wed Jul 30, 2014 10:33 am",
      "profileRank" : "Registered user",
      "location" : "-",
      "postCount" : "12",
      "avatarPath" : null
    },
    "content" : "PM'd you mate!",
    "lastEdited" : "Sat Aug 01, 2015 8:53 am"
  }, {
    "postId" : "844069",
    "author" : {
      "username" : "Crooky",
      "userId" : "844069",
      "joined" : "Tue Dec 30, 2014 1:58 pm",
      "profileRank" : "SSVC Member",
      "location" : "Essex",
      "postCount" : "355",
      "avatarPath" : "./download/file.php%3Favatar=39974_1421267567.jpg"
    },
    "content" : "I hope there's another bus to replace this one mate! Cracking bus.",
    "lastEdited" : "Sun Aug 02, 2015 9:04 am"
  }, {
    "postId" : "845126",
    "author" : {
      "username" : "Austin",
      "userId" : "845126",
      "joined" : "Wed Sep 01, 2010 5:10 pm",
      "profileRank" : "SSVC Member",
      "location" : "Newport Pagnell",
      "postCount" : "171",
      "avatarPath" : "./download/file.php%3Favatar=34614_1430571362.jpg"
    },
    "content" : "Cheers mark, well there will be, if it sells I'll wait til I've moved house first tho.\n<br>\n<br>I should add, pleased feel free to contact me if you are interested to come and have a look and make an offer. Worst I can say is no, so try me. \n<br>\n<br>Also I may put this for sale on VZi it's very surprising the amount of people I come across who either have a split or want one and don't know about the SSVC.",
    "lastEdited" : "Tue Aug 11, 2015 6:42 pm"
  }, {
    "postId" : "846217",
    "author" : {
      "username" : "Austin",
      "userId" : "846217",
      "joined" : "Wed Sep 01, 2010 5:10 pm",
      "profileRank" : "SSVC Member",
      "location" : "Newport Pagnell",
      "postCount" : "171",
      "avatarPath" : "./download/file.php%3Favatar=34614_1430571362.jpg"
    },
    "content" : "SOLD thanks for all of the interest",
    "lastEdited" : "Thu Aug 20, 2015 11:13 pm"
  } ]
}