{
  "forumId" : "51",
  "threadId" : "125081",
  "title" : "1964 11 Window",
  "originalUrl" : "https://ssvc.org.uk/phpbb/viewtopic.php?f=51&t=125081",
  "breadcrumbs" : [ {
    "url" : "./viewforum.php?f=51&sid=9504c4d919f4c3fb3b415634a28f0331",
    "label" : "Buses For Sale"
  } ],
  "totalPosts" : 4,
  "pageNumber" : 1,
  "totalPages" : 1,
  "posts" : [ {
    "postId" : "931909",
    "author" : {
      "username" : "split personality",
      "userId" : "931909",
      "joined" : "Thu Jan 10, 2008 9:32 pm",
      "profileRank" : "Registered user",
      "location" : "West Midlands",
      "postCount" : "187",
      "avatarPath" : null
    },
    "content" : "Here is some more information on my bus. I have owned it for close to 12 years. I had it imported from Texas and then a local VW classic restoration company professionally restored it. The underside is absolutely rock solid, everytime it goes for an MOT the garage can't believe how solid it is. Restoration included respraying in the original Turquoise lower and blue White upper. There is a camping interior which comprises a full width rock and roll bed. This folds up to form a double seat, there is a further 3/4 seat which allows four people to sit around a table and eat. There is a Canterbury Pitt original door cooker fitted as well. The interior has colour matched cushions on the rock and roll bed. The roof is oak ply lined and the floor is oak style laminate.\n<br> I had 3 point seat belts fitted in the rear and front for safety. ( I have a young family). We have had many great camping trips in our bus. \n<br> About 5 years ago I decided to have work carried out on the suspension and running gear. The bus has been professionally lowered . It has a straight axle conversion. The gear box was upgraded at the same time to a beetle GT box. This allows comfortable cruising on the motorway at a steady 60. The lowering and gear box have made a huge difference to the performance of the bus. The brakes were also upgraded to Porsche 944 disc brakes all round. This again is a huge upgrade in terms of safety. This bus can keep up with modern traffic and stops like a modern vehicle too. I had the steering box reconditioned and had a complete new wiring loom fitted with modern fuse box. There is also a leisure battery system wired in.\n<br> The wheels are Porsche 944 steel drums and Porsche hub caps. These were put on as a temp measure until I saved up for some nice alloys but I grew to like them and they have a unique look.\n<br> The bus will come with a 1600cc single port engine . It is currently in another vehicle I own and will be fitted along with a an empi exhaust. This engine is going in in mid September. The engine runs well and has no end float. This bus has had a bigger engine , hence all the safety and upgrades to brakes, suspension. It will run perfectly on a 1600 but has all the mods in place should you want to put a bigger engine in for towing etc. \n<br> There is a modern cd stereo fitted and it has a security system that I can talk the buyer through. It has an oil temperature gauge fitted to keep a check on how things are running. \n<br> This is a great bus, that has had all the mechanical work done to bring it into the 21st century. The paintwork needs some slight touches which are shown in the pictures and the wheels need cleaning up. The van is tax and MOT exempt It has been run very little in the past 18 months but previous mots only ever needed the hand brake adjusting. The stearing box will be due for a service , the disc brakes will need a clean up and the seat covers have a few marks that will probably valet out. The bus has been dry stored in a garage and has never been out in the winter months so fair to say it has been loved and looked after. Selling is a tough decision but as stated I have another bus(sadly not a split) and we need to replace our day to day car and do some work on the house.\n<br> Price £25k Happy to send more pictures via email",
    "lastEdited" : "Fri Aug 28, 2020 8:43 am"
  }, {
    "postId" : "932642",
    "author" : {
      "username" : "LEOTY",
      "userId" : "932642",
      "joined" : "Fri Sep 18, 2020 8:31 am",
      "profileRank" : "Registered user",
      "location" : "-",
      "postCount" : "5",
      "avatarPath" : null
    },
    "content" : "Hello, Is your bus still for sale. If so, can it be offered for sale with the larger engine? Do you have other photos of the interior and points of attention? Thank you",
    "lastEdited" : "Fri Oct 09, 2020 6:56 pm"
  }, {
    "postId" : "932725",
    "author" : {
      "username" : "split personality",
      "userId" : "932725",
      "joined" : "Thu Jan 10, 2008 9:32 pm",
      "profileRank" : "Registered user",
      "location" : "West Midlands",
      "postCount" : "187",
      "avatarPath" : null
    },
    "content" : "Hi. It now has the 1600 engine in it. The engine is sound and runs really well. If you are still interested then let me know and I can arrange to send you some additional photos.",
    "lastEdited" : "Thu Oct 15, 2020 5:16 pm"
  }, {
    "postId" : "932740",
    "author" : {
      "username" : "LEOTY",
      "userId" : "932740",
      "joined" : "Fri Sep 18, 2020 8:31 am",
      "profileRank" : "Registered user",
      "location" : "-",
      "postCount" : "5",
      "avatarPath" : null
    },
    "content" : "Hello, I'm still interested in him, he's very nice. If you have other interior photos, points to take in the body, the engine, the underside and the brakes. My email address is \n<a href=\"mailto:herve.leoty@bca.fr\">herve.leoty@bca.fr</a> or by whatsapp at 0674007014 (France) Thank you in advance",
    "lastEdited" : "Fri Oct 16, 2020 6:42 pm"
  } ]
}