{
  "forumId" : "51",
  "threadId" : "68873",
  "title" : "57 double door panel bus with 1000's of pounds in new parts",
  "originalUrl" : "https://ssvc.org.uk/phpbb/viewtopic.php?f=51&t=68873&start=0",
  "breadcrumbs" : [ ],
  "totalPosts" : 6,
  "pageNumber" : 1,
  "totalPages" : 1,
  "posts" : [ {
    "postId" : "529912",
    "author" : {
      "username" : "freebasedeathmonkey",
      "userId" : "Unknown",
      "joined" : "-",
      "profileRank" : "-",
      "location" : "-",
      "postCount" : "-",
      "avatarPath" : null
    },
    "content" : "1957 Double Door Panel Bus. Easy Restoration With A boat Load Of Brand New Parts Still In Original Packaging 12,000 UK POUNDS ONO.\n<br>\n<br>\n<img src=\"http://i632.photobucket.com/albums/uu42/freebasedeathmonkey/picdisc886.jpg\" alt=\"Image\">\n<br>\n<br>Super solid and straight. Rust free California bus with minor repair issues. I shipped this bus in aprox 6 years ago. It is fully registered in the UK with age related plates. I had it fitted up with brand new Creative Engineering IRS, dropped spindles and a brand new Rancho Performance Pro Street gearbox with a new Berg shifter and drove it with a full MOT for less than 1000 miles before pulling it off the road for a full resto. The pic above is as it was before being stripped. The motor is a 1600 single port that I had proffesionally rebuilt and it cruises nicely with no issues whatsoever. The bus is now fully stripped and standing on jacks in a dry workshop. The bus has had a later front nose skin grafted on at some point but I have a rust free 58 complete front end that comes with the bus. The only other issue is that the front beam mounts have been hacked too. They do pass the MOT but if you want to do the job properly, Gerson at Klassic Fab gave me a quote of 60 dollars per side to make them for me. I suffer the usual story of running out of money to finish the job. The bus uses only one key for all locks and ignition. Here is a list of most of the parts that I have for this bus. They are all brand new and mostly in the original packaging.\n<br>\n<br>Brand new Creative Engineering IRS with 68 bay hubs, aleady fitted to bus but less than 1000 miles old.\n<br>Brand new Rancho Performance Pro Street gearbox, finished in gloss black and less than 1000 miles old\n<br>Brand new Creative polished safaris, complete kit, still in original packaging\n<br>Brand new Creative deluxe trim, still in original packaging\n<br>Brand new polished and black Randar alloys complete with valves and lugs, set of 4 in original packaging.\n<br>Brand new repop steel ribbed rear bumper. In original packaging.\n<br>Brand new complete rubber seal set, every seal, every grommet, every felt, everything you need. All in original packaging from Wolfsburg West.\n<br>Beautiful pair of 56 headlamps built by Richie at KK using NOS and restored genuine parts. Absolutely mint.\n<br>NOS bullet indicators.\n<br>Brand new CSP front disc set, complete in original packaging.\n<br>Brand new doglegs.\n<br>Brand new cargo floor, although the bus doesnt need one, I inherited this from a previous bus.\n<br>Brand new flat4 deluxe sterring wheel and horn push. Still in original packaging.\n<br>Brand new tinted glass from Creative.\n<br>Brand new wipers.\n<br>NOS wiper motor.\n<br>Brand new window catches from Wolfsburg West.\n<br>Brand new window sliders\n<br>Mint replacement rear hatch in primer. Although the original hatch is useable.\n<br>Brand new decklid hanger to replace rotten one.\n<br>Brand new hand made rear valance to replace broken one.\n<br>Brand new knobs and switches and knobs.\n<br>Brand new license plat lens.\n<br>Brand new tyres on original wheels less than 1000 miles old.\n<br>Brand new brakes.\n<br>Complete 58 front end to replace later nose skin.\n<br>Rock n roll bed plus to microbus seats in good order.\n<br>Plus many other parts that I cant recall off the top of my head but you get the picture. Every single part that I have taken off the bus is bagged and clearly labelled for an easy rebuild. I do have a lot more pics of the bus both as it was and as it is so please call 07886122160 for more info. I am looking for 12000 uk pounds. No trades or swaps. Thanx for looking",
    "lastEdited" : "Wed Aug 25, 2010 4:03 pm"
  }, {
    "postId" : "529932",
    "author" : {
      "username" : "freebasedeathmonkey",
      "userId" : "Unknown",
      "joined" : "-",
      "profileRank" : "-",
      "location" : "-",
      "postCount" : "-",
      "avatarPath" : null
    },
    "content" : "More pics of bus.\n<br>\n<br>\n<img src=\"http://i632.photobucket.com/albums/uu42/freebasedeathmonkey/picdisc1729.jpg\" alt=\"Image\">\n<br>\n<img src=\"http://i632.photobucket.com/albums/uu42/freebasedeathmonkey/24042009003.jpg\" alt=\"Image\">\n<br>\n<img src=\"http://i632.photobucket.com/albums/uu42/freebasedeathmonkey/picdisc1206.jpg\" alt=\"Image\">\n<br>\n<img src=\"http://i632.photobucket.com/albums/uu42/freebasedeathmonkey/picdisc888.jpg\" alt=\"Image\">",
    "lastEdited" : "Wed Aug 25, 2010 5:50 pm"
  }, {
    "postId" : "530183",
    "author" : {
      "username" : "freebasedeathmonkey",
      "userId" : "Unknown",
      "joined" : "-",
      "profileRank" : "-",
      "location" : "-",
      "postCount" : "-",
      "avatarPath" : null
    },
    "content" : "Bus is located in the West Midlands if anybody wants to come look at it. Body has no filler anywhere and is super solid and straight. Bump! You can also email me on \n<!-- e -->\n<a href=\"mailto:gazmarson@yahoo.com\">gazmarson@yahoo.com</a>\n<!-- e -->",
    "lastEdited" : "Thu Aug 26, 2010 7:52 pm"
  }, {
    "postId" : "530699",
    "author" : {
      "username" : "freebasedeathmonkey",
      "userId" : "Unknown",
      "joined" : "-",
      "profileRank" : "-",
      "location" : "-",
      "postCount" : "-",
      "avatarPath" : null
    },
    "content" : "up for the bank holiday.",
    "lastEdited" : "Mon Aug 30, 2010 9:53 am"
  }, {
    "postId" : "530748",
    "author" : {
      "username" : "kombilove",
      "userId" : "Unknown",
      "joined" : "-",
      "profileRank" : "-",
      "location" : "-",
      "postCount" : "-",
      "avatarPath" : null
    },
    "content" : "Quite a good price,,,,however lots of work ahead,,,,,\n<br>Someone with a big heart my take it for a project,\n<br>Would love to have the time and £££££ to get thsi babe on the road..\n<br>Anyway,,,God luck with sale mate",
    "lastEdited" : "Mon Aug 30, 2010 4:29 pm"
  }, {
    "postId" : "530752",
    "author" : {
      "username" : "freebasedeathmonkey",
      "userId" : "Unknown",
      "joined" : "-",
      "profileRank" : "-",
      "location" : "-",
      "postCount" : "-",
      "avatarPath" : null
    },
    "content" : "Cheers mate. It actually doesnt need that much work. You could actually just put it all back together, bit of primer, MOT it and run it as is. Stash all the good stuff till a later day. Anyone interested should call 07886122160 or email me at \n<!-- e -->\n<a href=\"mailto:gazmarson@yahoo.com\">gazmarson@yahoo.com</a>\n<!-- e -->",
    "lastEdited" : "Mon Aug 30, 2010 5:11 pm"
  } ]
}