{
  "forumId" : "51",
  "threadId" : "111847",
  "title" : "SO 34 WESTFALIA, SUB-HATCH, FLIP SEAT PROJECT",
  "originalUrl" : "https://ssvc.org.uk/phpbb/viewtopic.php?f=51&t=111847",
  "breadcrumbs" : [ ],
  "totalPosts" : 5,
  "pageNumber" : 1,
  "totalPages" : 1,
  "posts" : [ {
    "postId" : "844228",
    "author" : {
      "username" : "crankin-wagen",
      "userId" : "844228",
      "joined" : "Tue Jun 01, 2010 6:44 pm",
      "profileRank" : "Registered user",
      "location" : "DUBLIN, IRELAND",
      "postCount" : "6",
      "avatarPath" : null
    },
    "content" : "This is a Bus i bought 7 years ago, when the Irish economy was a little better, It came with no engine or transmission, The rear wheel arches had been cut out and Independent rear suspension had been added, Floor, outriggers, roof etc were in good order but most of the panels and doors had been knocked about and were in poor shape, I sourced all good doors from FBI, stuck her on a rollover jig and she was media blasted inside, outside and underneath.\n<br>The long panel was replaced, as was the rear wing on the other side and a new front panel.\n<br>The whole bus was etch primed , and then primed and painted in 2 pack, including all the undercarriage. The original hardwood roof supports were replaced with rolled box section to strengthen the roof and make the bus more rigid, A high level of attention was given to getting the door gaps even, the sub-hatch is in good order, along with the aluminium frame\n<br>elements, however new stainless hinge pin will be required, As I have mostly been involved in T25s , I decided to run a VW diesel and T25 transmission set up, the original fuel tank was in poor shape, so I sourced a T4 twin radiator to be installed in the original tank position, with a bespoke diesel tank under the rear seat, utilising the original filler position.\n<br>Porshe half shafts were sourced to overcome the difference in width between the split and T25 , engine and gearbox are mounted, all gears select, but there is still a bit of fettling to do, including packing spacers to reach the rear stub axels. The rear chassis rails were also reinforced to take the additional weight. However an Aircooled motor and tranny can still be fitted, a t25 engine hatch and frame were also grafted in \n<br>I also have a large selection of parts for the build, new wiring loom, new headlights, new indicators, new rear lights, Creative rack and pinion kit , 6 creative frameless popouts, rear safari window, all new door rubbers, new quarter lights, rubber and rails for door build up , new cab and boot locks, ambulance fans (6 volt). The original glass and 3 popouts are all present, but 1 windscreen, and one sliding door glass are cracked. most of the interior is present but in poor condition, but the fittings, hinges, seat frames and flip seat arms are all good.\n<br>\n<br>As it stands a colour change will cost very little, and choice of upholstery, interior etc can be anything you want\n<br>\n<br>I am asking £12,500 for the bus, with o/g interior , glass and a towel rail front bumper\n<br>Parts bundle, £2,750, or you can cherry pick what you need, and I will sell the rest seperaetly\n<br>Engine and transmission £800\n<br>\n<br>I can be reached on 00353 86 256 4470 David Dunne\n<br>\n<br>Bus is 5 miles from dublin airport, 3 miles from dublin ferry port to Holyhead or Liverpool\n<br>, so jump on a Ryan Air and come and have a look\n<br> \n<br>\n<br>\n<div class=\"inline-attachment\"> \n <dl class=\"thumbnail\"> \n  <dt>\n   <a href=\"./download/file.php?id=8269&amp;mode=view\"><img src=\"./download/file.php?id=8269&amp;t=1\" class=\"postimage\" alt=\"unnamed (23).jpg\" title=\"unnamed (23).jpg (64.54 KiB) Viewed 1677 times\"></a>\n  </dt> \n </dl> \n</div>]",
    "lastEdited" : "Mon Aug 03, 2015 6:35 pm"
  }, {
    "postId" : "844314",
    "author" : {
      "username" : "crankin-wagen",
      "userId" : "844314",
      "joined" : "Tue Jun 01, 2010 6:44 pm",
      "profileRank" : "Registered user",
      "location" : "DUBLIN, IRELAND",
      "postCount" : "6",
      "avatarPath" : null
    },
    "content" : "Some shots of interior",
    "lastEdited" : "Tue Aug 04, 2015 11:22 am"
  }, {
    "postId" : "844317",
    "author" : {
      "username" : "crankin-wagen",
      "userId" : "844317",
      "joined" : "Tue Jun 01, 2010 6:44 pm",
      "profileRank" : "Registered user",
      "location" : "DUBLIN, IRELAND",
      "postCount" : "6",
      "avatarPath" : null
    },
    "content" : "..a few more",
    "lastEdited" : "Tue Aug 04, 2015 12:08 pm"
  }, {
    "postId" : "845947",
    "author" : {
      "username" : "crankin-wagen",
      "userId" : "845947",
      "joined" : "Tue Jun 01, 2010 6:44 pm",
      "profileRank" : "Registered user",
      "location" : "DUBLIN, IRELAND",
      "postCount" : "6",
      "avatarPath" : null
    },
    "content" : "old windows and tank",
    "lastEdited" : "Tue Aug 18, 2015 8:52 pm"
  }, {
    "postId" : "848811",
    "author" : {
      "username" : "crankin-wagen",
      "userId" : "848811",
      "joined" : "Tue Jun 01, 2010 6:44 pm",
      "profileRank" : "Registered user",
      "location" : "DUBLIN, IRELAND",
      "postCount" : "6",
      "avatarPath" : null
    },
    "content" : "BUS AND ORIGINAL PARTS SOLD",
    "lastEdited" : "Mon Sep 14, 2015 2:10 pm"
  } ]
}