{
  "forumId" : "51",
  "threadId" : "113700",
  "title" : "1965 walk through pop top SO42 project bus Price: 13.500 GBP",
  "originalUrl" : "https://ssvc.org.uk/phpbb/viewtopic.php?f=51&t=113700",
  "breadcrumbs" : [ ],
  "totalPosts" : 2,
  "pageNumber" : 1,
  "totalPages" : 1,
  "posts" : [ {
    "postId" : "857215",
    "author" : {
      "username" : "carmanufactory",
      "userId" : "857215",
      "joined" : "Thu Dec 03, 2015 5:26 pm",
      "profileRank" : "Registered user",
      "location" : "-",
      "postCount" : "2",
      "avatarPath" : null
    },
    "content" : "Hi, \n<br>I am selling a 1965 Volkswagen Bus 23 with Westfalia SO42 original interior, a US import.\n<br>I am the third owner of the bus and I have a clean NY state title for it with a transferrable registration in my name. \n<br>The Westy has always been registered in Upstate NY as it probably survived Woodstock in its years of glory. \n<br>It is in a definite need of a restoration. There are various spots of rust as seen in pictures. The front floors are soft and doglegs will need to be replaced. The floors in the back are in restorable condition. The medallion, headlamp covers and taillamp covers are missing. I haven't tried to start the engine and please expect to give it a lot of TLC. \n<br>The SO42 Westfalia interior is all original and \"numbers matching\" from 1965. It includes: the upholstered sofa, the seat and cabinets. Plywood panels are original but need to be replaced. All folding tables are in rather good condition and fold easily. The front seats are tall with headrests - obviously not original, yet surprisingly comfortable. The rear window is cracked and will need to be replaced. Other glass is the original Sekurit glass. The top goes up and down easily, however the fabric is gone. It comes with a roof rack. \n<br>The bus is being sold with an extra front bumper in US specs as seen on pictures and some other parts such as: icebox/sink combination - Campmobile (I don't know if the fridge works) a spare, jack, wipers, net, etc. and an extra CB radio from the time period. The bus is on its way to Europe. It is expected to arrive to the port in northern Germany mid- December where it can be viewed for a couple of days. If I find the next custodian for the Splitty, I can help in arranging a transport to its final destination. If not - it will undergo a restoration process. \n<br>The price I'm asking for it is: 13.500 quid. There is no \"buy it now\" button. so if you're interested or need more pictures - please contact me at: \n<!-- e -->\n<a href=\"mailto:carmanufactory@gmail.com\">carmanufactory@gmail.com</a>\n<!-- e -->. Cheers, Robert\n<br>\n<br>Here's the link to my advert on thesamba\n<br>\n<!-- m -->\n<a class=\"postlink\" href=\"http://www.thesamba.com/vw/classifieds/detail.php?id=1867655&amp;\">http://www.thesamba.com/vw/classifieds/ ... d=1867655&amp;</a>\n<!-- m -->",
    "lastEdited" : "Fri Dec 04, 2015 5:26 pm"
  }, {
    "postId" : "865849",
    "author" : {
      "username" : "atlime",
      "userId" : "865849",
      "joined" : "Thu Jul 02, 2015 6:58 am",
      "profileRank" : "SSVC Member",
      "location" : "-",
      "postCount" : "102",
      "avatarPath" : null
    },
    "content" : "is this still for sale?",
    "lastEdited" : "Sun Feb 28, 2016 10:56 pm"
  } ]
}