{
  "forumId" : "51",
  "threadId" : "117249",
  "title" : "Original paint 1954 kombi rare so22 interior",
  "originalUrl" : "https://ssvc.org.uk/phpbb/viewtopic.php?f=51&t=117249",
  "breadcrumbs" : [ ],
  "totalPosts" : 6,
  "pageNumber" : 1,
  "totalPages" : 1,
  "posts" : [ {
    "postId" : "882883",
    "author" : {
      "username" : "67ben",
      "userId" : "882883",
      "joined" : "Thu Sep 08, 2005 7:58 pm",
      "profileRank" : "SSVC Member",
      "location" : "cotswolds",
      "postCount" : "1503",
      "avatarPath" : "./download/file.php%3Favatar=1666_1226860280.jpg"
    },
    "content" : "We have been thinking about this for a while, so have decided to put our 54 Kombi up for sale. \n<br>\n<br>Manufactured August 1954 and delivered to Passau ,Germany. \n<br>I know the history back to 1993 when it was found being used as a wood store. \n<br>We have had it about 8 years now and wouldn’t hesitate to drive to Europe tomorrow in it. \n<br>It's a very solid and straight barndoor by today’s standards. The inside is pretty much all original paint and undrilled as it left the factory inside around the inner gutters is very clean and original,obviously there are a few dents being a kombi. \n<br>It’s approximately 80% original dove blue paint the roof is 100 percent original paint just wearing through to the primer in places. I hand stripped the old paint back to where it is today about seven years ago and this was done to very high standard and took in excess of 250 hours. \n<br>The paint is strong but it has old marks where it was scuffed up to paint it on the lower long panel and a few on the front. \n<br>The logos on the doors are where I believe it was first put to work but I have never been able verify this with the company. \n<br>It has all the correct parts it should have handles and glass etc only the rear glass isn't original it's a later one with the correct logo added, which have been collected over the years where needed. \n<br>Metal wise it is rust free, it has its original front panel, chassis rails and I beams etc., which is rare these days 0n a barndoor and they are excellent. \n<br>The passenger door isn't an original to the van but is a genuine original paint Barndoor door and the cargo doors are both original Barndoor as well but not original to the van and have been painted dove blue. The driver’s door is original to the van and rust free. \n<br>Body work wise it had inner and outer sills, out riggers and a rear floor, doglegs, lower bulkhead and lower valence and front floor edges In the early ninety’s before panels were available. The doglegs appear to have been NOS 64-67 ones. \n<br>The rear corners had about the bottom 3 inches repaired but the reflector pressings are still there and the original steel. \n<br>These repairs are okay but by today's standards and panels could done again at some point in the future when time allows this isn't a van that will need everything replacing with green panels it has had less welding than most later split buses out there \n<br>.I removed any filler from these repairs when I stripped the van and left it as it was underneath so it hides nothing. \n<br>It has a few dents on it from years of use but it's not that bad for a commercial vehicle I looks like it had a small tap on the passenger side front at some point in its life and the roof has some surface dents in it but it's pretty straight overall. \n<br>It has an original 54-55 Barndoor front seat with a cover made by Lenny Copp in the US to a very high standard and a repro front Matt from David. \n<br>It has been lowered using rebuilt beetle spindles which bolt straight on with no beam modifications so could be put back to stock with ease. \n<br>It has zero off set Porsche pattern CSPs about 5000 miles use and Creative Engineering adjustable spring plates which are about a year old and is running a good late beetle box with German Porsche pattern drums. \n<br>The engine is a VW Mexico 1600 with twin 35 Solex carbs and has done about 10,000 miles. \n<br>I would sell the van without the engine if desired aswell. \n<br>The interior is a 1962 SO22 which has been reupholstered and includes the rare door unit and table and original it's missing the wardrobe and has a repro sisal Matt. \n<br>(this isn't for sale separately so please don't ask) but I wouldn't mind keeping it so would sell the van without it. \n<br>It has currently fitted SSP Gasburners which have been stripped and flatted back to make them look more original and has good 185 70 15 rear tyres and 165 65 15 front tyres. \n<br>I have the original center gearbox but no rgbs and have 3 of the 8/54 original wheels and one earlier one (these are currently on a friends barndoor and if wanted the van could be £1000.00 less without them) \n<br>No expense has been spared over the years to get this van to where it is today. \n<br>Any questions email us on \n<!-- e -->\n<a href=\"mailto:benjoynes@aol.com\">benjoynes@aol.com</a>\n<!-- e --> \n<br>The roof rack isn't included in the sale \n<br>\n<br>We can help with worldwide shipping to California would be around £1300.00-£1500.00 also I would px with a rusty barndoor project with Windows or a early westy \n<br>\n<br>\n<br>\n<br>many thanks Ben \n<br>\n<br>Serious enquires only please daytime only or before 6.30 pm (we have small children) \n<br>\n<br>07747 864 894 \n<br>\n<br>£55,000 Ono \n<br>\n<br>Here are a few options as I've had these questions asked I would sell it without the so22 interior preferably. \n<br>-£2000.00 less \n<br>And without the engine I would sell it for \n<br>-£2000.00 less \n<br>\n<br>\n<!-- m -->\n<a class=\"postlink\" href=\"http://s43.photobucket.com/user/67ben/library/54%20kombi\">http://s43.photobucket.com/user/67ben/l ... 54%20kombi</a>\n<!-- m --> \n<br>\n<br>\n<br>\n<br>I can take any photos needed and help with overseas shipping \n<br>\n<br>Many thanks ben",
    "lastEdited" : "Tue Sep 06, 2016 6:00 am"
  }, {
    "postId" : "882892",
    "author" : {
      "username" : "kristovs",
      "userId" : "882892",
      "joined" : "Mon May 16, 2011 11:18 am",
      "profileRank" : "Registered user",
      "location" : "-",
      "postCount" : "3",
      "avatarPath" : null
    },
    "content" : "Very nice bus! But you forgot to mention the price?",
    "lastEdited" : "Tue Sep 06, 2016 7:11 am"
  }, {
    "postId" : "882991",
    "author" : {
      "username" : "kristovs",
      "userId" : "882991",
      "joined" : "Mon May 16, 2011 11:18 am",
      "profileRank" : "Registered user",
      "location" : "-",
      "postCount" : "3",
      "avatarPath" : null
    },
    "content" : "Ok thanks!",
    "lastEdited" : "Wed Sep 07, 2016 11:26 am"
  }, {
    "postId" : "883002",
    "author" : {
      "username" : "JD Westy",
      "userId" : "883002",
      "joined" : "Tue Jun 02, 2009 12:26 pm",
      "profileRank" : "SSVC Member",
      "location" : "A-in-M",
      "postCount" : "872",
      "avatarPath" : null
    },
    "content" : "A bus to die for I love it Ben hope it goes to a good home no putting back to stock !",
    "lastEdited" : "Wed Sep 07, 2016 3:20 pm"
  }, {
    "postId" : "883004",
    "author" : {
      "username" : "Sweet Rides",
      "userId" : "883004",
      "joined" : "Wed Oct 18, 2006 7:55 pm",
      "profileRank" : "Registered user",
      "location" : "Out in the sticks...",
      "postCount" : "2574",
      "avatarPath" : "http://i80.photobucket.com/albums/j195/Steelrhino/flipseatbrochure.jpg"
    },
    "content" : "<blockquote>\n <div>\n  <cite>JD Westy wrote:</cite>A bus to die for I love it Ben hope it goes to a good home no putting back to stock !\n </div>\n</blockquote>\n<br>\n<br>Wouldn`t that be just awful! Please someone with a good home save her from such a terrible fate.",
    "lastEdited" : "Wed Sep 07, 2016 3:40 pm"
  }, {
    "postId" : "883044",
    "author" : {
      "username" : "67ben",
      "userId" : "883044",
      "joined" : "Thu Sep 08, 2005 7:58 pm",
      "profileRank" : "SSVC Member",
      "location" : "cotswolds",
      "postCount" : "1503",
      "avatarPath" : "./download/file.php%3Favatar=1666_1226860280.jpg"
    },
    "content" : "Now now calm down \n<img class=\"smilies\" src=\"./images/smilies/wink.gif\" alt=\";-)\" title=\"Wink\">\n<br>It have driven it thousands of miles stock and as it is which is totally reversable to stock in a weekend as nothing is cut or modified.\n<br>\n<br>Ben",
    "lastEdited" : "Thu Sep 08, 2016 9:34 am"
  } ]
}