{
  "forumId" : "51",
  "threadId" : "67970",
  "title" : "1967 RHD Splitscreen Camper - Krankenwagen (Ambulance)",
  "originalUrl" : "https://ssvc.org.uk/phpbb/viewtopic.php?f=51&t=67970&start=0",
  "breadcrumbs" : [ ],
  "totalPosts" : 3,
  "pageNumber" : 1,
  "totalPages" : 1,
  "posts" : [ {
    "postId" : "523227",
    "author" : {
      "username" : "sims_splitty",
      "userId" : "Unknown",
      "joined" : "-",
      "profileRank" : "-",
      "location" : "-",
      "postCount" : "-",
      "avatarPath" : null
    },
    "content" : "My bus is a 1967 Splitscreen Ambulance (Krankenwagen) RHD with an SO42 interior in her.I will have her MOT'd with a fresh 12 months for the buyer; I also have the import documents with all duties etc paid and the birth certificate so the new owner can be the first to register her! (very easy and I can assist with the registration). The birth certificate from Wolfsburg Germany gives the date it rolled out of the factory in Germany, all the options and the date it left for South Africa. \n<br>\n<br>Unique Ambulance features include a rear fold down hatch where the stretcher would have gone this will be great for cooking on or as a bar? It has a slide out side step which is worth around £300 on its own, and the factory built bulkhead with a cut out for a sliding glass partition. I was going to get this cut out of Perspex for safety reasons! The birth certificate from Wolfsburg, Germany gives the codes for these unique options.\n<br>\n<br>All work has been done so far by a professional restoration company and I can provide all receipts and photos.\n<br>\n<br>I have two genuine reasons why I have to sell her, firstly because I currently study at university in London, and with loans going down and fee’s going up I am in a difficult situation financially. Secondly I am only 21 and no one will give me insurance on her, I have tried everyone! This is a very reluctant sale for me! I wanted a RHD for the UK and didn't want a US spec bus, according to the guys who carried out the work they haven’t seen the underside of a bus this age in such good condition! The underside is completely solid in original Ivory paint with no rust or rot! It was undersealed from new and still has 95% of the underseal still present doing a fantastic job of protecting the bus. The small areas where it has come away is where you can see the solid ivory painted chassis, these areas will be re-covered so it will last another 40 years, I won’t yet so the chassis can still be seen! The bodywork is not perfect but it looks lovely.\n<br>\n<br>She can be used as she is, or with a little more work turned into fantastic looking show bus, usually it is the bottom 6 inches that are gone on these busses this underside as mentioned is mint!.\n<br>\n<br>Heres a list of some of the work and parts that I have spent thousand's on:\n<br>Cosmetic welding done to the roof NOS sections used.\n<br>New battery tray and new drivers floor area (tiny hole but had the whole\n<br>section replaced) these two quality welding sections sourced from A.H\n<br>Schofield.\n<br>RHS rear lower corner replaced with A.H Schofield part (rather that than\n<br>filler the dent).\n<br>The Van is now 100% solid, no filler or chicken wire anywhere!\n<br>Brand new paint job in original Ambulance colour - Ivory. (not show winning but presentable - hence the price)\n<br>Wheels, both rear and front bumpers and badge blasted primered and newly\n<br>Painted to match.\n<br>Full set of new chrome dome VW hubcaps – Custom and Commercial.\n<br>Brand new complete wiring loom.\n<br>NOS wiper and light switches.\n<br>New repro fuel gauge .\n<br>Brand new rear light lenses and surrounds – Custom and Commercial. \n<br>Strong 1200 engine from a previous project fantastic runner (reason why I\n<br>have kept it, +low insurance).\n<br>Original gearbox in fantastic condition, the speedometer only shows\n<br>approximately 33,000 miles and this is believed to be original as Adrian\n<br>who imported and is restoring her is from South Africa and is fully aware\n<br>how little use these ambulances and fire trucks got over there with the\n<br>state of the roads! (having been an ambulance all its life it has had less\n<br>use than other vehicles)\n<br>Full set of new powder coated tin ware for the engine.\n<br>Running gear has been overhauled and new parts fitted where needed I will\n<br>provide a list, new shocks and brake lines amongst these.\n<br>\n<br>I have also sourced an original 1967 (same age as the van) Westfalia SO42 interior, with a fantastic 3/4 width original westfalia rock n roll bed. The rock and roll bed cushions are torn on the base however we have matching cushions in a matching blue that will come with the van! \n<br>The van has the original ambulance issue plate (in the gap left for the\n<br>radio) this states that it was used in Mozambique with some other\n<br>information.\n<br>\n<br>I'm looking for offers around £12,000\n<br>\n<br>The bus is located in Weston Super Mare and viewings are welcomed!\n<br>I can provide more pictures on request!\n<br>For pictures please see the link below\n<br>\n<br>\n<!-- m -->\n<a class=\"postlink\" href=\"http://s768.photobucket.com/albums/x...0Extra%20Pics/\">http://s768.photobucket.com/albums/x...0Extra%20Pics/</a>\n<!-- m -->\n<br>\n<br>Contact me on 07799172000\n<br>or email me at: \n<!-- e -->\n<a href=\"mailto:s.prior@ucl.ac.uk\">s.prior@ucl.ac.uk</a>\n<!-- e -->",
    "lastEdited" : "Thu Jul 22, 2010 5:57 pm"
  }, {
    "postId" : "523238",
    "author" : {
      "username" : "lammyrider",
      "userId" : "Unknown",
      "joined" : "-",
      "profileRank" : "-",
      "location" : "-",
      "postCount" : "-",
      "avatarPath" : "http://img.photobucket.com/albums/v726/lammyrider/monbus.jpg"
    },
    "content" : "link dont work \n<img src=\"./images/smilies/icon_wink.gif\" alt=\":wink:\" title=\"Wink\">",
    "lastEdited" : "Thu Jul 22, 2010 6:33 pm"
  }, {
    "postId" : "524713",
    "author" : {
      "username" : "notasprint",
      "userId" : "Unknown",
      "joined" : "-",
      "profileRank" : "-",
      "location" : "-",
      "postCount" : "-",
      "avatarPath" : null
    },
    "content" : "Hi \n<br>\n<br>Is your Camper still for sale? \n<br>\n<br>Can't get the link to work to see any of the pictures, can you send me a different link or pictures please.\n<br>\n<br>Many thanks\n<br>\n<br>Ady",
    "lastEdited" : "Fri Jul 30, 2010 6:45 am"
  } ]
}