{
  "forumId" : "51",
  "threadId" : "108961",
  "title" : "Jan '51 Barndoor Panel Van - original Belgian bus",
  "originalUrl" : "https://ssvc.org.uk/phpbb/viewtopic.php?f=51&t=108961",
  "breadcrumbs" : [ ],
  "totalPosts" : 6,
  "pageNumber" : 1,
  "totalPages" : 1,
  "posts" : [ {
    "postId" : "824889",
    "author" : {
      "username" : "busben",
      "userId" : "Unknown",
      "joined" : "-",
      "profileRank" : "-",
      "location" : "-",
      "postCount" : "-",
      "avatarPath" : null
    },
    "content" : "I thought this was sold but unfortunately the sale fell through at the last minute due to personal reasons on behalf of the buyer, and so I'm offering it up on the open market for the price I'd agreed with the previous purchaser. I know there are a lot of very rare Barndoors for sale in the UK this week, but this stands out as a very original example of a very early, first year production bus. Anyway, what's the harm in one more eh \n<img src=\"./images/smilies/smile.gif\" alt=\":-)\" title=\"Smile\"> \n<br>\n<br>•Type 21A Panel Van. \n<br>•Chassis number 20-8417. \n<br>•Built 10th Jan 1951 during the 8th month of full scale production making it the earliest 1951 VW van on the Barndoor.dk worldwide register, (full scale production started 22nd May 1950). \n<br>•Currently the 2nd oldest bus on the road in the UK, the 39th oldest VW van known to exist, and the 25th oldest panel known to exist. (the earliest 4 buses are in museums, as are quite a few of the 38 older vehicles. Volkswagen themselves have bought the most recent two first year production buses that are known to have been sold for their own private collection) \n<br>•Left the factory 15th Jan 1951 and was delivered to D'ieteren (vw agents since 1948 ) in Brussels. \n<br>•Welded front badge holes from the factory point to it being a logo'd panel like so many of it's time, although no other history is known of the first owner. \n<br>•The van stayed in Belgium with the second owner, until in 1959 he went to live in Greece, taking the van with him. \n<br>•The van was used by the second owner until 1979 when it went into retirement outside on the Greek island of Péloponnèse, to the South of Greece. \n<br>•Discovered still wearing the Belgian registration plate, (182AH), it was brought back to France where it remained untouched, and then later sold to Scotland where some of the paint was stripped but other than that it remained untouched. \n<br>•After a lengthy negotiation the van was bought by me in 2012, and underwent a sympathetic \"resurrection\" retaining as much of the original paint, metal and general integrity of the van as possible. The van is hugely original, with very few parts missing or having been replaced. All the wheels, seat, doors, decklid, valance, speedo, etc, etc are original to the bus which is very rare for such an old Volkswagen. \n<br>•The van is currently registered in the UK on an age related plate - 975UYE - and also has a current MOT certificate (although not required for pre-60 vehicles in the UK) \n<br>•Minimal rust repairs were needed for a van of its age, and everything undertaken used correct 50/51 panels including a specially made early panel cargo floor and early 50/51 doglegs. Following the welding work, which was all done by a certified welder and well renowned VW restorer, the underside was completely painted in original grey. \n<br>•The van has been \"preserved\" up top with some OG paint revealed and mostly OG primer on the interior. The work to uncover and blend this original paint is ongoing. \n<br>•Mechanically the van retains its original front beam and steering mechanism, although later 55-60 front drums coupled with a dual circuit braking system are used to offer better braking ability. \n<br>•The rear trans has been replaced with a later \"big nut\" trans for more practical use of the vehicle. Nothing has been changed that cannot easily be returned to stock and no metal has been cut or modified. \n<br>•All brakes, spindles, steering box, etc have been rebuild / refurbished and all new brake lines have been installed. \n<br>•A brand new and very good reproduction wiring loom has also been correctly installed. \n<br>•The original engine was not with the bus and it is currenty running a later 1600DP engine, with which I drove approx 5500 miles during 2014 including European trips to the BenPon, LeMans Classic and LeSpa shows. \n<br>\n<br>Feel free to contact me by PM, email or phone at any time if you wish to discuss the bus, request more photos, or to make an offer. I am based in Somerset, UK and the bus is available to view at any time. I can also help with shipping worldwide. \n<br>\n<br>£75000 ono\n<br>\n<br>\n<!-- m -->\n<a class=\"postlink\" href=\"http://www.thesamba.com/vw/classifieds/detail.php?id=1760879\">http://www.thesamba.com/vw/classifieds/ ... id=1760879</a>\n<!-- m -->\n<br>\n<br>Many thanks, \n<br>\n<br>Ben (\n<!-- e -->\n<a href=\"mailto:benlaughton@hotmail.co.uk\">benlaughton@hotmail.co.uk</a>\n<!-- e --> / 07742 408558)",
    "lastEdited" : "Fri Mar 06, 2015 12:10 am"
  }, {
    "postId" : "824891",
    "author" : {
      "username" : "49barndoor",
      "userId" : "Unknown",
      "joined" : "-",
      "profileRank" : "-",
      "location" : "-",
      "postCount" : "-",
      "avatarPath" : "http://i27.photobucket.com/albums/c163/49barndoor/80dfda76-39a9-4ba4-9840-de4798e9c89d_zpssmrtu9ne.jpg"
    },
    "content" : "WOW another one of my old buses hitting the open market, Looks great mate. Most folks will be thinking we all know something they don't \n<img src=\"./images/smilies/icon_lol.gif\" alt=\":lol:\" title=\"LOL\"> They could be right \n<img src=\"./images/smilies/icon_biggrin.gif\" alt=\":D\" title=\"Big Grin\">",
    "lastEdited" : "Fri Mar 06, 2015 12:38 am"
  }, {
    "postId" : "824892",
    "author" : {
      "username" : "busben",
      "userId" : "Unknown",
      "joined" : "-",
      "profileRank" : "-",
      "location" : "-",
      "postCount" : "-",
      "avatarPath" : null
    },
    "content" : "haha. Yeh maybe dude \n<img src=\"./images/smilies/icon_cool.gif\" alt=\"8)\" title=\"Cool\"> \n<br>\n<br>Of all the buses that have come and gone during the last 23 years of my life, I have to say that this is my favourite and will be the hardest to see driving off into the sunset. Needs must though, and I just hope this old girl ends up in a good home. \n<br>\n<br>Cheers Iain \n<img src=\"./images/smilies/icon_wink.gif\" alt=\":wink:\" title=\"Wink\">",
    "lastEdited" : "Fri Mar 06, 2015 12:43 am"
  }, {
    "postId" : "824909",
    "author" : {
      "username" : "51 vw",
      "userId" : "Unknown",
      "joined" : "-",
      "profileRank" : "-",
      "location" : "-",
      "postCount" : "-",
      "avatarPath" : null
    },
    "content" : "Amazing Bus, good luck with the sale ! \n<br>\n<br>Slightly worried everyone is selling their BDs though, mines only going to make room for another \n<img src=\"./images/smilies/icon_wink.gif\" alt=\":wink:\" title=\"Wink\">",
    "lastEdited" : "Fri Mar 06, 2015 8:37 am"
  }, {
    "postId" : "824913",
    "author" : {
      "username" : "busben",
      "userId" : "Unknown",
      "joined" : "-",
      "profileRank" : "-",
      "location" : "-",
      "postCount" : "-",
      "avatarPath" : null
    },
    "content" : "Thanks a lot dude. Yeh I heard a few whispers \n<img src=\"./images/smilies/icon_wink.gif\" alt=\":wink:\" title=\"Wink\"> Don't worry, I've got something else up my sleeve too \n<img src=\"./images/smilies/icon_twisted.gif\" alt=\":twisted:\" title=\"Twisted Evil\">",
    "lastEdited" : "Fri Mar 06, 2015 8:48 am"
  }, {
    "postId" : "824922",
    "author" : {
      "username" : "Dai",
      "userId" : "Unknown",
      "joined" : "-",
      "profileRank" : "-",
      "location" : "-",
      "postCount" : "-",
      "avatarPath" : "http://i205.photobucket.com/albums/bb320/jaralu/annieplug.jpg"
    },
    "content" : "<div class=\"quotetitle\">\n busben wrote:\n</div>\n<div class=\"quotecontent\">\n Thanks a lot dude. Yeh I heard a few whispers \n <img src=\"./images/smilies/icon_wink.gif\" alt=\":wink:\" title=\"Wink\"> Don't worry, I've got something else up my sleeve too \n <img src=\"./images/smilies/icon_twisted.gif\" alt=\":twisted:\" title=\"Twisted Evil\">\n</div>\n<br>\n<br>My sleeves are also dragging on the floor full of rusty sharp edges! \n<img src=\"./images/smilies/icon_lol.gif\" alt=\":lol:\" title=\"LOL\"> \n<br>\n<br>Love this van, was ace chasing it around Europe on some top road trips last year, hope it finds a deserving new home. \n<img src=\"./images/smilies/icon_cool.gif\" alt=\"8)\" title=\"Cool\">",
    "lastEdited" : "Fri Mar 06, 2015 10:14 am"
  } ]
}