{
  "forumId" : "51",
  "threadId" : "109076",
  "title" : "1962 Splitscreen panel van (Very Solid) (NOW SOLD)",
  "originalUrl" : "https://ssvc.org.uk/phpbb/viewtopic.php?f=51&t=109076",
  "breadcrumbs" : [ ],
  "totalPosts" : 1,
  "pageNumber" : 1,
  "totalPages" : 1,
  "posts" : [ {
    "postId" : "825873",
    "author" : {
      "username" : "I Do Campers",
      "userId" : "Unknown",
      "joined" : "-",
      "profileRank" : "-",
      "location" : "-",
      "postCount" : "-",
      "avatarPath" : "./download/file.php%3Favatar=39235_1423941190.jpg"
    },
    "content" : "<span style=\"color: #0000FF\">Re-advertised due to the biggest time waster I have ever had the unfortunate experience to deal with. But that's enough of that! </span>\n<br>\n<br>1962 LHD Panel Van. Dry state Cali import, She is very solid underneath,Engine bay etc, completely original and holds no surprises upon any inspection. LHD and comes with Stiftung AutoMuseum Volkswagen Certificate. Please contact me for details and I will be more than happy to supply you with any information you require. Looking for £8K. The spare parts alone are worth £1000's which you will get with the deal. Original Engine but stripped. Still on reduction boxes. Some metal fab required, I have a selection of parts to complete the body so all comes with bus. This bus is very very solid. Get in contact if you are genuinely interested and I will explain all. Please ask for additional photos for some of the parts available to assist in metal fab. Even have a choice of doors, if you prefer, I have glass frame cargo doors and also another set of Panel van doors as well as original doors. This is an amazingly solid bus. You will not be disappointed. The front panel was removed due to inspection of previous repair to A-Post and now shows unbelievable inner metal work which does not require changing due to rot. The lower valance for example is just amazing. New front panel and lower window frame section and original front panel comes with deal. Its not often you get to see whats lurking behind a front panel. This bus is genuine and holds no surprises. Even comes with a whole front end off another 66 split screen including Dash and Hand brake etc. I can photo any part of the bus on request. This bus holds no surprises. I am based in Wigan, Lancashire, UK. 07734 050156. Thank you for reading.",
    "lastEdited" : "Thu Mar 12, 2015 10:23 pm"
  } ]
}