{
  "forumId" : "51",
  "threadId" : "124950",
  "title" : "SOLD 1962 Gardena Gypsy VW / Volkswagen Splitscreen Campervan for Sale",
  "originalUrl" : "https://ssvc.org.uk/phpbb/viewtopic.php?f=51&t=124950",
  "breadcrumbs" : [ {
    "url" : "./viewforum.php?f=51&sid=20625c13d522c245ab2b9a51cb12a771",
    "label" : "Buses For Sale"
  } ],
  "totalPosts" : 6,
  "pageNumber" : 1,
  "totalPages" : 1,
  "posts" : [ {
    "postId" : "931270",
    "author" : {
      "username" : "Red Devil",
      "userId" : "931270",
      "joined" : "Mon Oct 18, 2004 2:41 pm",
      "profileRank" : "SSVC Member",
      "location" : "Lincolnshire",
      "postCount" : "1106",
      "avatarPath" : null
    },
    "content" : "For sale is our 1962 Gardena Gypsy VW Campervan. &nbsp;We’ve thought long and hard about this as I know I’ll never get another like it, but after 11 years of very happy ownership and endless family enjoyment and memories we feel it is the right time to consider moving on. &nbsp;As our children grow older the only way we can give them some of life’s other holiday experiences is to free up some funds and hence our decision to offer this for sale.\n<br> &nbsp;\n<br> As I have already said “Mousey” has been part of our family for the last 11 years and has been nothing but superb to own and drive. &nbsp;She was originally built in Germany in September 1961 (62 model year) and exported from Germany to California where she was garaged until 2007 when she was imported into the UK. &nbsp;I am the only registered keeper and owner in the UK. &nbsp;The structural integrity of this bus is fantastic, I never wanted a project as I just wanted to enjoy family adventures from the off. The upper body work had a respray well before it came to the UK because of fading paint and its original colour was Mouse Grey/Gray anyway. &nbsp;This is in very good condition overall with an odd mark that has been picked up over its lifetime. &nbsp;It is almost 59 years old after all!\n<br> &nbsp;\n<br> Perhaps the most obvious or rather very rare and stand out feature however is the Gardena Gypsy interior. &nbsp;I did manage to find one other person in the US who said they had an interior made by the same people but their van was in pieces and the interior not complete. &nbsp;To that end whilst I’m not 100% sure, this may be the only complete and usable one left in existence and as a result, it has featured in Camper &amp; Commercial magazine and David Eccles book on VW Camper Interiors (second edition). If anyone wants to see and read about it I may have pdf copies I can send. &nbsp;It is a really practical interior for camping with lots of storage. &nbsp;It has similarities to some of those produced for VW campers by EZ, Sundial or Riviera but the Gardena Gypsy badge and a few different things inside clearly make this unique. &nbsp;It also has the hump seat that was fitted to these campers in 1961/62.\n<br> &nbsp;\n<br> Being a US based 62 van it has the fried-egg indicators which started in the US on this model year ahead of the European versions which still had the bullet indicators. During my ownership I have replaced all the rubber seals as they had perished in the California sun, and also added a new Peter Good (of Volksgoods) wiring loom with European specification rear lights so that the safety of the amber indicators could be used. &nbsp;It is running on 12v. &nbsp;Most things I have changed I have done for safety as I’d never want to use a vehicle that wasn’t safe with my children inside. &nbsp;All of these can reasonably easily be returned to stock should you so wish however. &nbsp;These include, CSP front disc brake upgrade, dual circuit brake master cylinder, remote brake servo (VW Jim supplied), copper/nickel brake pipes, front and rear seat belts and an automatic fire extinguisher in the engine bay. &nbsp;I have also added six aluminium pop-outs from Creative Engineering. &nbsp;It is currently running what was an almost new VW Mexico 1600 engine which I purchased off a SSVC member in the UK and has never let us down. &nbsp;This runs an alternator and Pertronix electronic ignition and is fitted with standard distributor and 34-PICT-3 Solex Carb. &nbsp;It is coupled to a later big nut gearbox for slightly better ratios for motorway driving. &nbsp;Hence, it all stands at stock height with reduction boxes and nothing cut or messed with. &nbsp;The original small nut gearbox which ran fine will be included with the sale if the buyer wants it.\n<br> &nbsp;\n<br> To maintain the structural integrity, I did spend hours painting the underside and front cab floor in POR 15 paint. &nbsp;In doing so I stripped the arches and areas of the underside back to bare metal and followed the full preparation recommended for this. &nbsp;I have pictures which show the same wheel arch when I took it back to the very shiny original metal, painted the POR 15 originally and the very same location 11 years on (included where I have capacity to upload but can email if not attached to this advert). &nbsp;It really has held up very well and this has protected her from rust along with the fact that she is only used during the summer months and garaged otherwise. &nbsp;\n<br> &nbsp;\n<br> Although not technically required for historic vehicles in the UK I have always obtained an annual MOT. &nbsp;I have undertaken all mechanical work myself and also service the van annually. &nbsp;However, the MOT provides me with that additional independent check and confidence everything is ok. &nbsp;Although I could have had taken advantage of the 6 month “bonus” being added to MOTs because of the virus situation in the UK I still took it on its yearly anniversary in early July. &nbsp;Please feel free to look it up online and check the MOT history as it had no advisories and hasn’t required any major work at all during my ownership. &nbsp;In fact, I can only remember having to replace one wheel bearing and possibly a light bulb plus picking up minor advisories over the years of ownership! &nbsp;It therefore has a current MOT until July 2021. &nbsp;For anyone new to potential classic car ownership it is also tax exempt.\n<br> &nbsp;\n<br> Any new owner will I’m sure be very happy with this campervan. &nbsp;I am happy to help as best I can with overseas shipping by driving it to a port or shipping company if purchased by someone wanting to take it back to the US or similar. &nbsp;I can also drive it to the ferry if buying from a nearby European country. &nbsp;I am due to visit the Netherlands in it soon so if anyone wanting to view whilst I’m there would be welcome to do so. &nbsp;Of course I’d still like to see it out and about in the UK but recognise the desirability from anywhere potentially. &nbsp;\n<br> &nbsp;\n<br> I’m setting the price at £28,950 which I feel is fair given the condition and rarity but which recognises that this is a used and useable campervan not a show prepared vehicle. &nbsp;I have included some pictures to give a general feel and of course I can take more if you require specifics. &nbsp;I may already have them but I’m limited by the number I can upload. &nbsp;I have also taken a 10 minute walk around video which I will upload and can send link to for those genuinely interested.\n<br> &nbsp;\n<br> However, although a picture speaks a thousand words you can tell from the length of this advert that I can speak far more than a thousand words about this lovely van and so the only real way to see how good this really is will be to come and see it in real life and talk to me about it. &nbsp;I will be very open and honest about it and want it to go to someone who will love it as much as we do. &nbsp;Do therefore drop me a Personal Message/Text or email as I will respond to these if you have any questions or better still wish to come and view.",
    "lastEdited" : "Sun Jul 19, 2020 10:16 am"
  }, {
    "postId" : "931274",
    "author" : {
      "username" : "Wealswheels",
      "userId" : "931274",
      "joined" : "Tue Jul 07, 2020 6:43 pm",
      "profileRank" : "SSVC Member",
      "location" : "-",
      "postCount" : "3",
      "avatarPath" : null
    },
    "content" : "Hi\n<br> Lovely looking bus. Could be interested in viewing but was wondering where you are?\n<br> Cheers Mick",
    "lastEdited" : "Sun Jul 19, 2020 6:34 pm"
  }, {
    "postId" : "931278",
    "author" : {
      "username" : "Red Devil",
      "userId" : "931278",
      "joined" : "Mon Oct 18, 2004 2:41 pm",
      "profileRank" : "SSVC Member",
      "location" : "Lincolnshire",
      "postCount" : "1106",
      "avatarPath" : null
    },
    "content" : "That’s a bit of a flaw in the advert isn’t it. I think my profile still says Lincolnshire but you are right, having written an essay I can’t believe I missed that bit out! I am in a village on the outskirts of Lincoln. \n<br> \n<br> If it helps I’ve now uploaded the video which if the forum allows me to post A link to can be found at \n<a href=\"https://www.youtube.com/watch?v=zZKyT-Uc7KU\" class=\"postlink\">https://www.youtube.com/watch?v=zZKyT-Uc7KU</a> along with one of the engine warming up if you can find that through my user name on YouTube also. If you then decide you want to take a look let me know. I traveled a reasonable distance when I got this and always believe making a journey for the right bus is more than worth it, especially when spending so much money. At least with the video it will give you a good idea in advance to aid your decision. \n<br> \n<br> Cheers\n<br> \n<br> Steve",
    "lastEdited" : "Sun Jul 19, 2020 7:14 pm"
  }, {
    "postId" : "931279",
    "author" : {
      "username" : "Red Devil",
      "userId" : "931279",
      "joined" : "Mon Oct 18, 2004 2:41 pm",
      "profileRank" : "SSVC Member",
      "location" : "Lincolnshire",
      "postCount" : "1106",
      "avatarPath" : null
    },
    "content" : "Sorry, double post!",
    "lastEdited" : "Sun Jul 19, 2020 7:15 pm"
  }, {
    "postId" : "931283",
    "author" : {
      "username" : "Wealswheels",
      "userId" : "931283",
      "joined" : "Tue Jul 07, 2020 6:43 pm",
      "profileRank" : "SSVC Member",
      "location" : "-",
      "postCount" : "3",
      "avatarPath" : null
    },
    "content" : "Thanks Steve. Will pm you",
    "lastEdited" : "Sun Jul 19, 2020 8:25 pm"
  }, {
    "postId" : "931388",
    "author" : {
      "username" : "Red Devil",
      "userId" : "931388",
      "joined" : "Mon Oct 18, 2004 2:41 pm",
      "profileRank" : "SSVC Member",
      "location" : "Lincolnshire",
      "postCount" : "1106",
      "avatarPath" : null
    },
    "content" : "Sold. Going to a really good home which is a relief. \n<br> \n<br> Thanks for all the interest.",
    "lastEdited" : "Sat Jul 25, 2020 6:19 am"
  } ]
}