{
  "forumId" : "52",
  "threadId" : "112446",
  "title" : "VW internet business for sale",
  "originalUrl" : "https://ssvc.org.uk/phpbb/viewtopic.php?f=52&t=112446",
  "breadcrumbs" : [ ],
  "totalPosts" : 1,
  "pageNumber" : 1,
  "totalPages" : 1,
  "posts" : [ {
    "postId" : "848078",
    "author" : {
      "username" : "The Fordhams",
      "userId" : "848078",
      "joined" : "Wed Apr 23, 2003 10:01 am",
      "profileRank" : "Registered user",
      "location" : "Cambridgeshire",
      "postCount" : "514",
      "avatarPath" : "./download/file.php%3Favatar=111_1262637716.jpg"
    },
    "content" : "It looks like we'll be emigrating and so our UK based VW business is for sale. \n<br>\n<br>We have a hobby / small business ebay shop that we've run for 6 years - it has about 980 feedbacks of 100%. We can show the turnover on the ebay shop but its down to how much time and effort you put into finding and sourcing parts - home and abroad. The ebay shop has about £1k in stock right now and we have about another £500 waiting to be listed. At its peak we ship about 10 items a week - a kind of mom and pop operation that occupies a garden shed and about 2 hours a week to run. Margins are usually very good.\n<br>\n<br>We also have a blogging website busandcamper.com and about 6-10 VW domains all pointing to it. This main site used to host a magento shop but about 3 years ago ebay took over as the best place to sell so we closed the magento part and just show our ebay listings now. We use busandcamper for blogging now and use our ebay shop to buy and sell the VW parts. Google ranks busandcamper very well for a few things - eg vw soundproofing. So it could grow again to be something linked to that for example.\n<br>\n<br>\n<span style=\"font-weight: bold\">All for sale - £2000 including stock.</span>\n<br>\n<br>pm for contact details to chat over things.\n<br>\n<br>The link to the shop and blogging site are in the sig below",
    "lastEdited" : "Mon Sep 07, 2015 2:09 pm"
  } ]
}