{
  "forumId" : "55",
  "threadId" : "105212",
  "title" : "Cheltenham Caravan Retro Vintage Restoration Project Rare Pu",
  "originalUrl" : "https://ssvc.org.uk/phpbb/viewtopic.php?f=55&t=105212",
  "breadcrumbs" : [ ],
  "totalPosts" : 1,
  "pageNumber" : 1,
  "totalPages" : 1,
  "posts" : [ {
    "postId" : "799340",
    "author" : {
      "username" : "tomstokie",
      "userId" : "Unknown",
      "joined" : "-",
      "profileRank" : "-",
      "location" : "-",
      "postCount" : "-",
      "avatarPath" : null
    },
    "content" : "<!-- m -->\n<a class=\"postlink\" href=\"http://www.ebay.co.uk/itm/191299875265?ru=http%3A%2F%2Fwww.ebay.co.uk%2Fsch%2Fi.html%3F_from%3DR40%26_sacat%3D0%26_nkw%3D191299875265%26_rdc%3D1\">http://www.ebay.co.uk/itm/191299875265? ... 26_rdc%3D1</a>\n<!-- m -->\n<br>\n<br>This is a fantastic base caravan for a restoration.\n<br>\n<br>I believe it to be a 1967 PUKU 2 berth, with all original plates, very rare in the UK!!\n<br>\n<br>I bought this originally to tow behind my VW Splitscreen campervan but it is just a little too heavy for the old boy! I have since bought a lighter Eriba caravan.\n<br>\n<br>I went for this as there is no major damp and fantastic interior, I was going to paint and colour code the outside to match our van.\n<br>\n<br>\n<br>The caravan is in good condition but if it was me it does need a repaint outside. The current paint job aint the best but the caravan itself is very very straight!!\n<br>\n<br>Electrics are fully working and it still has the original cooker/fridge/sink but have not tested these altho the 240v hook is working perfectly. The leisure battery is dead but could be recharged....\n<br>\n<br>All units are intact as well as the table and a new carpet has been fitted.\n<br>\n<br>It looks to me this went through a restoration a few years ago and new rubber seals fitted all around. The cooker / sink / windows are in really good condition!!\n<br>\n<br>One of the legs is very very stiff and will need attention and the key is missing for one of the doors. There is a spare door included in the sale as well as the following:-\n<br>\n<br>Bin\n<br>Vintage Porta-loo\n<br>Cooker\n<br>Sink\n<br>Cooker\n<br>Bowl\n<br>240v\n<br>Several plugs\n<br>Extra door.\n<br>\n<br>I have more photos available to people and I would say the paintwork most definitely needs attention altho could be used as is!\n<br>\n<br>The caravan is available for viewing and would recommend you nip and see it!!\n<br>\n<br>£150 deposit within 24 hrs of listing finishing!!!",
    "lastEdited" : "Sun Aug 24, 2014 3:59 pm"
  } ]
}