{
  "forumId" : "6",
  "threadId" : "46624",
  "title" : "Fitting of drop spindles, advice please??",
  "originalUrl" : "https://ssvc.org.uk/phpbb/viewtopic.php?f=6&t=46624&start=0&st=0&sk=t&sd=a",
  "breadcrumbs" : [ ],
  "totalPosts" : 11,
  "pageNumber" : 1,
  "totalPages" : 1,
  "posts" : [ {
    "postId" : "354694",
    "author" : {
      "username" : "carole",
      "userId" : "Unknown",
      "joined" : "-",
      "profileRank" : "-",
      "location" : "-",
      "postCount" : "-",
      "avatarPath" : null
    },
    "content" : "Hiya all....\n<br>\n<br>I'm looking into fitting dropped spindles (the 2.5\" ones) to my bus, with a CSP disc kit.\n<br>\n<br>At the rear I'm going to drop it by one spline.\n<br>\n<br>I've read a few threads on this, but I can't seem to fathom out whether or not I will still need to fit adjustors to the beam so as to 'level' the bus out, once it has been dropped one spline at the back..... \n<img src=\"./images/smilies/icon_confused.gif\" alt=\":?\" title=\"Confused\"> \n<img src=\"./images/smilies/icon_confused.gif\" alt=\":?\" title=\"Confused\"> \n<br>\n<br>My bus is a 67 btw.\n<br>\n<br>Any advice anyone, or even better, pics of it being done to other members' vans?\n<br>\n<br>Cheers all..... \n<img src=\"./images/smilies/icon_thumright.gif\" alt=\":thumbleft:\" title=\"thumbleft\">",
    "lastEdited" : "Mon Sep 22, 2008 8:41 pm"
  }, {
    "postId" : "354727",
    "author" : {
      "username" : "chalksplit",
      "userId" : "Unknown",
      "joined" : "-",
      "profileRank" : "-",
      "location" : "-",
      "postCount" : "-",
      "avatarPath" : "http://i88.photobucket.com/albums/k197/chalksplit/DSC00141_2-1.jpg"
    },
    "content" : "Hi ya\n<br>Mine is lowered with dropped spindles and 1 spline at the rear, look at the avatar, it is slightly nose down. \n<img src=\"./images/smilies/icon_biggrin.gif\" alt=\":D\" title=\"Big Grin\">\n<br>I am sure someone will pop along soon with a better pic.",
    "lastEdited" : "Mon Sep 22, 2008 9:58 pm"
  }, {
    "postId" : "355059",
    "author" : {
      "username" : "jmcc",
      "userId" : "Unknown",
      "joined" : "-",
      "profileRank" : "-",
      "location" : "-",
      "postCount" : "-",
      "avatarPath" : null
    },
    "content" : "Mine is also drop-spindled at the front with one spline on the rear. Slight nose-down stance with a home made camping interior assisting the lowering at the back! Here it is:\n<br>\n<br>\n<img src=\"http://i59.photobucket.com/albums/g311/jmcc500/Split/IMG_3706.jpg\" alt=\"Image\">",
    "lastEdited" : "Tue Sep 23, 2008 9:35 pm"
  }, {
    "postId" : "355118",
    "author" : {
      "username" : "carole",
      "userId" : "Unknown",
      "joined" : "-",
      "profileRank" : "-",
      "location" : "-",
      "postCount" : "-",
      "avatarPath" : null
    },
    "content" : "Great pic jmcc \n<img src=\"./images/smilies/icon_biggrin.gif\" alt=\":D\" title=\"Big Grin\"> \n<br>\n<br>And your van is exactly the same colour combo as mine too, so that helps a bit if you know what I mean...\n<br>\n<br>Thanks for posting the photo, that's really useful. You may have seen the other thread 'cheap way to lower', which has pulled up some very interesting points about looks and ride quality etc.\n<br>\n<br>Dare I ask....what is your view on the drive quality now it's been lowered?\n<br>\n<br>Many thanks....\n<br>\n<br>Carole \n<img src=\"./images/smilies/icon_biggrin.gif\" alt=\":D\" title=\"Big Grin\">",
    "lastEdited" : "Wed Sep 24, 2008 6:42 am"
  }, {
    "postId" : "355120",
    "author" : {
      "username" : "57aircooled",
      "userId" : "Unknown",
      "joined" : "-",
      "profileRank" : "-",
      "location" : "-",
      "postCount" : "-",
      "avatarPath" : "http://i5.photobucket.com/albums/y195/aircooled72/IMG_0959.jpg"
    },
    "content" : "im sure my flipped spindles were 3.5\" ??",
    "lastEdited" : "Wed Sep 24, 2008 6:47 am"
  }, {
    "postId" : "355130",
    "author" : {
      "username" : "vwjim",
      "userId" : "Unknown",
      "joined" : "-",
      "profileRank" : "-",
      "location" : "-",
      "postCount" : "-",
      "avatarPath" : "http://193.0.234.78/143005000704.jpg"
    },
    "content" : "All K&amp;LP DS are 3.5\"",
    "lastEdited" : "Wed Sep 24, 2008 7:47 am"
  }, {
    "postId" : "355152",
    "author" : {
      "username" : "carole",
      "userId" : "Unknown",
      "joined" : "-",
      "profileRank" : "-",
      "location" : "-",
      "postCount" : "-",
      "avatarPath" : null
    },
    "content" : "<div class=\"quotetitle\">\n 57aircooled wrote:\n</div>\n<div class=\"quotecontent\">\n im sure my flipped spindles were 3.5\" ??\n</div>\n<br>\n<br>There the ones I meant.... \n<img src=\"./images/smilies/icon_redface.gif\" alt=\":oops:\" title=\"Red Face\"> \n<img src=\"./images/smilies/icon_rolleyes.gif\" alt=\":roll:\" title=\"Roll Eyes\"> \n<br>\n<br>Carole",
    "lastEdited" : "Wed Sep 24, 2008 9:34 am"
  }, {
    "postId" : "355320",
    "author" : {
      "username" : "Tom1964bus",
      "userId" : "Unknown",
      "joined" : "-",
      "profileRank" : "-",
      "location" : "-",
      "postCount" : "-",
      "avatarPath" : null
    },
    "content" : "JMCC firstly lovely bus! what size wheels and tyres are you running? thanks.",
    "lastEdited" : "Wed Sep 24, 2008 8:11 pm"
  }, {
    "postId" : "355357",
    "author" : {
      "username" : "jmcc",
      "userId" : "Unknown",
      "joined" : "-",
      "profileRank" : "-",
      "location" : "-",
      "postCount" : "-",
      "avatarPath" : null
    },
    "content" : "Thanks for nice comments!\n<br>\n<br>Firstly, my thoughts on lowering for Carole. I had 2 reasons to lower - one was looks, the other was simply the matter of getting it in the garage - it would not fit at normal height! However, if I were to start again I think I would stick to stock and modify the garage!\n<br>\n<br>The problems with lowering that I have found are as follows:\n<br>\n<br>Unless you narrow the beam (and therefore have heavily inset wheels and possibly a weak point in your vehicle, not something I personally want), you are advised to run something like a 'slam' tyre, particularly with 15\" wheels which are required for the basic CSP disc kit. The problem with these very low profile tyres are two-fold. Firstly, the ride quality suffers as there is no 'spring' in the sidewalls, and secondly you are so close to the ground that your steering box bottoms out on the ground at the slightest provocation. I know many on here take pride in scraping their boxes along the road, but to me the feeling was awful - slightly improved by fitting a guard, but still unpleasant. I lasted about 2 weeks on 'slam' tyres...\n<br>\n<br>I replaced those ultra-low profile tyres with a pair of 165/65R15 tyres (Conti Eco Contacts if you're interested). With these tyres I can't remember the last time I bottomed the steering box out, but the tyres will rub on the arches over large bumps. Not so much as to show any physical damage, but again not really pleasant. In order to minimise this, I upgraded the shocks to KYBs, but then this came at the expense of ride quality!\n<br>\n<br>Having tried my best to get a good compromise at a lower than standard height, I really have come to the conclusion that either you need to go the whole hog with a narrowed beam from a reputable supplier, or stick to stock height. The only other thing I am contemplating is refurbishing my original 14\" wheels and trying them with some higher profile tyres to try and get some more compliance. Of course, if you're going for discs the chances are you are on (or will be on) 15\" wheels...\n<br>\n<br>In summary, I am now in favour of stock, particularly if you're going to drive your bus a lot - we drove to Spain and back last summer and it would have been much more pleasant to have been 3.5\"s higher, particularly on some of the not so good Spanish roads!\n<br>\n<br>Tom1964bus - as you may have gathered, they are 15\" wheels, though my '64 bus should be on 14\"s as mentioned above!\n<br>\n<br>Last point to Carole (and apologies if someone else has already said this) - are you sure you want to go to the expense of discs? The drums are perfectly good unless you are going up and down mountains on a regular basis (and even then drums are not necessarily a problem if you use engine braking). My better half has trouble driving my split because of the braking effort - I am thinking of a servo to reduce this, but will stick to drums unless I get round to a serious power upgrade...",
    "lastEdited" : "Wed Sep 24, 2008 9:39 pm"
  }, {
    "postId" : "355358",
    "author" : {
      "username" : "jmcc",
      "userId" : "Unknown",
      "joined" : "-",
      "profileRank" : "-",
      "location" : "-",
      "postCount" : "-",
      "avatarPath" : null
    },
    "content" : "Oh - if you're coming to Brighton Breeze (or are ever in Brighton) then give me a shout and I'll give you a run in the bus at it's current height - then you can judge for yourself!",
    "lastEdited" : "Wed Sep 24, 2008 9:42 pm"
  }, {
    "postId" : "355409",
    "author" : {
      "username" : "carole",
      "userId" : "Unknown",
      "joined" : "-",
      "profileRank" : "-",
      "location" : "-",
      "postCount" : "-",
      "avatarPath" : null
    },
    "content" : "jmcc\n<br>\n<br>Thankyou for taking the time to reply \n<img src=\"./images/smilies/icon_lol.gif\" alt=\":lol:\" title=\"LOL\"> \n<img src=\"./images/smilies/icon_lol.gif\" alt=\":lol:\" title=\"LOL\"> \n<br>\n<br>Well that's it then, stock it is. As I said in a previous post, 'Stock is the new black' \n<img src=\"./images/smilies/icon_cool.gif\" alt=\"8)\" title=\"Cool\"> \n<br>\n<br>I kinda guessed that your views on the lowering qualities would be as you said. My last split was lowered by way of adjustors on the front with a single spline front at the rear (and IRS) and whilst it looked great, on a long journey, particularly around country roads it wasn't always so pleasant to drive! And it probably wasn't quite as low as it would have been had I fitted dropped spindles, which is another point, as I'm concerned about the 'nose down' stance you get with spindles.\n<br>\n<br>And yes, we do intend to tour around in the split, with the next purchase hopefully an Eriba Familia. Which of course brings a whole new dimension to lowering as I've discovered in the past, because if your bus isn't stock height the fitting of a towbar is another problem! Not to mention the towing height of the caravan.\n<br>\n<br>The more I discover from others about the whole lowering issue then the more complicated it becomes; the reasons for 'against' rather than 'for' are stacking up!\n<br>\n<br>And yes, the disc vs drums correctly set up issue is a good one, however if I am going to be towing then discs may be better? If I don't spend the money on the lowering then the cost of the discs won't seem so bad.... \n<img src=\"./images/smilies/icon_rolleyes.gif\" alt=\":roll:\" title=\"Roll Eyes\"> \n<br>\n<br>So, back to the other point discussed in this thread, 15\" rims on my '67 as opposed to the standard 14\" rims, so as to reduce the gap in the wheel arches and improve the gearing.\n<br>\n<br>Sweet Rides, do you have that photo available for posting? \n<img src=\"./images/smilies/icon_cool.gif\" alt=\"8)\" title=\"Cool\"> \n<br>\n<br>We will be at BB so PM me your number and I'll come and find you!\n<br>\n<br>Many thanks again,\n<br>\n<br>Carole \n<img src=\"./images/smilies/icon_wink.gif\" alt=\":wink:\" title=\"Wink\">",
    "lastEdited" : "Thu Sep 25, 2008 4:36 am"
  } ]
}