{
  "forumId" : "6",
  "threadId" : "97496",
  "title" : "seat belts",
  "originalUrl" : "https://ssvc.org.uk/phpbb/viewtopic.php?f=6&t=97496",
  "breadcrumbs" : [ {
    "url" : "./viewforum.php?f=6&sid=9359f708aa9adc0f626ce1637f8e3743",
    "label" : "Technical"
  } ],
  "totalPosts" : 10,
  "pageNumber" : 1,
  "totalPages" : 1,
  "posts" : [ {
    "postId" : "745875",
    "author" : {
      "username" : "jayvanman",
      "userId" : "745875",
      "joined" : "Tue Aug 19, 2008 10:21 am",
      "profileRank" : "Registered user",
      "location" : "Bristol",
      "postCount" : "3259",
      "avatarPath" : "./download/file.php%3Favatar=28832_1285795027.jpg"
    },
    "content" : "I have come to fit cab seat belts in my camper.\n<br> \n<br> trouble is i took 2 of the original ones out and fitted them to another bus and they are now gone.\n<br> \n<br> I have a 1/3 + 2/3 front seat set up.\n<br> \n<br> I have found one part of a lap belt - the bit with the flip out wolfberg buckle on it - I think this is bolted in and I also have 2(?) parts that clip into this but there is no metal loop at the end to bolt to the camper, it's just the webbing. these two pieces look like they were together at the webbing end and folded over and then back again.\n<br> \n<br> just to confuse matters more - and before i go into this, please bear in mind the last owner was a hippy and it sat on his drive for 25 years before i got it , so there's no telling what short cuts were made back in the day.\n<br> \n<br> so just to confuse matters there's a GM seat belt and although I havent quite figured it out I think teh PO got the 2 OG belts and threaded them through the GM bolt up part and then had 3 lap belts in the front - as I say 2 lap belts have gone.\n<br> \n<br> so what was the OG set up on the 1/3 + 2/3 as I'd like to put it back to \"normal\"\n<br> \n<br> was it 2 lap blts but one had an extender for the 2/3 seat or was there 2 belts for that seat ?\n<br> \n<br> Thanks for you help.\n<br> \n<br> Jason",
    "lastEdited" : "Tue Sep 10, 2013 10:45 pm"
  }, {
    "postId" : "745879",
    "author" : {
      "username" : "split999",
      "userId" : "745879",
      "joined" : "Thu Apr 20, 2006 11:11 pm",
      "profileRank" : "SSVC Member",
      "location" : "S.E. Kent.",
      "postCount" : "2287",
      "avatarPath" : null
    },
    "content" : "It really depends what year your van is. \n<br> \n<br> Lap belts are only legal up to a certain year and off the to of my head I haven't a clue maybe early 70's? After that its static three point or inertia.",
    "lastEdited" : "Tue Sep 10, 2013 11:29 pm"
  }, {
    "postId" : "745883",
    "author" : {
      "username" : "jayvanman",
      "userId" : "745883",
      "joined" : "Tue Aug 19, 2008 10:21 am",
      "profileRank" : "Registered user",
      "location" : "Bristol",
      "postCount" : "3259",
      "avatarPath" : "./download/file.php%3Favatar=28832_1285795027.jpg"
    },
    "content" : "1966",
    "lastEdited" : "Wed Sep 11, 2013 5:52 am"
  }, {
    "postId" : "745958",
    "author" : {
      "username" : "DOUGAL",
      "userId" : "745958",
      "joined" : "Thu Apr 06, 2006 3:13 pm",
      "profileRank" : "SSVC Member",
      "location" : "Oxford",
      "postCount" : "1453",
      "avatarPath" : "./download/file.php%3Favatar=2243_1530277201.jpg"
    },
    "content" : "I think it also depends on where your bus is from. From memory in the UK seatbelts were required before they did in the States but not 100% sure.\n<br> \n<br> From wiki:\n<br> \n<em class=\"text-italics\">In the UK, a requirement for anchorage points was introduced in 1965, followed by the requirement in 1968 to fit three-point belts in the front outboard positions on all new cars and all existing cars back to 1965.</em>\n<br> \n<br> I'll see if I can find more info tonight.\n<br> \n<br> Cheers,\n<br> Gertjan",
    "lastEdited" : "Wed Sep 11, 2013 3:27 pm"
  }, {
    "postId" : "745977",
    "author" : {
      "username" : "e m p i",
      "userId" : "745977",
      "joined" : "Fri Jan 28, 2005 3:51 pm",
      "profileRank" : "Registered user",
      "location" : "Essex but I'm nothing like the twats on the telly.",
      "postCount" : "5515",
      "avatarPath" : "./download/file.php%3Favatar=1186_1407682968.jpg"
    },
    "content" : "Pre 1st Jan 1965 you didnt need seatbelts or even ancorage points for seatbelts. \n<br> Only anchorage points on needed on post 1st Jan 1965 vehicles but you still dont need seatbelts until......\n<br> \n<br> Seat belts are only needed on post 1st April 1981 vehicles. So most of our Dubs don't even need them! And even then - you didn't have to actually wear them for many years after………………So if your vehcile was produced before 1st April 1981 you dont actually have to have anything and if you wanted to you could have a bit of rope as there is no requirement at all except that you have mounting points (if the vehicle was produced after 1st Jan 1965) However if they were fitted when the vehcile was manufactured you still need to have them. \n<strong class=\"text-strong\">So basically given that your van is a 1966, if you want you can have nothing, lap belts, 3 point static, 3 point intertia, race harnesses. </strong> \n<br> \n<br> If you're bored or having trouble sleeping have a read of this.....\n<br> \n<br> Sections 46-48 , Road Vehicles (Construction &amp; Use ) Regulations 1986 deals with fitment of seat belt anchorage points (46), fitment of seat belts (47) and maintenance of both (48).\n<br> \n<br> To precis below: \n<br> Seat belt anchorage points 46.\n<br> (1) Save as provided by paragraph (2), this regulation applies to—\n<br> (a)every wheeled motor car first used on or after 1st January 1965; and\n<br> (b)every three-wheeled motor cycle the unladen weight of which exceeds 255 kg and which was first used on or after 1st September 1970.\n<br> (2) This regulation does not apply to—\n<br> (a)a goods vehicle (other than a dual-purpose vehicle) which was first used— \n<br> (i) before 1st April 1967; or\n<br> (ii) on or after 1st April 1980 and has a maximum gross weight in Great Britain (determined in accordance with the provisions of Schedule 11) exceeding 3500 kg; or\n<br> (iii) before 1st April 1980 or, if the vehicle is of a model manufactured before 1st October 1979, was first used before 1st April 1982 and, in either case, has an unladen weight exceeding 1525 kg;\n<br> (b)a passenger or dual-purpose vehicle constructed or adapted to carry more than twelve passengers exclusive of the driver;\n<br> (c)an agricultural motor vehicle;\n<br> (d)an industrial tractor;\n<br> (e)a works truck;\n<br> (f)an electrically-propelled goods vehicle;\n<br> (g)a pedestrian-controlled vehicle;\n<br> (h)a vehicle which has been used on roads outside Great Britain and has been imported into Great Britain, whilst it is being driven from the place where it has arrived in Great Britain to a place of residence of the owner or driver of the vehicle, or from any such place to a place where, by previous arrangement, it will be provided with such anchorage points as are required by this regulation and such seat belts as are required by regulation 47; \n<br> (i)a vehicle which is incapable by reason of its construction of exceeding a speed of 16 mph on the level under its own power; or\n<br> (j)a motor cycle equipped with a driver's seat of a type requiring the driver to sit astride it, and which is constructed or assembled by a person not ordinarily engaged in the trade or business of manufacturing vehicles of that description. \n<br> (3) A vehicle which was first used before 1st April 1982 shall be equipped with anchorage points which are designed to hold securely in position on the vehicle seat belts for the driver's seat and specified passenger's seat (if any).\n<br> (4) A vehicle which is first used on or after 1st April 1982 shall be equipped with anchorage points which—\n<br> (a)are designed to hold securely in position on the vehicle seat belts for— \n<br> (i) in the case of a bus, a motor ambulance or a motor caravan, the driver's seat and the specified passenger's seat (if any); and\n<br> (ii) in any other case, every forward-facing seat constructed or adapted to accommodate one adult, and\n<br> (b)comply with Community Directive 76/115 or 81/575 or 82/318 or ECE Regulation 14 whether or not those instruments apply to the vehicle, so however, that the requirements in those instruments which relate to testing shall not apply.\n<br> (5) A vehicle of a type mentioned in paragraph (4)(a)(i), which is first fitted with anchorage points for seats other than the driver's and the specified passenger's (if any) on or after 1st April 1986 shall comply with the requirements in paragraph (4)(b) in respect of such additional anchorage points as well as those required by paragraph (4)(a)(i) to be provided.\n<br> (6) In this regulation—\n<br> (a)the expressions “forward-facing seat”, “seat belt” and “specified passenger's seat” have the same meaning as in regulation 47(8); and\n<br> (b)the expression “motor caravan” has the same meaning as in regulation 2(2) of the Type Approval (Great Britain) Regulations.\n<br> \n<br> Seat belts 47.\n<br> (1) This regulation applies to every vehicle to which regulation 46 applies.\n<br> (2) Save as provided in paragraph (4) a vehicle to which—\n<br> (a)this regulation applies which was first used before 1st April 1981 shall be provided with—\n<br> (i) a body-restraining seat belt, designed for use by an adult, for the driver's seat; and\n<br> (ii) a body-restraining seat belt for the specified passenger's seat (if any); \n<br> (b)this regulation applies which is first used on or after 1st April 1981 shall be provided with three-point seat belts for the driver's seat and for the specified passenger's seat (if any);\n<br> (c)regulation 46(4)(a)(ii) applies which is first used on or after 1st April 1987 shall be fitted with seat belts additional to those required by sub-paragraph (b) as follows—\n<br> (i) for any forward-facing front seat alongside the driver's seat, not being a specified passenger's seat, a seat belt which is a three-point belt, or a lap belt installed in accordance with paragraph 3.1.2.1 of Annex 1 to Community Directive 77/541 or a disabled person's belt; \n<br> (ii) in the case of a passenger or dual-purpose vehicle having not more than two forward-facing seats behind the driver's seat with either—\n<br> (A) an inertia reel belt for at least one of those seats, or\n<br> (B) a three-point belt, a lap belt, a disabled person's belt or a child restraint for each of those seats;\n<br> (iii) in the case of a passenger or dual-purpose vehicle having more than two forward-facing seats behind the driver's seat, with either—\n<br> (A) an inertia reel belt for one of those seats being an outboard seat and a three-point belt, a lap belt, a disabled person's belt or a child restraint for at least one other of those seats;\n<br> (B) a three-point belt for one of those seats and either a child restraint or a disabled person's belt for at least one other of those seats; or\n<br> (C) a three-point belt, a lap belt, a disabled person's belt or a child restraint for each of those seats.\n<br> (3) Every seat belt for an adult, other than a disabled person's belt, provided for a vehicle in accordance with paragraph (2)(b) or (c) shall, except as provided in paragraph (6), comply with the installation requirements specified in paragraph 3.2.2 to 3.3.4 of Annex I to Community Directive 77/541 whether or not that Directive applies to the vehicle.\n<br> (4) The requirements specified in paragraph (2) do not apply—\n<br> (a)to a vehicle while it is being used under a trade licence within the meaning of section 16 of the 1971 Act;\n<br> (b)to a vehicle, not being a vehicle to which the Type Approval (Great Britain) Regulations apply, while it is being driven from premises of the manufacturer by whom it was made, or of a distributor of vehicles or dealer in vehicles— \n<br> (i) to premises of a distributor of or dealer in vehicles or of the purchaser of the vehicle, or\n<br> (ii) to premises of a person obtaining possession of the vehicle under a hiring agreement or hire-purchase agreement;\n<br> (c)in relation to any seat for which there is provided—\n<br> (i) a seat belt which bears a mark including the specification number of the British Standard for Passive Belt Systems, namely BS AU 183:1983 and including the registered certification trade mark of the British Standards Institution; or\n<br> (ii) a seat belt designed for use by an adult which is a harness belt comprising a lap belt and shoulder straps which bears a British Standard mark or a mark including the specification number for the British Standard for Seat Belt Assemblies for Motor Vehicles, namely BS 3254:1960 and including the registered certification trade mark of the British Standards Institution, or the marking designated in item 16 in Schedule 2 to the Approval Marks Regulations;\n<br> (d)in relation to the driver's seat or the specified passenger's seat (if any) of a vehicle which has been specially designed and constructed, or specially adapted, for the use of a person suffering from some physical defect or disability, in a case where a disabled person's belt for an adult person is provided for use for that seat.\n<br> (5) Every seat belt provided in pursuance of paragraph (2) shall be properly secured to the anchorage points provided for it in accordance with regulation 46; or, in the case of a child restraint, to anchorages specially provided for it or, in the case of a disabled person's belt, secured to the vehicle or to the seat which is being occupied by the person wearing the belt.\n<br> (6) Paragraph (3), in so far as it relates to the second paragraph of paragraph 3.3.2 of the Annex there mentioned (which concerns the locking or releasing of a seat belt by a single movement) does not apply in respect of a seat belt fitted for—\n<br> (a)a seat which is treated as a specified passenger's seat by virtue of the provisions of sub-paragraph (ii) in the definition of “specified passenger's seat” in paragraph (8); or\n<br> (b)any forward-facing seat for a passenger alongside the driver's seat of a goods vehicle which has an unladen weight of more than 915 kg and has more than one such seat, any such seats for passengers being joined together in a single structure.\n<br> (7) Every seat belt, other than a disabled person's belt or a seat belt of a kind mentioned in paragraph 4(c)(i) or (ii) above, provided for any person in a vehicle to which this regulation applies shall be legibly and permanently marked—\n<br> (a)if the vehicle was first used before 1st April 1981 or if the belt is a child restraint, with a British Standard mark or a designated approval mark; or \n<br> (b)in any other case, with a designated approval mark.\n<br> Provided this paragraph shall not operate so as to invalidate the exception permitted in paragraph (6). \n<br> (8) In this regulation—\n<br> “body-restraining seat belt” means a seat belt designed to provide restraint for both the upper and lower parts of the trunk of the wearer in the event of an accident to the vehicle;\n<br> “British Standard mark” means a mark consisting of— \n<br> (i)the specification number of one of the following British Standards for Seat Belt Assemblies for Motor Vehicles, namely—\n<br> (a)if it is a seat belt for an adult, BS 3254; 1960 and BS AU 160a or 160b; or\n<br> (b)if it is a child restraint, BS 3254:1960, BS AU 157 or 157a, BS AU 185, BS AU 186 or 186a, BS AU 202; and, in either case,\n<br> (ii)the registered certification trade mark of the British Standards Institution; \n<br> “child restraint” means a seat belt for the use of a young person which is designed either to be fitted directly to a suitable anchorage or to be used in conjunction with a seat belt for an adult and held in place by the restraining action of that belt: Provided that for the purposes of paragraph (2) (c)(ii)(B) and (2)(c)(iii) it means only such seat belts fitted directly to a suitable anchorage and excludes belts marked with the specification numbers BS AU 185 and BS AU 186 or 186a. \n<br> “designated approval mark” means\n<br> (a)if it is a seat belt other than a child restraint, the marking designated as an approval mark by regulation 4 of the Approval Marks Regulations and shown at item 16 of Schedule 2 to those Regulations or the marking designated as an approval mark by regulation 5 of those Regulations and shown at item 23 and 23A in Schedule 4 to those Regulations, and\n<br> (b)if it is a child restraint, either of the markings designated as approval marks by regulation 4 of those Regulations and shown at item 44 and 44A in Schedule 2 to those Regulations. \n<br> “disabled person's belt” means a seat belt which has been specially designed or adapted for use by an adult or young person suffering from some physical defect or disability and which is intended for use solely by such a person;\n<br> “forward-facing seat” means a seat which is attached to a vehicle so that it faces towards the front of the vehicle in such a manner that a line passing through the centre of both the front and the back of the seat is at an angle of 30° or less to the longitudinal axis of the vehicle;\n<br> “inertia reel belt” means a three-point belt of either of the types required for a front outboard seating position by paragraph 3.1.1. of Annex 1 to Community Directive 77/541;\n<br> “lap belt” means a seat belt which passes across the front of the wearer's pelvic region;\n<br> “seat” includes any part designed for the accommodation of one adult of a continuous seat designed for the accommodation of more than one adult;\n<br> “seat belt” means a belt intended to be worn by a person in a vehicle and designed to prevent or lessen injury to its wearer in the event of an accident to the vehicle and includes, in the case of a child restraint, any special chair to which the belt is attached;\n<br> “specified passenger's seat” means— \n<br> (i)in the case of a vehicle which has one forward-facing front seat alongside the driver's seat, that seat, and in the case of a vehicle which has more than one such seat, the one furthest from the driver's seat; or\n<br> (ii)if the vehicle normally has no seat which is the specified passenger's seat under sub-paragraph (i) of this definition the forward-facing front seat for a passenger which is foremost in the vehicle and furthest from the driver's seat, unless there is a fixed partition separating that seat from the space in front of it alongside the driver's seat; \n<br> and\n<br> “three-point belt” means a seat belt which— \n<br> (i)restrains the upper and lower parts of the torso;\n<br> (ii)includes a lap belt;\n<br> (iii)is anchored at not less than three points; and\n<br> (iv)is designed for use by an adult. \n<br> \n<br> Maintenance of seat belts and anchorage points 48. \n<br> (1) This regulation applies to every seat belt with which a motor vehicle is required to be provided in accordance with regulation 47 and to the anchorages, fastenings, adjusting device and retracting mechanism (if any) of every such seat belt.\n<br> (2) For the purposes of this regulation the anchorages and anchorage points of a seat belt shall, in the case of a seat which incorporates integral seat belt anchorages, include the system by which the seat assembly itself is secured to the vehicle structure.\n<br> (3) The anchorage points provided for seat belts shall be used only as anchorages for the seat belts for which they are intended to be used or capable of being used.\n<br> (4) Save as provided in paragraph (5) below—\n<br> (a)all load-bearing members of the vehicle structure or panelling within 30 cms of each anchorage point shall be maintained in a sound condition and free from serious corrosion, distortion or fracture;\n<br> (b)the adjusting device and (if fitted) the retracting mechanism of the seat belt shall be so maintained that the belt may be readily adjusted to the body of the wearer, either automatically or manually, according to the design of the device and (if fitted) the retracting mechanism;\n<br> (c)the seat belt and its anchorages, fastenings and adjusting device shall be maintained free from any obvious defect which would be likely to affect adversely the performance by the seat belt of the function of restraining the body of the wearer in the event of an accident to the vehicle;\n<br> (d)the buckle or other fastening of the seat belt shall—\n<br> (i) be so maintained that the belt can be readily fastened or unfastened;\n<br> (ii) be kept free from any temporary or permanent obstruction; and\n<br> (iii) except in the case of a disabled person's seat belt, be readily accessible to a person sitting in the seat for which the seat belt is provided;\n<br> (e)the webbing or other material which forms the seat belt shall be maintained free from cuts or other visible faults (as, for example, extensive fraying) which would be likely to affect adversely the performance of the belt when under stress;\n<br> (f)the ends of every seat belt, other than a disabled person's seat belt, shall be securely fastened to the anchorage points provided for them; and\n<br> (g)the ends of every disabled person's seat belt shall, when the seat belt is being used for the purpose for which it was designed and constructed, be securely fastened either to some part of the structure of the vehicle or to the seat which is being occupied by the person wearing the belt so that the body of the person wearing the belt would be restrained in the event of an accident to the vehicle.\n<br> (5) No requirement specified in paragraph (4) above applies if the vehicle is being used— \n<br> (a)on a journey after the start of which the requirement ceased to be complied with; or\n<br> (b)after the requirement ceased to be complied with and steps have been taken for such compliance to be restored with all reasonable expedition.\n<br> (6) Expressions which are used in this regulation and are defined in regulation 47 have the same meaning in this regulation as they have in regulation 47. \n<br> \n<br> shalom, Lee......if you're still awake!!!",
    "lastEdited" : "Wed Sep 11, 2013 5:31 pm"
  }, {
    "postId" : "745988",
    "author" : {
      "username" : "type21f",
      "userId" : "745988",
      "joined" : "Tue May 29, 2007 12:55 pm",
      "profileRank" : "SSVC Member",
      "location" : "West Yorkshire",
      "postCount" : "15631",
      "avatarPath" : null
    },
    "content" : "Comment before I read your diatribe, but a splitscreen van is not a car...it was termed a commercial vehicle...\n<br> LOL\n<br> I believe I have had this discussion many times...\n<br> A van did not need to have them before 1968...\n<br> Pipe and slippers now assembled at the ready..\n<br> Off for a good read...",
    "lastEdited" : "Wed Sep 11, 2013 5:55 pm"
  }, {
    "postId" : "746191",
    "author" : {
      "username" : "jayvanman",
      "userId" : "746191",
      "joined" : "Tue Aug 19, 2008 10:21 am",
      "profileRank" : "Registered user",
      "location" : "Bristol",
      "postCount" : "3259",
      "avatarPath" : "./download/file.php%3Favatar=28832_1285795027.jpg"
    },
    "content" : "I've spoke to my MOT man, whose quite sympathetic, and he told me after 64.\n<br> \n<br> I'm fine with that as I'm wanting to put seat belts in anyway.\n<br> \n<br> So without raising an old discussion, I'd like to ask how are the seatbelts set up in a 1/3 + 2/3 seating arrangement ?\n<br> \n<br> Jason",
    "lastEdited" : "Thu Sep 12, 2013 12:41 pm"
  }, {
    "postId" : "746226",
    "author" : {
      "username" : "e m p i",
      "userId" : "746226",
      "joined" : "Fri Jan 28, 2005 3:51 pm",
      "profileRank" : "Registered user",
      "location" : "Essex but I'm nothing like the twats on the telly.",
      "postCount" : "5515",
      "avatarPath" : "./download/file.php%3Favatar=1186_1407682968.jpg"
    },
    "content" : "i should imagine that they didnt have them fitted unless you asked for them when the bus was delivered new. If asked for i would hazard a guess that it would be a 3 point static for the driver and a 3 point static for the passenger nearest the door. The reaason i say this is because my bro-in-law has a 66 with 1/3+2/3 set up and his has this and it looks like a factory fitted set up. Its a bit primitive though as it looks like the top mounting is just a round-headed bolt through the B pillar. You could of course fit 2 x three point statics and a lap belt for the middle passenger.\n<br> \n<br> shalom, Lee",
    "lastEdited" : "Thu Sep 12, 2013 4:28 pm"
  }, {
    "postId" : "746317",
    "author" : {
      "username" : "DubMinx",
      "userId" : "746317",
      "joined" : "Fri Feb 08, 2013 8:06 pm",
      "profileRank" : "Registered user",
      "location" : "North Yorkshire",
      "postCount" : "132",
      "avatarPath" : "./download/file.php%3Favatar=37396_1378069415.jpg"
    },
    "content" : "Ours is a walk through 66 i'll take some pics of how the belts attach at the weekend. \n<br> They are 3 point non inertia belts with no loops in the webbing. The webbing is just arranged through the metal fixings. It'll give you an idea.\n<br> PS they have lap bits with flip up buckles too. I'll see if they are two. It's of webbing or one...",
    "lastEdited" : "Thu Sep 12, 2013 8:46 pm"
  }, {
    "postId" : "746411",
    "author" : {
      "username" : "jayvanman",
      "userId" : "746411",
      "joined" : "Tue Aug 19, 2008 10:21 am",
      "profileRank" : "Registered user",
      "location" : "Bristol",
      "postCount" : "3259",
      "avatarPath" : "./download/file.php%3Favatar=28832_1285795027.jpg"
    },
    "content" : "<blockquote>\n <div>\n  <cite>DubMinx wrote:</cite>Ours is a walk through 66 i'll take some pics of how the belts attach at the weekend. \n  <br> They are 3 point non inertia belts with no loops in the webbing. The webbing is just arranged through the metal fixings. It'll give you an idea.\n  <br> PS they have lap bits with flip up buckles too. I'll see if they are two. It's of webbing or one...\n </div>\n</blockquote> I'll look forward to the pics. I have two webbing pieces with the push in bit, the ends have been folded over then back again. Id really like to know what/how they were attached.\n<br> \n<br> J",
    "lastEdited" : "Fri Sep 13, 2013 10:16 am"
  } ]
}