{
  "forumId" : "6",
  "threadId" : "96242",
  "title" : "Ongoing maintenance",
  "originalUrl" : "https://ssvc.org.uk/phpbb/viewtopic.php?f=6&t=96242",
  "breadcrumbs" : [ {
    "url" : "./viewforum.php?f=6&sid=7dde6f9328101a3729ecc03a91d51ea3",
    "label" : "Technical"
  } ],
  "totalPosts" : 10,
  "pageNumber" : 1,
  "totalPages" : 1,
  "posts" : [ {
    "postId" : "736768",
    "author" : {
      "username" : "AGENTMORRIS",
      "userId" : "736768",
      "joined" : "Thu Jul 25, 2013 3:29 pm",
      "profileRank" : "Registered user",
      "location" : "-",
      "postCount" : "1",
      "avatarPath" : null
    },
    "content" : "Hi all. \n<br> \n<br> I am new to the groups so hi firstly!\n<br> \n<br> Secondly\n<br> \n<br> I have just bought a fully reconditioned camper. Very excited! \n<br> \n<br> Question I have for the group is, what ongoing maintenance do you recommend I do? Anything to watch out for? \n<br> Its a 1964 RHD Conversion VW Splitscreen camper, bought from \n<a href=\"http://www.morecambeandwize.com\" class=\"postlink\">http://www.morecambeandwize.com</a> (who were really nice to deal with!)\n<br> \n<br> Cheers",
    "lastEdited" : "Fri Jul 26, 2013 9:24 am"
  }, {
    "postId" : "736770",
    "author" : {
      "username" : "maddison",
      "userId" : "736770",
      "joined" : "Fri Feb 01, 2008 1:56 pm",
      "profileRank" : "SSVC Member",
      "location" : "up norf",
      "postCount" : "5536",
      "avatarPath" : "./download/file.php%3Favatar=15870_1360143264.png"
    },
    "content" : "i'd recomend buying a book called how to keep your vw alive by john muir\n<br> \n<br> covers most things and is a great read",
    "lastEdited" : "Fri Jul 26, 2013 9:30 am"
  }, {
    "postId" : "878494",
    "author" : {
      "username" : "BlackSmoke",
      "userId" : "878494",
      "joined" : "Wed Oct 14, 2015 6:40 pm",
      "profileRank" : "SSVC Member",
      "location" : "Cheshire",
      "postCount" : "27",
      "avatarPath" : "./download/file.php%3Favatar=40881_1462892499.jpg"
    },
    "content" : "Welcome AGENTMORRIS,\n<br> \n<br> A lot depends on if you're going to do your own maintenance, or if you're going to pay and hive the work off to some local place.\n<br> \n<br> I too have a morecambeandwize built camper and I've opted to do my own maintenance - Great to get to know your bus and useful if you hit problems on the road.\n<br> \n<br> 1. For sure, first thing for your build is to go around with oil/grease for all moving parts (hinges, door mechanisms, linkages and anything else you can find)\n<br> 2. The John Muir book mentioned by Maddison is a great start; one of my first purchases prior to delivery!\n<br> 3. I'm working on a spreadsheet for my maintenance schedule (and history) based on the excellent VwJim routines at \n<a href=\"http://www.vwjim.co.uk/news_6694_56045.html\" class=\"postlink\">http://www.vwjim.co.uk/news_6694_56045.html</a> - together with a few extras on each service ( like checking fuel pipes ) ... it's a \"work in progress\" but I'll be happy to share once done.",
    "lastEdited" : "Thu Jul 07, 2016 9:05 am"
  }, {
    "postId" : "878502",
    "author" : {
      "username" : "type21f",
      "userId" : "878502",
      "joined" : "Tue May 29, 2007 12:55 pm",
      "profileRank" : "SSVC Member",
      "location" : "West Yorkshire",
      "postCount" : "15456",
      "avatarPath" : null
    },
    "content" : "Share your schedule tips, Please..!!!\n<br> \n<br> Adding to the collective knowledge of the \"Hive\"...Or is it \"Borg\"\n<br> \n<br> I love the John Muir book about \" Keeping your VW alive\"\n<br> It is simple, well written includes some real gems to get you moving...\n<br> The diagrams are fun..\n<br> \n<br> The advise is excellent...\n<br> \n<br> Especially the bit about when things do not seem to be going right and you are getting up tight...\n<br> \n<br> \n<br> \"Fondle your Tools\" seems just the right thing to do..\n<br> LOL\n<br> G",
    "lastEdited" : "Thu Jul 07, 2016 11:20 am"
  }, {
    "postId" : "878516",
    "author" : {
      "username" : "malum",
      "userId" : "878516",
      "joined" : "Fri Jul 22, 2011 7:12 pm",
      "profileRank" : "SSVC Member",
      "location" : "West Sussex",
      "postCount" : "557",
      "avatarPath" : null
    },
    "content" : "Check your fuel lines for cracking, often.\n<br> \n<br> Buy a grease gun and grease your nipples often!\n<br> \n<br> The below I pulled from somewhere else. I didn't note where at the time.\n<br> \n<br> Engine\n<br> In air-cooled Volkswagens, the engine oil plays a major part in keeping the motor cool, in addition to providing lubrication.\n<br> \n<br> Air-cooled, overhead valve, ‘flat four’ cylinder Example: 1493cc, 44bhp (mid-1960s 1.5-litre; earlier versions had smaller capacity engines; later vehicles had 1.6, 1.7 and 1.8-litre units)\n<br> \n<br> Valve ClearancesEvery 6000 miles or annually (whichever comes first), check/re-adjust the valve clearances, with the engine cold. Cylinder positions are: Right hand side of vehicle - No. 1 at flywheel end of engine, towards front of vehicle; No. 2 towards rear. Left-hand side of vehicle - No. 3 at flywheel end of engine; No. 4 towards rear. First release the clip securing each valve cover and rotate the clip downwards, then remove the cover (on re-assembly, fit new gaskets). Slowly turn the crankshaft until the piston in No. 1 cylinder is at Top Dead Centre (TDC) on the firing stroke (with both valves closed, and at the same time the distributor’s rotor arm must be in alignment with the TDC mark on the edge of the distributor body, and the notch in the crankshaft pulley must line up with the centre of crankcase). Use feeler gauges to check the valve gaps on No. 1 cylinder. For both inlet and exhaust valves the clearance should be 0.15mm. (0.006in.). To re-set a clearance, release the locknut (13mm. ring spanner) and carefully turn the adjuster screw until the correct clearance is obtained. Now hold the adjuster screw steady while re-tightening the locknut then re-check the clearance. Rotate crankshaft anti-clockwise a half-turn (180 degrees), then check/adjust the valves on Cylinder No. 2. Turn the crankshaft a further half-turn, and check/adjust the valves on Cylinder No. 3. Rotate a further half-turn, and check/adjust the valves on Cylinder No. 4.\n<br> IgnitionFiring order: 1-4-3-2.\n<br> \n<br> Spark plugs: Check, clean and re-gap if necessary, every 6000 miles or annually (whichever comes first); renew regardless every 12,000 miles. Plug type is Bosch 14mm; W8AC or equivalent. Gap 0.6-0.7mm. (0.024-0.028in.). Before screwing in the plugs, smear a little copper-based anti-seize compound on their threads, to assist in future removal. Contact points: Check/clean the points every 3000 miles or annually (whichever comes first); renew regardless every 6000 miles. The correct breaker gap is 0.4mm. (0.016in.), corresponding with a dwell angle reading of 54 to 58 degrees. Distributor cap, rotor arm and high tension leads: Every 3000 miles/annually, clean and carefully examine all components. Make sure that all connections are in good condition. At each service apply a few drops of engine oil through the distributor baseplate onto the distributor shaft and mechanical advance mechanism. In addition, apply a little high melting point grease to the distributor cam. Timing (static): Starting point 7.5 degrees Before Top Dead Centre (BTDC); marks are provided on the crankshaft pulley and the crankcase. If readjustment is required, slacken the distributor’s retaining clamp and carefully rotate the distributor body to the required timing position, then re-check the timing.\n<br> \n<br> Fuel SystemEvery 3000 miles or annually, whichever comes first:losely scrutinise all fuel system pipework and connections. Check operation of the carburettor choke linkage and the air filter’s warm air control flaps. Re-lubricate carburettor operating linkages.Take off the petrol pump lid and clean the gauze filter. Re-fit the lid and check for fuel leaks on completion. With the engine at normal running temperature, having first checked the valve clearances and all the ignition aspects, check/adjust the carburettor settings (for full details, consult workshop manual). On early vehicles featuring just volume control and throttle stop screws, turn the volume screw clockwise until the engine slows down, then VERY slowly rotate screw anti-clockwise to achieve the highest engine speed, finally resetting idle speed using the throttle stop screw. Note: On later examples with an additional air by-pass screw, this is used as the main device for regulating the tickover speed. On vehicles fitted with an oil bath type gauze air cleaner, at every service remove the assembly and drain off the old oil. Rinse the gauze and clean its casing using fresh paraffin, then wipe/drain off excess paraffin, before soaking the gauze in clean engine oil and re-assembling. Top up reservoir with new engine oil to the marked level (capacity approximately 0.45 litres or 0.8 pint). If your VW has a paper element type filter, renew it at least every 12,000 miles (or earlier if visibly dirty; check every 6000 miles).\n<br> \n<br> LubricationEngine oil: In air-cooled Volkswagens, the engine oil plays a major part in keeping the motor cool, in addition to providing lubrication. So, for maximum engine life, remove and clean the gauze filter, and change the oil, AT LEAST every 3000 miles or annually (whichever comes first), but it is preferable to tackle the job more frequently than this. Take the vehicle for a long run to fully warm the engine, then drain the oil. Use a 21mm. ring or socket spanner to release the large, central sump plug, where fitted (when re-fitting the plug, use a new sealing ring unless the original is in perfect condition). Some units lack the single, central drain plug, and if your unit is one of these, take out the six bolts (10mm. spanner) securing the gauze filter retainer. In all cases remove the gauze filter, rinse this and its retaining plate in fresh paraffin, and carefully dry all components using fluff-free rag, before re-fitting. On re-assembly, use new gaskets and stud washers. Good quality monograde oil (SAE 30) is recommended. Please dispose of the old oil in an environmentally friendly manner - local councils provide waste oil collection points. The oil capacity is approximately 2.5 litres (4.4 pints).\n<br> \n<br> Gearbox/overdrive oil: At least every 3000 miles or annually (whichever comes first), check/top up the gearbox/final drive oil level (with the vehicle horizontal). Take out the filler/level plug (with a recessed hexagon head - 17mm) and check the oil - it should be up to the base of the threads in the filler aperture. If the level is low, check for leaks and rectify. Use SAE 90 oil for topping-up purposes. Every 24,000 miles, after taking the vehicle for a long run to warm the oil, remove both the filler and drain plugs from the transmission and allow all the old lubricant to escape into a suitable container. Re-fill with fresh SAE 90 oil; the capacity is approximately 3.5 litres (6.13 pints). When re-fitting the filler/level and drain plugs, take care NOT to overtighten them. Note: On vehicles from August 1975, fitted with Type 091transmissions, the units are ‘filled for life’, so there is no such requirement for routine draining/re-filling.\n<br> \n<br> Steering box: At every service, check the lubricant level; top up with SAE 140 oil.\n<br> Running gear lubrication: At least every 1000 miles, apply multi-purpose, lithium-based grease to all the running gear lubrication points; first wipe them clean and ensure that they are not clogged with dirt or old, congealed grease. Note: Before applying grease, raise the vehicle and securely support it beneath the ‘chassis’ (so that the suspension is relieved of load); this ensures that all the joints are fully lubricated. On early (pre-1967) vehicles, there should be eight grease points on the king pins (four per side), four nipples on the axle tubes, four on the track rod end ball joints, and another two on the idler assembly. On later examples, there should be three grease points on the front axle beam (one at each end, plus another in the centre), one at the axle end of the steering damper, and one on the idler assembly. On the later vehicles grease nipples were not fitted to the swivel joints or track rod ends.\n<br> \n<br> Other aspects:Every 3000 miles/annually: Re-lubricate the carburettor pivot points/controls, and pedal pivots. Re-lubricate the hinges and lock mechanisms (wipe off excess lubricant).\n<br> \n<br> Cooling System/Fan BeltAt each service ensure that the fan belt is in sound condition, and correctly adjusted. All is well if the belt can be twisted through 90 degrees under firm thumb and finger pressure, applied midway along the belt run. If belt adjustment is required, the dynamo or alternator drive pulley must be removed. First take off the securing nut (21mm. spanner), while using a long bar or screwdriver, acting against a lug on the body of the dynamo/alternator, to lock the pulley as the nut is released. To increase belt tension, the two halves of the pulley can be moved closer together, by removing spacers which are sandwiched between the two halves. Only remove one spacer at a time, then re-check the belt tension, until the correct adjustment is achieved. When the tension is correct, re-fit the spacers you have removed to the exterior of the pulley, then fit and re-tighten the retaining nut. At each service ensure that the thermostat and the air flaps (which it controls) in the fan casing are working correctly. The thermostat is located beneath the cylinders on the right hand side of the engine. When the engine is hot, the flaps need to be open (to permit full air flow around the finned cylinders), and the operating bar should be positioned towards the left side of the engine bay. If it isn’t, you need to establish why not, and rectify the problem ASAP.\n<br> \n<br> IMPORTANT NOTES:At all times ensure that nothing likely to be drawn in by the fan is left within the engine compartment. It is wise ALWAYS to carry a spare fan belt with this vehicle.\n<br> \n<br> BrakesAt least every 3000 miles or annually, whichever comes first: Closely scrutinise the fixed brake pipes, flexible hoses and the master cylinder. Renew any ailing components AT ONCE. Carefully examine the front brake pads and discs (where fitted). Remove the rear brake drums (also the fronts, where drum brakes are fitted) and closely check the shoes, operating cylinders and drums.\n<br> \n<br> AVOID INHALING DUST FROM THE PADS/SHOES - IT MAY CONTAIN ASBESTOS. WEAR A MASK AND USE A PURPOSEDESIGNED BRAKE CLEANER FLUID TO HELP ELIMINATE AIRBORNE DUST. DO NOT BLOW OUT DUST USING AN AIRLINE!\n<br> Note: On early examples (to August 1970) with drum brakes at both the front and rear, the drums can only be removed by taking off the large central hub nut (first remove the split pin) and disturbing the wheel bearings. On later vehicles with front disc brakes the rear drums are secured by two bolts (11mm. spanner), so it’s much easier to remove the drums for a full inspection of the brakes. The shoe-to-drum clearances on drum type brakes are adjusted by inserting a screwdriver through an aperture in the brake drum (early vehicles) or the backplate (later examples). Each toothed adjuster (two for each front wheel; one for each rear) is turned clockwise (when viewed from the end of the adjuster) until the brakes are locked on, then backed off until the road wheel freely rotates. Check at each service that the handbrake mechanism moves freely and is properly lubricated. Ensure too that the cables and linkages are not worn. At each service, check handbrake operation, and only re-adjust if lever travel is still excessive after first adjusting the shoe-to-drum clearances, as already described (for full details, please consult your workshop manual). On early vehicles the cable adjusters can be found inside the cab, beneath a rubber cover adjacent to the base of the gear lever. On later examples the equalizer assembly, featuring two adjuster nuts, is reached from underneath the vehicle. In each case, rotate the adjuster nuts clockwise so that excessive slack is taken up equally by each cable (trial rotation of the rear wheels will confirm this). After adjustment, always ensure that the brakes are not binding with the handbrake lever in the ‘off’ position. At least every 18 months 18,000 miles (whichever comes first), change the brake fluid.\n<br> \n<br> Sundry ItemsEvery 3000 miles, or annually (whichever comes first)... Check brake fluid level. Examine the driveshaft gaiters. Renew damaged gaiters at once, to prevent the ingress of dirt and moisture. Scrutinise the ball joint gaiters for splits. Assess the state of the steering column’s rubber coupling; renew if damaged. Look for wear in the idler pin (by employing a long bar to carefully lever against the axle). Check for wear/excessive free play in, and re-lubricate the front wheel bearings with fresh grease specifically stated as being suitable for use in wheel bearings. Assess/re adjust clutch pedal free play (for details please consult your workshop manual). Examine the heat exchangers; renew if damaged as these are safety critical. Check operation of the heater control cables. Make sure that the engine and fan cover plates are securely fitted. Check all electrical connections (this is especially important on versions with six-volt electrics), and inspect all wiring for damage. Assess the condition and security of the exhaust system, all running gear components, steering mounts/attachments, and suspension components, mountings and bushes. Check that all mounting bolts/nuts are all tight - including the wheel nuts. Check dampers for deterioration/leaks. Inspect underbody for damage. Assess all tyres (including the spare) for condition, wear patterns and pressures.",
    "lastEdited" : "Thu Jul 07, 2016 3:20 pm"
  }, {
    "postId" : "878518",
    "author" : {
      "username" : "malum",
      "userId" : "878518",
      "joined" : "Fri Jul 22, 2011 7:12 pm",
      "profileRank" : "SSVC Member",
      "location" : "West Sussex",
      "postCount" : "557",
      "avatarPath" : null
    },
    "content" : "I notice that the original post is 3 years old and Agent Morris has never been back!",
    "lastEdited" : "Thu Jul 07, 2016 3:26 pm"
  }, {
    "postId" : "878569",
    "author" : {
      "username" : "BlackSmoke",
      "userId" : "878569",
      "joined" : "Wed Oct 14, 2015 6:40 pm",
      "profileRank" : "SSVC Member",
      "location" : "Cheshire",
      "postCount" : "27",
      "avatarPath" : "./download/file.php%3Favatar=40881_1462892499.jpg"
    },
    "content" : "Lol - Have I really been in my garage for 3 years .. doesn't time fly when working on buses !!\n<br> \n<br> Though maintenance schedules is a good topic (for me at the moment) and doesn't seem to have been covered a lot.",
    "lastEdited" : "Fri Jul 08, 2016 10:30 am"
  }, {
    "postId" : "880579",
    "author" : {
      "username" : "goose",
      "userId" : "880579",
      "joined" : "Fri May 14, 2004 7:56 pm",
      "profileRank" : "SSVC Member",
      "location" : "West Midlands",
      "postCount" : "310",
      "avatarPath" : null
    },
    "content" : "I was just coming up to do a service on my van and came across this thread, very useful.\n<br> \n<br> I have put together the below excel file containing a tick sheet and the procedures on different tabs (all stolen from Malum's post (thanks Malum!)). I did this for my own use but others may find it useful. \n<br> \n<ul>\n <li><a href=\"https://drive.google.com/open?id=0B5itqil-CDGQSEpTWHBkWVRna2s\" class=\"postlink\">Service sheet</a></li>\n</ul> PS the tick sheet prints quite nicely on landscape A4. If anyone has any ideas for additions I'm happy to put them on.\n<br> \n<br> Thanks",
    "lastEdited" : "Fri Aug 05, 2016 12:16 pm"
  }, {
    "postId" : "880751",
    "author" : {
      "username" : "malum",
      "userId" : "880751",
      "joined" : "Fri Jul 22, 2011 7:12 pm",
      "profileRank" : "SSVC Member",
      "location" : "West Sussex",
      "postCount" : "557",
      "avatarPath" : null
    },
    "content" : "I nicked it from somewhere else, I'd give credit but I can't remember where I got it.",
    "lastEdited" : "Mon Aug 08, 2016 1:42 pm"
  }, {
    "postId" : "882890",
    "author" : {
      "username" : "e m p i",
      "userId" : "882890",
      "joined" : "Fri Jan 28, 2005 3:51 pm",
      "profileRank" : "Registered user",
      "location" : "Essex but I'm nothing like the twats on the telly.",
      "postCount" : "5514",
      "avatarPath" : "./download/file.php%3Favatar=1186_1407682968.jpg"
    },
    "content" : "Valve clearances should be done every 3000 miles, not every 6000, and with engine stone cold so if you've driven that day leave it until the morning. \n<br> \n<br> \n<a href=\"http://www.volksworld.com/tech-guides/vw-diy-guides/adjusting-your-vws-tappets-3286\" class=\"postlink\">http://www.volksworld.com/tech-guides/v ... ppets-3286</a>",
    "lastEdited" : "Tue Sep 06, 2016 6:46 am"
  } ]
}