{
  "forumId" : "6",
  "threadId" : "109173",
  "title" : "mpg with stock late gearbox and twin carbs",
  "originalUrl" : "https://ssvc.org.uk/phpbb/viewtopic.php?f=6&t=109173",
  "breadcrumbs" : [ ],
  "totalPosts" : 6,
  "pageNumber" : 1,
  "totalPages" : 1,
  "posts" : [ {
    "postId" : "826610",
    "author" : {
      "username" : "beetleseb",
      "userId" : "Unknown",
      "joined" : "-",
      "profileRank" : "-",
      "location" : "-",
      "postCount" : "-",
      "avatarPath" : null
    },
    "content" : "Hi guys.\n<br>\n<br>I'm wondering if anyone else is running a similar set up to me and can give me an idea of what my mpg should be.\n<br>\n<br>Bus is a 56 but running 67 bignut 1500 gearbox and 1600 single port engine. A fairly stock lump but built well on a new case with stock cam. Vj4br8 dizzy. Stock height and tyres\n<br>\n<br>I've got an old school twin solex 34 pci carb setup, runs really well but only does 21mpg on a long run\n<br>\n<br>Just wondering if anyone else has a fairly stock setup with twin carbs and what mpg they get. More worried about over fueling than the cost but according to VW a 67 should do 29mpg\n<br>\n<br>Have the option of getting it on a rolling road or swapping to some Weber 34 icts. I do love my 34pcis tho",
    "lastEdited" : "Wed Mar 18, 2015 6:25 pm"
  }, {
    "postId" : "826694",
    "author" : {
      "username" : "Dsbradley",
      "userId" : "Unknown",
      "joined" : "-",
      "profileRank" : "-",
      "location" : "-",
      "postCount" : "-",
      "avatarPath" : null
    },
    "content" : "Hi. . .I'm running a stock 1641 with twin webber 34s, electronic ignition and a classic speed exhaust in my 67 Panel van. Its been IRSed and has a type 3 1600 gear box. I had it set up on a rolling road by Tom Airey in Hampshire. The rolling road set up and re jetting transformed my bus. Tom also advised using high octane unleaded instead of the 95 standard unleaded as it burns cleaner and although its a bit more expensive, the engine will be more economical. I average 28 - 30 everywhere!! The engine starts on the button, ticks over from cold, has no flat spots and produced 80BHP on the rolling road. It cost me £240 to get my bus set up properly but was the best £240 I've spent on it!!",
    "lastEdited" : "Thu Mar 19, 2015 2:28 am"
  }, {
    "postId" : "826703",
    "author" : {
      "username" : "maddison",
      "userId" : "Unknown",
      "joined" : "-",
      "profileRank" : "-",
      "location" : "-",
      "postCount" : "-",
      "avatarPath" : "./download/file.php%3Favatar=15870_1360143264.png"
    },
    "content" : "problem is you have reduction boxes\n<br>\n<br>you haven't said what speed your cruising at when your getting 21mpg on a run…but if its 60mph….your probably sitting at 3 1/2 - 4k revs the whole way, on twin carbs, wide open, so yes, its gonna drink fuel\n<br>\n<br>\n<br>twin carbs on a stock engine and IRS or SA gearbox with at tall 4th work really well and driven light would probably see an increase in MPG near the mid 30's….basically because you revs at 60mph drop by about 1000 rpm…..thats 2000 combustion chambers of fuel less every minute of your long run \n<img src=\"./images/smilies/wink.gif\" alt=\";-)\" title=\"Wink\">\n<br>\n<br>\n<br>what MPG do you get if your sitting at 50mph ? (presuming thats not the speed your getting 21mpg at)\n<br>\n<br>\n<br>as said before, if you are gonna run twin carbs on a stock engine and box…i would make sure you get it on rolling road to ensure the fuelling is cock on at near 4k revs, as thats where the engine will be running most its life\n<br>\n<br>\n<br>to be totally honest, I don't think your actually gonna be getting that much benefit from running twin carbs on a stock engine and reduction box gearbox….stock carb (the one that does 30mpg \n<img src=\"./images/smilies/wink.gif\" alt=\";-)\" title=\"Wink\"> is fine and nippy on RB's in 1st, 2nd &amp; 3rd…..you might lose a little power in 4th (doubt you will lose any torque) and you will gain 8 0r 9 MPG's)",
    "lastEdited" : "Thu Mar 19, 2015 7:37 am"
  }, {
    "postId" : "826705",
    "author" : {
      "username" : "beetleseb",
      "userId" : "Unknown",
      "joined" : "-",
      "profileRank" : "-",
      "location" : "-",
      "postCount" : "-",
      "avatarPath" : null
    },
    "content" : "Hi\n<br>\n<br>Rolling road is deff my next port of call.\n<br>\n<br>Engine is fairly stock but I'm into vintage speed so keen on keeping the old school flair. It's nothing compared to the bug engine I'm building but keeps me happy.\n<br>\n<br>Engine revs at 3200 at 60mph. I cruise at 55-60. Big nut boxes work well if you don't mess with tyre sizes. I run 195 80 15. Foot is halfway when cruising. No setup should run much lower than this, you need to keep engine fan speed up.\n<br>\n<br>Spoke to a friend who had a similar setup and got 28-32 mpg. That would be fine. The guys at the rolling roads I've spoken to suggest twins are actually more economical than singles if jetted correctly.\n<br>\n<br>So best rolling roads near me. A friend suggested hi tech up near brum who sound knowledgeable and have the right jets. Would be about £200 so not too bad",
    "lastEdited" : "Thu Mar 19, 2015 7:54 am"
  }, {
    "postId" : "826799",
    "author" : {
      "username" : "wmk168",
      "userId" : "Unknown",
      "joined" : "-",
      "profileRank" : "-",
      "location" : "-",
      "postCount" : "-",
      "avatarPath" : "http://i1355.photobucket.com/albums/q703/wmk168/76f9b38846fc3cc237bfea84e3475759_zps8bb84036.jpg"
    },
    "content" : "Hi I can recommend Mick at Hi-tec,great guy knows his stuff and my last rolling tune only cost a shade over £100 from him.Worth every penny.",
    "lastEdited" : "Thu Mar 19, 2015 7:06 pm"
  }, {
    "postId" : "826802",
    "author" : {
      "username" : "beetleseb",
      "userId" : "Unknown",
      "joined" : "-",
      "profileRank" : "-",
      "location" : "-",
      "postCount" : "-",
      "avatarPath" : null
    },
    "content" : "<div class=\"quotetitle\">\n wmk168 wrote:\n</div>\n<div class=\"quotecontent\">\n Hi I can recommend Mick at Hi-tec,great guy knows his stuff and my last rolling tune only cost a shade over £100 from him.Worth every penny.\n</div>\n<br>\n<br>Cheers. He quoted £120 but with vat and parts I'm expecting £200\n<br>\n<br>I want to swap the idle air valve and then I'm booking her in",
    "lastEdited" : "Thu Mar 19, 2015 7:18 pm"
  } ]
}