{
  "forumId" : "6",
  "threadId" : "120909",
  "title" : "Rear tail light sizes and trim",
  "originalUrl" : "https://ssvc.org.uk/phpbb/viewtopic.php?f=6&t=120909",
  "breadcrumbs" : [ {
    "url" : "./viewforum.php?f=6&sid=702d28bd71f426651cf4b2ba23a68077",
    "label" : "Technical"
  } ],
  "totalPosts" : 5,
  "pageNumber" : 1,
  "totalPages" : 1,
  "posts" : [ {
    "postId" : "907452",
    "author" : {
      "username" : "CapeTown62",
      "userId" : "907452",
      "joined" : "Mon Sep 14, 2009 8:07 pm",
      "profileRank" : "Registered user",
      "location" : "-",
      "postCount" : "89",
      "avatarPath" : "./download/file.php%3Favatar=33542_1253009672.jpg"
    },
    "content" : "Hi all and happy silly season.\n<br> \n<br> So... my '62 11 window had rear lights when I bought her 8 years ago, but no seals or trim. I assumed they were the correct orange and red lensed originals. Then I was lucky enough to find a set of chrome trim rings, complete with VW logo stamped on them, at a swap meet. The problem is they are just too small to fit the lenses. So now I'm wondering, are the lenses wrong, or the trim rings? I suspect the lenses, because of the VW logo on the rings, so I've been looking at replacement lenses on all the usual VW suppliers' websites. The thing is, how do I know the knew lenses will fit my trim rings? To further confuse things, I see some lenses now come with integrated chrome trim. Were these ever original equipment? \n<br> \n<br> Does anyone have a list of exactly what lights went on what bus, complete with accurate sizes? \n<br> \n<br> Thanks for the help!! \n<br> \n<br> Mike",
    "lastEdited" : "Sat Dec 30, 2017 11:31 am"
  }, {
    "postId" : "907463",
    "author" : {
      "username" : "clymoj",
      "userId" : "907463",
      "joined" : "Tue Mar 27, 2012 12:10 pm",
      "profileRank" : "Registered user",
      "location" : "London & Birmingham",
      "postCount" : "1355",
      "avatarPath" : null
    },
    "content" : "UK RHD 62 should have orange and red with chrome trim. \n<br> \n<br> US 62 had all red lenses, with chrome trim I think. \n<br> \n<br> South African 62? Not sure but for UK MOT you should have orange and red. \n<br> \n<br> Later on the same lights were used on bays and at some point stopped having the chrome trim. But these are a different pressing so you can’t just add the chrome trim to a light that wasn’t meant to have it ...as you have found out. \n<br> \n<br> Easiest way to guarantee would be to buy repro with the chrome trim, and then swap your OG trim onto it. Or find original lights with ratty trim and swap to your nice trims?\n<br> \n<br> \n<br> Sent from my iPhone using Tapatalk",
    "lastEdited" : "Sat Dec 30, 2017 4:07 pm"
  }, {
    "postId" : "907483",
    "author" : {
      "username" : "panel van lee",
      "userId" : "907483",
      "joined" : "Tue Mar 03, 2009 9:43 pm",
      "profileRank" : "SSVC Member",
      "location" : "Nottingham",
      "postCount" : "101",
      "avatarPath" : null
    },
    "content" : "I’m pretty sure the all red USA rear lenses are slightly smaller in size, so I suspect you may have bought Chrome trims for USA lights unfortunately. Just fitting orange red to my 63 and original USA trims didn’t fit, they were to small.",
    "lastEdited" : "Sun Dec 31, 2017 11:50 am"
  }, {
    "postId" : "907504",
    "author" : {
      "username" : "CapeTown62",
      "userId" : "907504",
      "joined" : "Mon Sep 14, 2009 8:07 pm",
      "profileRank" : "Registered user",
      "location" : "-",
      "postCount" : "89",
      "avatarPath" : "./download/file.php%3Favatar=33542_1253009672.jpg"
    },
    "content" : "Hi and Happy New Year!\n<br> The trims are marked VW SWF and yes, I believe they are for US spec lenses ie the SLIGHTLY smaller ones. I thought US lenses were the all red ones...?\n<br> Why there are two different lenses so close in size I cannot imagine, but anyway I just took my orange and red lenses off and ground the edges off on my bench sander so they fit in the chrome trim. Not authentic but they fit fine and look good. Will do until I decide to spend the £££ on new lenses complete with chrome trim... or just may leave them as they are!\n<br> Thanks for the help all.",
    "lastEdited" : "Mon Jan 01, 2018 11:38 am"
  }, {
    "postId" : "907506",
    "author" : {
      "username" : "type21f",
      "userId" : "907506",
      "joined" : "Tue May 29, 2007 12:55 pm",
      "profileRank" : "SSVC Member",
      "location" : "West Yorkshire",
      "postCount" : "15632",
      "avatarPath" : null
    },
    "content" : "Two sorts of rear lighting bulb holders and lenses introduced in 1962 around the major changes. \n<br> \n<br> US lenses with one compartment to hold a single bulb and a flat section which sits behind the reflector and an all red lense and crome trim. The one two filament bulb acts as rear light bulb, brake and indicator as was standard in USA. The rubber body seal has no tit down the sides and a grove all the way round into which the chrome trim sits.\n<br> \n<br> Euro lenses (supplied everywhere except US) with two compartment bulb body. Brake and rear light and indicator. Two coloured lense red and amber with CHROME paint on the outside rim edge of the lense. Lense sits into the front of the seal and the seal has rubber tits down the sides to stop light seepage from one bulb to the other.\n<br> \n<br> SA bus would have had euro seals Euro holder and two colour lens without a chromed metal trim.\n<br> \n<br> My 62 came with Euro seals US bulb holder and Euro lenses!\n<br> \n<br> PO was BT engineer but looked to have bought what he saw..\n<br> \n<br> If you have US seals MOT tester may fail for light seepage!\n<br> \n<br> Rusty 1962 bought chrome metal trims and sanded lenses to fit.\n<br> \n<br> \n<br> \n<br> \n<br> \n<br> \n<br> \n<br>",
    "lastEdited" : "Mon Jan 01, 2018 12:58 pm"
  } ]
}