{
  "forumId" : "6",
  "threadId" : "2176",
  "title" : "splitty safety",
  "originalUrl" : "https://ssvc.org.uk/phpbb/viewtopic.php?f=6&t=2176&start=90",
  "breadcrumbs" : [ {
    "url" : "./viewforum.php?f=6",
    "label" : "Technical"
  } ],
  "totalPosts" : 98,
  "pageNumber" : 7,
  "totalPages" : 7,
  "posts" : [ {
    "postId" : "427221",
    "author" : {
      "username" : "catchawave",
      "userId" : "427221",
      "joined" : "Sun Jan 11, 2009 7:48 pm",
      "profileRank" : "Registered user",
      "location" : "Plymouth, UK",
      "postCount" : "33",
      "avatarPath" : "./download/file.php%3Favatar=31517_1231744262.jpg"
    },
    "content" : "Hi guys, \n<br>\n<br>CSP do both kits, I opted for the steel wheels 14inch rim kit then got empis later.\n<br>\n<br>Now I can still go back to my steels if I wanted the stock look (Though I love my white empis)\n<br>\n<br>Cheers.\n<br>\n<br>Andy",
    "lastEdited" : "Tue Jun 09, 2009 7:49 pm"
  }, {
    "postId" : "456197",
    "author" : {
      "username" : "Overdubbed",
      "userId" : "456197",
      "joined" : "Sun Sep 20, 2009 4:47 pm",
      "profileRank" : "Registered user",
      "location" : "Tunbridge Wells Kent",
      "postCount" : "81",
      "avatarPath" : null
    },
    "content" : "A slightly different aspect of safety. I have seen a number of resto threads showing folk fitting new front panels etc. What I find scary is the fact that the A posts are being butted and welded - worryingly by amateur welders too. A slight \"front ender\" would see these welds fail and the front end collapse. You cannot have the original strength with a butt joint. If the A post has to be joined in this way it neds and insert putting inside the pillar and welding to it. In fact a decent piece of steel in the A post and welded through from ther outside may well add to the strength. \n<br>Sorry, restorers, but you asked for safety things - and structure is more important than disc brakes etc...",
    "lastEdited" : "Sun Sep 27, 2009 9:48 pm"
  }, {
    "postId" : "623815",
    "author" : {
      "username" : "Shuttle",
      "userId" : "623815",
      "joined" : "Tue Jul 12, 2011 8:20 pm",
      "profileRank" : "Registered user",
      "location" : "Essex",
      "postCount" : "29",
      "avatarPath" : null
    },
    "content" : "Right. Not pleasant but I got first hand experience in safety of these buses. Few years back a splitty was pootling down some country lanes minding its own buisness when it was struck corner to corner by a **** in a Z3 coming the other way. As a paramedic I arrived to find it on its side both occupants already dead. Couldn't open the doors as they'd buckled. Used my Gerber to cut through the sunroof to get to em.\n<br>Z3 **** was fine though. \n<img class=\"smilies\" src=\"./images/smilies/icon_rolleyes.gif\" alt=\":roll:\" title=\"Roll Eyes\"> \n<br>If you want safety get a T4.\n<br>Still hasn't put me off getting one. I always put coolness ahead of safety. \n<img class=\"smilies\" src=\"./images/smilies/icon_wink.gif\" alt=\":wink:\" title=\"Wink\">",
    "lastEdited" : "Fri Dec 02, 2011 4:52 pm"
  }, {
    "postId" : "634208",
    "author" : {
      "username" : "Sisu",
      "userId" : "634208",
      "joined" : "Fri Feb 13, 2009 8:39 pm",
      "profileRank" : "Registered user",
      "location" : "-",
      "postCount" : "63",
      "avatarPath" : null
    },
    "content" : "I thought I would mention that although there is a fashion for 4 point racing harness and roll cages. This can cause more damage in the wrong context. \n<br>A harness is designed for racing. The straps should mount at shoulder height to a cage. No problem in a roll cage, but if you bolt them over a seat to the floor. When you are in a crash you collapse your spine. \n<br>Roll cages - I am not questioning their structural aspect. But they are designed to work in racing - you are in strapped firmly upright, neckbrace on and wearing a helmet. Most people using the race harness as mentiond above keep them loose to change gear and assume the position - forearms resting on the wheel to see out. Without a helmet or a heavily padded cage your body or head will hit a steel pole of the cage killing you. \n<br>By all means fit 3 point retractable seat belts with a strengthening plate. The box section or thicker steel in the a/b pillers and frame. Strengthening the frame that is already there. This is better for the context of what the bus will be used for.\n<br>I fitted an Isofix from a Golf to mount the kids baby seats. The isofix plates bolt where the lap seatbelt mounts to the body.",
    "lastEdited" : "Wed Feb 01, 2012 6:10 am"
  }, {
    "postId" : "640163",
    "author" : {
      "username" : "funky_rick",
      "userId" : "640163",
      "joined" : "Fri Oct 14, 2011 7:48 pm",
      "profileRank" : "SSVC Member",
      "location" : "-",
      "postCount" : "142",
      "avatarPath" : null
    },
    "content" : "hey guys most of these links and pictures wont work, I am looking to put 3 point belts in my 65 split (front) am after advise/ideas on how, some pictures would be a great help.",
    "lastEdited" : "Sun Feb 26, 2012 7:32 pm"
  }, {
    "postId" : "671448",
    "author" : {
      "username" : "67USA",
      "userId" : "671448",
      "joined" : "Tue Nov 23, 2010 11:21 pm",
      "profileRank" : "Registered user",
      "location" : "Preston, Lancashire NW UK",
      "postCount" : "473",
      "avatarPath" : "./download/file.php%3Favatar=34857_1293666952.jpg"
    },
    "content" : "to make my front seats '3 point' seat belts i used the hole under the coat hooks on the fron B pillars, i seam welded the correct 7/16 unf nuts to the front of the 'hole' so the bolt woudl pass right through.\n<br>\n<br>the belt kit came out of a bug i broke for the engine they worked out perfect!\n<br>\n<br>ill see if i can find some pics.\n<br>\n<br>\n<img src=\"http://i957.photobucket.com/albums/ae52/alex1916v/Interior%20Work/P1160004.jpg\" class=\"postimage\" alt=\"Image\">\n<br>\n<br>\n<img src=\"http://i957.photobucket.com/albums/ae52/alex1916v/Interior%20Work/PB090209.jpg\" class=\"postimage\" alt=\"Image\">",
    "lastEdited" : "Thu Jul 26, 2012 11:36 am"
  }, {
    "postId" : "677005",
    "author" : {
      "username" : "Genteel Blue",
      "userId" : "677005",
      "joined" : "Tue Aug 21, 2012 10:28 pm",
      "profileRank" : "Registered user",
      "location" : "-",
      "postCount" : "3",
      "avatarPath" : null
    },
    "content" : "Apologies if it I'm teaching how to suck eggs;\n<br>1) Get the best out of your current set up, make sure the brakes are adjusted and balanced, tyre pressures and tread, correct shocks (especially if you've altered the height).\n<br>2) Fit a remote brake servo. Works off the vacuum as a modern car, but activated by the hydraulic brake pressure rather mechanically from the medal - therefore can be located anywhere. Speak to Paul Miller at Harry Harpics in Essex. He fitted one for me to the left of the engine, in the engine bay - the best investment I made on my van. This will work with any future upgrade e.g. discs.\n<br>3) Do fit inertia belts where possible. They may not look 'cool' not nor does a smashed head, the bit between your ears is more valuable than the pieces below your knees. Even a lap belt is better than nothing. I fitted inertia belts to the front of my van with the 'reels' bolted to the rear of the bulkhead.\n<br>\n<br>I can't work out how to paste photos but there are some which shows the above on my van which is currently for sale.\n<br>\n<!-- m -->\n<a class=\"postlink\" href=\"http://motorhomes.autotrader.co.uk/stock-item-id/8ab59bc3394cb68301395016af406582/advert\">http://motorhomes.autotrader.co.uk/stoc ... 582/advert</a>\n<!-- m -->\n<br>If anyone can extract the relevant photos from autotrader and post them here, be my guest.\n<br>\n<br>Cheers\n<br>Alex",
    "lastEdited" : "Fri Aug 24, 2012 11:08 pm"
  }, {
    "postId" : "765349",
    "author" : {
      "username" : "Solan",
      "userId" : "765349",
      "joined" : "Mon Nov 16, 2009 10:02 am",
      "profileRank" : "Registered user",
      "location" : "Bergen, Norway",
      "postCount" : "47",
      "avatarPath" : "./download/file.php%3Favatar=33737_1286289027.png"
    },
    "content" : "Another (to me) very important splitty safety precaution is to get rid of the double locking nut system for the front wheel hubs. I had a \"near-death\" experience when my locking nuts suddenly tightened at 50 mph, and the spindle broke clean off! Luckily nobody came in the opposite lane at that crucial moment, or I (probably) would've been killed. So I'm switching to the bay locking nut on both sides.\n<br>\n<br>I know that I broke the washer between the locking nuts when tightening, but it's very easy to make this mistake. If you still want to keep the old double locking nuts, be SURE not to damage the washer inbetween them when tightening. Use a new (special) washer every time you assemble the hub.\n<br>\n<br>Drive safely!\n<br>\n<br>Best regards from Bergen, Norway\n<br>Svein",
    "lastEdited" : "Tue Jan 14, 2014 9:23 pm"
  } ]
}