{
  "forumId" : "6",
  "threadId" : "111778",
  "title" : "Paint Removal & Rust Treatment",
  "originalUrl" : "https://ssvc.org.uk/phpbb/viewtopic.php?f=6&t=111778",
  "breadcrumbs" : [ {
    "url" : "./viewforum.php?f=6&sid=cb6a709a32f81c513a687a1b4895ae79",
    "label" : "Technical"
  } ],
  "totalPosts" : 8,
  "pageNumber" : 1,
  "totalPages" : 1,
  "posts" : [ {
    "postId" : "843799",
    "author" : {
      "username" : "Colm5928",
      "userId" : "843799",
      "joined" : "Tue May 13, 2014 1:06 pm",
      "profileRank" : "Registered user",
      "location" : "-",
      "postCount" : "9",
      "avatarPath" : null
    },
    "content" : "Hello Guys,\n<br>I have a 66 US bus with the usual suspect RUST areas 6\" downwards. I have replaced a lot of the rotten metal and I am considering getting the remaining paint &amp; rust removed using a paint stripping company. I was just wondering if anyone on here may have used the services of Enviro_Strip at \n<!-- m -->\n<a class=\"postlink\" href=\"http://www.envirostripukltd.com\">http://www.envirostripukltd.com</a>\n<!-- m --> or Paint Strip at \n<!-- m -->\n<a class=\"postlink\" href=\"http://www.paint-strip.co.uk\">http://www.paint-strip.co.uk</a>\n<!-- m -->, or even any other paint stripping company out there. I would really like to know are there any pitfalls to this type of operation and would I be better off going the traditional method of sanding it back?\n<br>Any related information would be greatly appreciated.\n<br>\n<br>COLM",
    "lastEdited" : "Thu Jul 30, 2015 12:45 pm"
  }, {
    "postId" : "843814",
    "author" : {
      "username" : "split999",
      "userId" : "843814",
      "joined" : "Thu Apr 20, 2006 11:11 pm",
      "profileRank" : "SSVC Member",
      "location" : "S.E. Kent.",
      "postCount" : "2287",
      "avatarPath" : "http://i1232.photobucket.com/albums/ff378/split999/080.jpg"
    },
    "content" : "Colm,\n<br>\n<br>I haven't personally used enviro strip, but a have read good reports from those that have on another forum.\n<br>From speaking to Vaughan at Envirostrip the process is very thorough and will eat everything that isn't sound metal. After the strip I understand they dip the shell in another solution that stops flash oxidisation. This will provide temporary protection until a primer is sprayed onto the shell. Envirostrip offer an etch primer I believe. \n<br>\n<br>My only doubt over this process is that the stripping will find its way into box sections and other areas not reachable by spray gun. So my question. How do you treat and seal bare metal that you cannot reach, that has been stripped of its original factory primer? That's why I have decided to sand back my shell as opposed to use the stripping method offered by Envirostrip and alike.\n<br>Hth.",
    "lastEdited" : "Thu Jul 30, 2015 4:29 pm"
  }, {
    "postId" : "843956",
    "author" : {
      "username" : "clymoj",
      "userId" : "843956",
      "joined" : "Tue Mar 27, 2012 12:10 pm",
      "profileRank" : "Registered user",
      "location" : "London & Birmingham",
      "postCount" : "1122",
      "avatarPath" : "http://i1068.photobucket.com/albums/u451/clymoj/Bus/Bus005_zps44edd617.jpg"
    },
    "content" : "I have heard bad things about chemical dipping. I have to say I've no first hand experience but researched enough to not be interested in it for the reasons suggested above. I believe it's not just the fact it's stripped the primer but the fact that you have no way of getting the excess chemicals back out so they can spend months/years seeping out again to the detriment of any paint you've tried to put on your bus.\n<br>\n<br>Last time I saw it discussed I seem to remember Andy at Spike's Vintage Restorations had some experience of it that wasn't altogether positive (not on any of his work I might add). Maybe give him a shout and see what he thinks.",
    "lastEdited" : "Fri Jul 31, 2015 10:22 pm"
  }, {
    "postId" : "843964",
    "author" : {
      "username" : "lids_2001",
      "userId" : "843964",
      "joined" : "Sat Dec 10, 2005 7:09 pm",
      "profileRank" : "SSVC Member",
      "location" : "Enfield, North London",
      "postCount" : "194",
      "avatarPath" : null
    },
    "content" : "What about \n<!-- m -->\n<a class=\"postlink\" href=\"http://www.surfaceprocessing.co.uk\">http://www.surfaceprocessing.co.uk</a>\n<!-- m --> .\n<br>\n<br>I know of one high end car that was done using this process. They dip and then dip in protective coating so you don't get the problems mentioned above.\n<br>\n<br>\n<br>Sent from my iPhone using Tapatalk",
    "lastEdited" : "Sat Aug 01, 2015 6:43 am"
  }, {
    "postId" : "843971",
    "author" : {
      "username" : "type21f",
      "userId" : "843971",
      "joined" : "Tue May 29, 2007 12:55 pm",
      "profileRank" : "SSVC Member",
      "location" : "West Midlands",
      "postCount" : "10322",
      "avatarPath" : "http://i6.photobucket.com/albums/y226/phish1070/anime.gif"
    },
    "content" : "OEM body treatment is/was to dip whole body in a pre treatment rust removal vat then phosphate vat and the e coat paint vat.\n<br>The body is connected to a low voltage electric source and the paint flows through the body and hopefully the box sections and is attracted to the metal surfaces. OEM bodies were/ are put on a spit and rotated to get the e cost to flow aound the crevices\n<br> The box sections were/designed with big holes in to let the e coat in and out.\n<br>\n<br>Electrical charge is low inside a box section.....that is why getting powder cost and metal playing inside is hard.\n<br>I saw a stand at the NEC show and was impressed with their explanation of the process. The were aware of the concern of leaching from seams and explained the phosphate stage included a neutralisation agent.",
    "lastEdited" : "Sat Aug 01, 2015 8:18 am"
  }, {
    "postId" : "843977",
    "author" : {
      "username" : "Colm5928",
      "userId" : "843977",
      "joined" : "Tue May 13, 2014 1:06 pm",
      "profileRank" : "Registered user",
      "location" : "-",
      "postCount" : "9",
      "avatarPath" : null
    },
    "content" : "Guys,\n<br>Thanks for the responses on this one. From the researching I've been doing it would appear that the chemical dipping process will remove the bad bits and as mentioned above, making sure this chemical is no longer in your shell, well it's anyones guess. It would need to be e coated when all repairs have been made and even at that, the companies I've looked won't guarantee this paint has made the 100% coverage you would really need.\n<br>My bus like a lot of busses out there was bad on the bottom 6\" nearly all round. Most has been repaired now and I think I'll leave well enough alone and get out the elbow grease. \n<br>\n<br>Thanks again, for all the information.\n<br>Colm",
    "lastEdited" : "Sat Aug 01, 2015 8:58 am"
  }, {
    "postId" : "843982",
    "author" : {
      "username" : "lids_2001",
      "userId" : "843982",
      "joined" : "Sat Dec 10, 2005 7:09 pm",
      "profileRank" : "SSVC Member",
      "location" : "Enfield, North London",
      "postCount" : "194",
      "avatarPath" : null
    },
    "content" : "I would say it depends on the type of restoration you planned. This process ( even though not 100% guaranteed) is better than anything else you could do. It all comes down to cost. If I had the money I would do this.\n<br>\n<br>\n<br>Sent from my iPhone using Tapatalk",
    "lastEdited" : "Sat Aug 01, 2015 9:18 am"
  }, {
    "postId" : "843983",
    "author" : {
      "username" : "type21f",
      "userId" : "843983",
      "joined" : "Tue May 29, 2007 12:55 pm",
      "profileRank" : "SSVC Member",
      "location" : "West Midlands",
      "postCount" : "10322",
      "avatarPath" : "http://i6.photobucket.com/albums/y226/phish1070/anime.gif"
    },
    "content" : "Sounds crazy....but if the ecoat is not applied at the time the derusting is done then the panels do rust very rapidly...again...\n<br>In a former life I made car bodies...\n<br>The Allegro!!!!!!!!!\n<br>Later I worked in the aftermarket/ supply chain and secured a contract through unipart to supply all the Metro and Rover 200 assemblies including bonnets and doors. I recovered as much of the medium sized tooling from the original suppliers. The large tooling stayed at Swindon..\n<br>Most of the large tooling had had an All time buy press run and the pressings palletised and stored. When new runs were needed they ran large quantities and stored the excess to rust over time.\n<br>\n<br>When we wanted to make a run of bonnet assemblies we ordered the panels from Swindon and they drew stock panels and they were all dipped through the derust plant and sent to us for assembly. You could see them rusting within days.\n<br>I was alarmed that the panels were very marked showing they had been very rusty and using a high intensity light could see they were so thin they were full of holes.\n<br>The smell of De rusted panels you never forget so you could tell if they were derusted stock or good new pressings.\n<br>I got so fed up with returning loads as unusable and seeing them again. I instructed my guys to spray them with a bright red indelible dye...\n<br>We returned them. \n<br>Swinton ignored our rejection and put them through the derust plant again. .and to their horror...Every panel they processed that week came out fluoro pink..\n<br>I was so popular...but we got good pressings from then. ..\n<br>We sent the assemblies back to be e coated.\n<br>Shortly after my pink panel debacle they pressed and coated and stocked and the coating was weld though..bonnet edges and ribs were clinched and metal glued at the seams/joints. \n<br>\n<br>So if you dip you should ecoat and then cut out and repair. .\n<br>Not just dip....",
    "lastEdited" : "Sat Aug 01, 2015 9:20 am"
  } ]
}