{
  "forumId" : "6",
  "threadId" : "112310",
  "title" : "Beam adjusters, dropped spindles and coilovers",
  "originalUrl" : "https://ssvc.org.uk/phpbb/viewtopic.php?f=6&t=112310",
  "breadcrumbs" : [ ],
  "totalPosts" : 9,
  "pageNumber" : 1,
  "totalPages" : 1,
  "posts" : [ {
    "postId" : "847247",
    "author" : {
      "username" : "JonnyCJ",
      "userId" : "847247",
      "joined" : "Thu Mar 14, 2013 6:50 pm",
      "profileRank" : "SSVC Member",
      "location" : "Heswall",
      "postCount" : "1471",
      "avatarPath" : null
    },
    "content" : "Following on from recent topics, I have dropped spindles and a weedeater 2 narrowed beam. The bus is still in the garage being put together, but rather than mess about once it's up and running, I'd rather arrive at getting the best result before it rolls out. I want the lowered narrowed stance with optimum ride quality, so looking for input and advice to arrive at my best solution.\n<br>\n<br>I'm a bit concerned that I'm too low with the current set up. The beam adjusters are raised about three notches (bus dropped) so that I can get gear shift rod clearance past the beam adjuster nut, so I'm probably at about 4 - 4.5\" dropped, which is the highest the bus can effectively go. The top beam adjuster has been \"adjusted\" at its lower end to give shift rod clearance.\n<br>\n<br>Tyres are 175/65/15.\n<br>\n<br>Question is, is my current set up going to give me a relatively decent ride ? alternatively, if I remove the flipped spindles, then drop the bus to required height on the beam adjusters, will fitting coilovers give me the flexibility to lower and raise the bus with a better ride ?\n<br>\n<br>To my mind, if I remove the dropped spindles from the equation the amount of drop on the beam adjusters isn't so much that the ride would be massively affected, but I need shocks anyway, so the extra cost of coilovers versus standard is making me think I should consider coilovers.\n<br>\n<br>Appreciate that a narrowed beam is a harsher ride anyway.\n<br>\n<br>Cheers\n<br>\n<br>Jonny",
    "lastEdited" : "Sun Aug 30, 2015 10:23 am"
  }, {
    "postId" : "847275",
    "author" : {
      "username" : "split999",
      "userId" : "847275",
      "joined" : "Thu Apr 20, 2006 11:11 pm",
      "profileRank" : "SSVC Member",
      "location" : "S.E. Kent.",
      "postCount" : "2116",
      "avatarPath" : "http://i1232.photobucket.com/albums/ff378/split999/080.jpg"
    },
    "content" : "If you lower your bus on the adjusters (removing dropped spindles from the equation), your ride will be very harsh. Drop spindles ride comfort is the same as stock comfort. Coil overs will raise it back up maybe half an inch to an inch if your lucky.\n<br>The gear shift rod, you could consider cutting and re welding to gain clearance by putting a slight \"kink\" in it.myou might then be able to get the adjuster nut a couple of notches lower to gain height that way. You will probably find that your tyres rub (on the odd occasion) under the seat if you carry two large people in the front. That's why some folks tub under the seats.\n<br>\n<br>I'm running dropped spindles and narrowed, and I'm considering returning to stock because of these clearance issues.\n<br>\n<br>Hth",
    "lastEdited" : "Sun Aug 30, 2015 4:46 pm"
  }, {
    "postId" : "847282",
    "author" : {
      "username" : "lids_2001",
      "userId" : "847282",
      "joined" : "Sat Dec 10, 2005 7:09 pm",
      "profileRank" : "Registered user",
      "location" : "Enfield, North London",
      "postCount" : "85",
      "avatarPath" : null
    },
    "content" : "Adjusters will always cause a firmer ride as the torsion leaves are already turned and under load so they will twist less. The more load that is put in it to start with will worsen the ride.\n<br>\n<br>\n<br>Sent from my iPhone using Tapatalk",
    "lastEdited" : "Sun Aug 30, 2015 5:25 pm"
  }, {
    "postId" : "847283",
    "author" : {
      "username" : "maddison",
      "userId" : "847283",
      "joined" : "Fri Feb 01, 2008 1:56 pm",
      "profileRank" : "SSVC Member",
      "location" : "up norf",
      "postCount" : "5098",
      "avatarPath" : "./download/file.php%3Favatar=15870_1360143264.png"
    },
    "content" : "actually…..if your running coil overs…they over ride all ride quality issues\n<br>\n<br>I currently have stock beam and drop spindles…then raised up on coil overs (good quality gaz shocks one…damper on softest setting, 150lbs springs)\n<br>the ride quality is fantastic…I can raise the bus 3 inches easily on the coil overs…or lower it the same…until the point that they are effectively doing nothing apart from dampen…and the beam leaves take back over\n<br>\n<br>its the most comfortable my bus has ever been…i've had narrowed beam, drop spindles, air shock, stock beam leaves…coil overs all the way for me\n<br>I don't have ANY concerns about the suspension relying on a single bolt on the trailing arms…worst case scenario, if that EVER gave up the ghost, the bus would just drop down to the leaves for suspension anyway \n<img class=\"smilies\" src=\"./images/smilies/wink.gif\" alt=\";-)\" title=\"Wink\">\n<br>\n<br>and the coil overs are not fighting the stock leaves….you have to jack the front end up about 6 inches before the coil overs would be fighting the leaf springs the opposite way",
    "lastEdited" : "Sun Aug 30, 2015 5:57 pm"
  }, {
    "postId" : "847337",
    "author" : {
      "username" : "JonnyCJ",
      "userId" : "847337",
      "joined" : "Thu Mar 14, 2013 6:50 pm",
      "profileRank" : "SSVC Member",
      "location" : "Heswall",
      "postCount" : "1471",
      "avatarPath" : null
    },
    "content" : "Thanks all - particularly useful post Maddy !\n<br>\n<br>So it looks as though my best option if I do feel I'm too low, is coilovers with standard spindles, keep the beam adjuster where it is and then lower on the coilovers.\n<br>\n<br>So as I understand it, the coilovers are doing all the suspension work at the front end, the beam adjuster is pretty much redundant in the equation, unless I hoik the front end up massively, which ain't going to happen !\n<br>\n<br>\n<img class=\"smilies\" src=\"./images/smilies/smile.gif\" alt=\":-)\" title=\"Smile\">",
    "lastEdited" : "Mon Aug 31, 2015 11:08 am"
  }, {
    "postId" : "847363",
    "author" : {
      "username" : "maddison",
      "userId" : "847363",
      "joined" : "Fri Feb 01, 2008 1:56 pm",
      "profileRank" : "SSVC Member",
      "location" : "up norf",
      "postCount" : "5098",
      "avatarPath" : "./download/file.php%3Favatar=15870_1360143264.png"
    },
    "content" : "what the beam adjusters are doing…is allowing you to lower the bus, so you can jack it back up on the coil overs\n<br>without the beam adjusters slamming you down…you can only go up with coil overs \n<br>\n<br>Basically, lower on beam adjusters as low as they will go…and then raise on the coil overs to the height you want\n<br>(if the adjusters won't go as low as you want…just remove the serrated block and bolts from both beams…so effectively, your leaves are free to turn until something stops them (probably your tyres hitting the top of the arches - you then of course wouldn't have the back up of your leaves…you would have a poor mans red 9 EZ coil set up)",
    "lastEdited" : "Mon Aug 31, 2015 3:54 pm"
  }, {
    "postId" : "847366",
    "author" : {
      "username" : "JonnyCJ",
      "userId" : "847366",
      "joined" : "Thu Mar 14, 2013 6:50 pm",
      "profileRank" : "SSVC Member",
      "location" : "Heswall",
      "postCount" : "1471",
      "avatarPath" : null
    },
    "content" : "Fab - so Gaz shocks 150lb is the way to go. Also need a set of rebuilt standard spindles....",
    "lastEdited" : "Mon Aug 31, 2015 5:02 pm"
  }, {
    "postId" : "847374",
    "author" : {
      "username" : "maddison",
      "userId" : "847374",
      "joined" : "Fri Feb 01, 2008 1:56 pm",
      "profileRank" : "SSVC Member",
      "location" : "up norf",
      "postCount" : "5098",
      "avatarPath" : "./download/file.php%3Favatar=15870_1360143264.png"
    },
    "content" : "what years your setup…i have some rebuilt stock pre 64 spindles",
    "lastEdited" : "Mon Aug 31, 2015 6:19 pm"
  }, {
    "postId" : "847382",
    "author" : {
      "username" : "JonnyCJ",
      "userId" : "847382",
      "joined" : "Thu Mar 14, 2013 6:50 pm",
      "profileRank" : "SSVC Member",
      "location" : "Heswall",
      "postCount" : "1471",
      "avatarPath" : null
    },
    "content" : "65 I'm afraid !",
    "lastEdited" : "Mon Aug 31, 2015 7:11 pm"
  } ]
}