{
  "forumId" : "6",
  "threadId" : "109052",
  "title" : "Stereo confusion",
  "originalUrl" : "https://ssvc.org.uk/phpbb/viewtopic.php?f=6&t=109052",
  "breadcrumbs" : [ ],
  "totalPosts" : 7,
  "pageNumber" : 1,
  "totalPages" : 1,
  "posts" : [ {
    "postId" : "825679",
    "author" : {
      "username" : "martyntbox18",
      "userId" : "Unknown",
      "joined" : "-",
      "profileRank" : "-",
      "location" : "-",
      "postCount" : "-",
      "avatarPath" : null
    },
    "content" : "Hello chaps\n<br>I have a retrosound zuma stereo with built-in amplifier (24 watts RMS/45 watts peak x4 channels) and two sets of RCA low level outputs\n<br>I want to have two speakers up front, two under the rock and roll and two set up in the rear storage.\n<br>What can the stereo drive as a speaker combo e.g. 4 x 45 watt speakers only, do i need a separate amp to drive 6 speakers? If so do i use the rca line out? \n<img src=\"./images/smilies/icon_sad.gif\" alt=\":(\" title=\"Sad\"> \n<br>Confused \n<img src=\"./images/smilies/icon_rolleyes.gif\" alt=\":roll:\" title=\"Roll Eyes\"> \n<br>Regards\n<br>MT",
    "lastEdited" : "Wed Mar 11, 2015 8:53 pm"
  }, {
    "postId" : "825686",
    "author" : {
      "username" : "chrystal",
      "userId" : "Unknown",
      "joined" : "-",
      "profileRank" : "-",
      "location" : "-",
      "postCount" : "-",
      "avatarPath" : "./download/file.php%3Favatar=868_1297852976.gif"
    },
    "content" : "Ideally a 6 channel amp for the best sound and control. You used to be able to buy a splitter but the volume will be constant for the 4 speakers",
    "lastEdited" : "Wed Mar 11, 2015 9:16 pm"
  }, {
    "postId" : "825711",
    "author" : {
      "username" : "clymoj",
      "userId" : "Unknown",
      "joined" : "-",
      "profileRank" : "-",
      "location" : "-",
      "postCount" : "-",
      "avatarPath" : "http://i1068.photobucket.com/albums/u451/clymoj/Bus/Bus005_zps44edd617.jpg"
    },
    "content" : "In simple terms that head unit will drive 4 speakers without an additional amp. So if you want six you'll need at least a two channel amp.\n<br>\n<br>Can I ask what are the extra speakers under the rock and roll bed for?\n<br>\n<br>Speakers work best at ear height, pointing towards your ears, and ideally from in front of you. So under the bed kick panel is pretty much the worst place for sound, although it is very convenient. Also unless you are careful, more speakers will make it sound worse not better.",
    "lastEdited" : "Thu Mar 12, 2015 12:53 am"
  }, {
    "postId" : "825737",
    "author" : {
      "username" : "SAMBA VAN MAN",
      "userId" : "Unknown",
      "joined" : "-",
      "profileRank" : "-",
      "location" : "-",
      "postCount" : "-",
      "avatarPath" : "./download/file.php%3Favatar=1370_1312644292.jpg"
    },
    "content" : "Also your better off driving the speakers from an amp rather than the radio internal amp!",
    "lastEdited" : "Thu Mar 12, 2015 10:20 am"
  }, {
    "postId" : "825738",
    "author" : {
      "username" : "chrystal",
      "userId" : "Unknown",
      "joined" : "-",
      "profileRank" : "-",
      "location" : "-",
      "postCount" : "-",
      "avatarPath" : "./download/file.php%3Favatar=868_1297852976.gif"
    },
    "content" : "I have 4 speakers - 2 4\" in boxes under the shelf and 2 5\" in the tool box under the seats. Also a 10 sub in the rearward facing bench seat. These are driven by a 6 channel amp. No head unit, used to use an mp3 player, now just my phone. massively load enough! I do like music to sound good......However the van underway makes this very hard!",
    "lastEdited" : "Thu Mar 12, 2015 10:39 am"
  }, {
    "postId" : "825808",
    "author" : {
      "username" : "Nik",
      "userId" : "Unknown",
      "joined" : "-",
      "profileRank" : "-",
      "location" : "-",
      "postCount" : "-",
      "avatarPath" : null
    },
    "content" : "If you're on a budget and you already appear to have the head unit I'd be inclined to spend all you can on two pairs of speakers (or if you have enough a set of components, mid and tweeters, for the front &amp; coaxial two way speakers for the rear).\n<br>\n<br>In terms of mounting positions the advice above on trying to get as much high up to create a sound stage is right. If you can only get front Midbass speakers as high up as the doors, or front shelf, then having separate tweeters to mount up on the A pillars, or dash top gives you a bit more flexibility.\n<br>\n<br>No point spending a fortune on the rears as these are 'fill' only (hence going for two ways).\n<br>\n<br>Once you find yourself wanting a bit more quality, or power, then your next step would be a subwoofer driven by either a mono block amplifier (signal from your rear RCAs), or a two channel amplifier bridged into one output for your sub. Best bang for your buck would be a ten inch sub in a one foot sealed box, for allround response with most music types (tight, deep, punchy, tonal bass, not the best for any, but pretty good for all).\n<br>\n<br>Alternatively you can invest in a four, or more channel amp to run the sub and other speakers instead of the head unit running them. If you go for a 5 or six channel amplifier, you'll retain fade and balance control over your front and rear left and right speakers, whilst providing enough power to run your subwoofer.\n<br>\n<br>Given the inherent road noise and panel drum we experience in our rides, it'll be worth investing in some sound deadening. Don't forget that every 3 decibels of other noise you can eliminate, makes your system effectively twice as loud. It's costs you less to reduce road noise than increase the output from your system by the equivalent amount \n<img src=\"./images/smilies/icon_biggrin.gif\" alt=\":D\" title=\"Big Grin\"> \n<br>\n<br>Having a 'loud' stereo system isn't necessarily about playing it loud, but more about playing a good volume, but because you aren't forcing it into distortion by having to turn it up, the quality is kept. Of course turning it up is always an option \n<img src=\"./images/smilies/icon_wink.gif\" alt=\":wink:\" title=\"Wink\"> \n<br>\n<br>The sky's the limit, but four channels running from what you've got is as good a place to start as any.\n<br>\n<br>Hope this helps.\n<br>\n<br>Nik \n<img src=\"./images/smilies/icon_cheers.gif\" alt=\":cheers:\" title=\"cheers\">",
    "lastEdited" : "Thu Mar 12, 2015 6:51 pm"
  }, {
    "postId" : "825822",
    "author" : {
      "username" : "chrystal",
      "userId" : "Unknown",
      "joined" : "-",
      "profileRank" : "-",
      "location" : "-",
      "postCount" : "-",
      "avatarPath" : "./download/file.php%3Favatar=868_1297852976.gif"
    },
    "content" : "Definitely put sound deadening on the panals. Otherwise the volume had to go so high that everything is making such a racket that it becomes unbearable",
    "lastEdited" : "Thu Mar 12, 2015 7:55 pm"
  } ]
}