{
  "forumId" : "6",
  "threadId" : "108981",
  "title" : "More stupid questions ....",
  "originalUrl" : "https://ssvc.org.uk/phpbb/viewtopic.php?f=6&t=108981&start=15",
  "breadcrumbs" : [ ],
  "totalPosts" : 18,
  "pageNumber" : 2,
  "totalPages" : 2,
  "posts" : [ {
    "postId" : "825727",
    "author" : {
      "username" : "DoubleD",
      "userId" : "Unknown",
      "joined" : "-",
      "profileRank" : "-",
      "location" : "-",
      "postCount" : "-",
      "avatarPath" : null
    },
    "content" : "Thanks Floyd, I was initially interested in that type (Z-bed hinges) and, as you say, you have to remove the armrests to allow the seat/bed to function. \n<br>\n<br>At the moment I'm re-considering the options, as several people have mentioned that the bed is not comfortable using these hinges. Also, they seem to stick out a long way forward from under the seat, which doesn't look particularly nice and probably constitutes a tripping hazard. \n<br>\n<br>I would still prefer to use the original rear bench if I possibly can.",
    "lastEdited" : "Thu Mar 12, 2015 8:54 am"
  }, {
    "postId" : "825733",
    "author" : {
      "username" : "clymoj",
      "userId" : "Unknown",
      "joined" : "-",
      "profileRank" : "-",
      "location" : "-",
      "postCount" : "-",
      "avatarPath" : "http://i1068.photobucket.com/albums/u451/clymoj/Bus/Bus005_zps44edd617.jpg"
    },
    "content" : "Just a thought: is it possible to fabricate a setup using the backrests to infil the gaps between the seats like a Devon or early Westy? You'd use the full cargo area as the bed rather than the engine shelf and the rear seat base would stay where it is so no fancy mechanisms? It works in my head but the dimensions probably don't work in real life.",
    "lastEdited" : "Thu Mar 12, 2015 9:29 am"
  }, {
    "postId" : "825778",
    "author" : {
      "username" : "DoubleD",
      "userId" : "Unknown",
      "joined" : "-",
      "profileRank" : "-",
      "location" : "-",
      "postCount" : "-",
      "avatarPath" : null
    },
    "content" : "Good thought, thanks. However, having had a Danbury late bay for many years (sadly no longer), I decided that my next camping vehicle would have a R&amp;R bed as opposed to one made up from table tops and wooden infill pieces. As I plan to construct a slim furniture unit to be positioned across the bus against the bulkhead, a R&amp;R bed in the sleeping position would still leave a decent amount of floor space for getting dressed, etc.\n<br>\n<br>I think an improved version of the Z-bed hinges could give me what I'm looking for, so maybe I'll get my thinking cap on to see what can be done to advance the current design.\n<br>\n<br>Cheers, DD",
    "lastEdited" : "Thu Mar 12, 2015 2:48 pm"
  } ]
}