{
  "forumId" : "7",
  "threadId" : "110307",
  "title" : "Asset Recovery Unit - Tracker",
  "originalUrl" : "https://ssvc.org.uk/phpbb/viewtopic.php?f=7&t=110307&start=30",
  "breadcrumbs" : [ {
    "url" : "./viewforum.php?f=7",
    "label" : "Stolen"
  } ],
  "totalPosts" : 31,
  "pageNumber" : 3,
  "totalPages" : 3,
  "posts" : [ {
    "postId" : "853574",
    "author" : {
      "username" : "vwJim",
      "userId" : "853574",
      "joined" : "Thu Apr 24, 2003 6:05 pm",
      "profileRank" : "Founder BWA Member",
      "location" : "under a bus in Hampshire...",
      "postCount" : "17531",
      "avatarPath" : "./download/file.php%3Favatar=124_1300829071.jpg"
    },
    "content" : "<blockquote>\n <div>\n  <cite>Le Counte de JAYFOR wrote:</cite>I must add my tupence worth. I would not get another tracker fitted, due to its un-reliability. I had one fitted to a very expensive British car, owned by my boss, all the bells and whistles. Included subscription fees for as long as he owned the car, so it was quite expensive, over a thousand pounds. That was back in 1998 when it was a request by the insurance company. The car is constantly garaged and has only done 6.5K miles from new and is on trickle charge and occasionally driven to keep the joints moving. Approximately 3 years later, I noticed that one of the tyres, tight against the garage wall was very low and went to start it to take it out of the garage to put air in it and inspect it.\n  <br>The car would not start as the battery was dead due to the fuse failing in the chargers plug and not noticed. A couple of us decided to push it slowly out of the garage and into the adjoining car port. Done the repairs and put it back in the garage. A few days later I realised that Tracker didn't contact me to say that the car had been moved. I called them and they said that that model has been replaced by a new model and they would send out an engineer. Another 2 days later the engineer came out and confirmed that the unit was discontinued and OUT OF WARRANTY \n  <img class=\"smilies\" src=\"./images/smilies/icon_mad.gif\" alt=\":x:\" title=\"Mad\"> \n  <img class=\"smilies\" src=\"./images/smilies/icon_mad.gif\" alt=\":x:\" title=\"Mad\"> \n  <img class=\"smilies\" src=\"./images/smilies/icon_mad.gif\" alt=\":x:\" title=\"Mad\"> What frigin warranty, I told him its not an IPhone that I have to keep up with the latest models. And he could not even tell me HOW LONG it had not been working. So I had to fork out for another LATEST model as required by the insurance company. And to date, I don't even know if its on or not. \n  <br>\n  <br>I must do a demo on it and see if they contact me. Not happy at all, and would not even fit one if it was given to me.\n </div>\n</blockquote>\n<br>\n<br>Joe,\n<br>\n<br>I called Tracker and they did a ping test on mine, showed it wasn't working, so like you, annoyed that they don't monitor to see if units stop working....",
    "lastEdited" : "Tue Oct 27, 2015 9:45 pm"
  } ]
}