{
  "forumId" : "7",
  "threadId" : "74620",
  "title" : "STOLEN: 1974 VW WESTFALIA CAMPER ORANGE/WHITE - SAV 85M",
  "originalUrl" : "https://ssvc.org.uk/phpbb/viewtopic.php?f=7&t=74620",
  "breadcrumbs" : [ ],
  "totalPosts" : 1,
  "pageNumber" : 1,
  "totalPages" : 1,
  "posts" : [ {
    "postId" : "576769",
    "author" : {
      "username" : "bert53",
      "userId" : "576769",
      "joined" : "Sun Apr 03, 2011 11:10 am",
      "profileRank" : "Registered user",
      "location" : "-",
      "postCount" : "3",
      "avatarPath" : null
    },
    "content" : "Our 74 Orange and white Westfalia camper was stolen overnight on 31ST MARCH 2011 FROM ELY, CAMBRIDGESHIRE. UK\n<br>Please help, my 3 year old daughter is very upset her campervan has been stolen.\n<br>Photos available on volkzone and just kampers forums, just search for SAV 85M on google.\n<br>\n<br>Reg: SAV 85M \n<br>VIN: 2342070358\n<br>Engine: W0207982\n<br>1974 VW Campervan, Left Hand Drive American import with orange plaid Westfalia campmobile interior.\n<br>Rough unpainted filler on bottom of doors and on front above fresh air grill. \n<br>New RH rear corner, rear valance and both sills in grey primer.\n<br>Westfalia tow bar painted orange and WELDED in (not just fitted)\n<br>Louvered windows each side\n<br>Engine lid has a non-lockable catch\n<br>Rear door has a black replacement lock. \n<br>The front seats have been retrimmed and the new orange vinyl is slightly lighter and smoother than that on the original headrests.\n<br>Rear wardrobe has 2 shelves fitted.\n<br>Rear bench seat has round 'BASIC' speakers cut into wood kick panel.\n<br>Rear overhead locker is not westfaila but hand made and the wood shade is slightly darker than other woodwork in the van\n<br>Sink unit has a vintage fan fitted to it and the sink tap is a plastic original looking replacement but with original white twist switch fitted.\n<br>Lift up roof has a replacement canvas with zip opening at front only not on sides.\n<br>Handmade paprika (red/brown) coloured curtains with blackout linings.\n<br>Reconditioned VEGE Type 4 W code fuel injection engine with central oil filler and dipstick not the usual back of the engine long tube type.\n<br>Pale grey (marble effect) stick-on vinyl on inside of sliding door &amp; side panels.\n<br>Interior cab roof panel (pale wood veneer) has been hand painted in white\n<br>\n<br>Please pass this on to anyone else you know who deals in VW's or VW parts. Update your Facebook status, put it on a blog and twitter to let friends know.\n<br>\n<br>If you spot it anywhere, or have any information please contact the police immediately or John Harrison on 07905 167811.",
    "lastEdited" : "Mon Apr 04, 2011 9:10 pm"
  } ]
}