{
  "forumId" : "8",
  "threadId" : "111883",
  "title" : "Austin the Lone Star Lefty",
  "originalUrl" : "https://ssvc.org.uk/phpbb/viewtopic.php?f=8&t=111883",
  "breadcrumbs" : [ ],
  "totalPosts" : 3,
  "pageNumber" : 1,
  "totalPages" : 1,
  "posts" : [ {
    "postId" : "844430",
    "author" : {
      "username" : "avusher",
      "userId" : "844430",
      "joined" : "Tue Jul 07, 2015 12:43 pm",
      "profileRank" : "SSVC Member",
      "location" : "-",
      "postCount" : "4",
      "avatarPath" : null
    },
    "content" : "Hello! Meet Austin our 1965 Dove Blue Texan Split screen.\n<br>\n<br>\n<img src=\"http://i300.photobucket.com/albums/nn19/avusher/927b0178-fbc0-47f4-81f4-14afd3cecc3f_zps7qzgo8we.jpg\" class=\"postimage\" alt=\"Image\">\n<img src=\"http://i300.photobucket.com/albums/nn19/avusher/f495c6df-d99b-4aa7-a058-db041e810b19_zps1kqboqqr.jpg\" class=\"postimage\" alt=\"Image\">\n<br>\n<br>\n<span style=\"font-weight: bold\">A bit about Austin's History:</span>\n<br>1965 Split Screen\n<br>Manufactured in Germany - Imported to Texas\n<br>\n<img src=\"http://i300.photobucket.com/albums/nn19/avusher/444c2d85-a96b-48e0-9da1-66de4b227d88_zpsadxjuzqf.jpg\" class=\"postimage\" alt=\"Image\">\n<br>Owned by a professor for majority of its life who taught forestry at Stephen F. Austin University, Texas \n<br>Second owner is a musical producer in Texas, he had the van for 2 years and carried out a light restoration \n<br>The van was then imported to the UK by a lovely couple in 2010 and has been in the country since\n<br>Interior: Definitely a USA conversion, could be Sundial with sink unit missing and replaced with louvre windows, need to keep researching this\n<br>\n<br>\n<span style=\"font-weight: bold\">The Vans Condition</span>\n<br>New engine transmission in 2010\n<br>Some interesting pigeon poo welding which will be seen to, guttering full of bondo, rubbers on windows need looking at, doors need to be aligned and adjusted and I’m sure there will be a lot more that we discover as we get into it. I say ‘we’ at this stage, I (Ash) am in charge of the interior and Chris is in charge of the mechanical and fabrication.\n<br>Interior needs work and a bit of research to find out what conversion it is\n<br>\n<br>\n<span style=\"font-weight: bold\">The Van Search Journey</span>\n<br>Chris and I started this journey almost a year ago, where we rented out a Split Screen from \n<a href=\"http://www.vanillasplits.com/html/home.html\" class=\"postlink\">Vanilla Splits</a> in West Sussex, to see how much we really wanted our own van. We took ‘Brian’ the van on a wakeboarding cable tour down the south of England with most of our time spent in the New Forest. I loved everything about the bus from its quirky personality to setting up camp for the day, to the whole lifestyle it brings where you can’t be in a rush, and this was all probably very visible from the huge smile I had on my face every time I saw it or sat in it.\n<br>\n<br>We started looking in to getting a bus December 2014, then moved house, changed jobs, bought a new car and before you know it its May!!! The search fully began after Chris took me on a surprise date (I was dressed for nice country pub) but drove to \n<a href=\"http://www.worldwildwagens.com/\" class=\"postlink\">World Wild Wagens</a>, Bedfordshire. We saw three real potential vans all OG paint, freshly imported from the US. We learnt a lot from the owner, thank you Biagio\n<br>\n<br>Evenings changed from dinner to chilling, to dinner and van searching. We started googling what to look for, spoke to lots of people, learnt as much as we could from SSVC forums, then started to look for vans. In an ideal world we would have an OG paint, but unfortunately they just sat outside our budget. I came across the Dove Blue van online and went to go and have a look at it. We had a really good look over the van, then spoke to the owners for a long time about its history and instantly liked it. But we couldn’t make a good judgement until we had seen more! We saw several vans, thank you to all who were part of it and gave us their advice along the way! \n<br>\n<br>We finally decided that the Dove Blue Texan Import was the van for us and picked him up on 26th July 2015 in the glorious unreliable British Summer (I can confirm he was cleaned, dried and nicely stored in the garage, we won’t make trips in the rain a regular occurrence!).\n<br>\n<br>\n<img src=\"http://i300.photobucket.com/albums/nn19/avusher/4e9fe74b-f3b7-4f12-9dec-4c3f3a261df6_zpsf0wnlf8y.jpg\" class=\"postimage\" alt=\"Image\">\n<img src=\"http://i300.photobucket.com/albums/nn19/avusher/a7e8e4d8-4080-4ced-afa2-10f66c5d5200_zpslstxl3vp.jpg\" class=\"postimage\" alt=\"Image\">\n<br>\n<br>We have named the van Austin, after the University the original owner was a professor at. It seemed the perfect fit.\n<br>\n<br>We hope to keep you posted with van updates, trips we go on and all adventures related to Austin!\n<br>\n<br>Hope you enjoy.",
    "lastEdited" : "Wed Aug 05, 2015 11:57 am"
  }, {
    "postId" : "844488",
    "author" : {
      "username" : "e m p i",
      "userId" : "844488",
      "joined" : "Fri Jan 28, 2005 3:51 pm",
      "profileRank" : "Registered user",
      "location" : "Essex but I'm nothing like the twats on the telly.",
      "postCount" : "4548",
      "avatarPath" : "./download/file.php%3Favatar=1186_1407682968.jpg"
    },
    "content" : "Welcome to the world \n<img class=\"smilies\" src=\"./images/smilies/icon_smile.gif\" alt=\":)\" title=\"Grin\"> \n<br>Glad you're happy with your purchase. They're never finished though \n<img class=\"smilies\" src=\"./images/smilies/icon_lol.gif\" alt=\":lol:\" title=\"LOL\">\n<br>\n<br>Cheers, Lee.",
    "lastEdited" : "Wed Aug 05, 2015 7:38 pm"
  }, {
    "postId" : "844535",
    "author" : {
      "username" : "Gibski",
      "userId" : "844535",
      "joined" : "Wed Aug 05, 2015 12:12 pm",
      "profileRank" : "Registered user",
      "location" : "-",
      "postCount" : "1",
      "avatarPath" : null
    },
    "content" : "Yes you are right there Lee, the list keeps getting longer and longer!\n<br>\n<br>The pas front door bottom hinge is on its last legs so it looks like i'll be beging to borrow a door pin removal tool in the next couple of weeks \n<br>\n<br>Chris",
    "lastEdited" : "Thu Aug 06, 2015 8:12 am"
  } ]
}