{
  "forumId" : "8",
  "threadId" : "107830",
  "title" : "67 Velvet Green",
  "originalUrl" : "https://ssvc.org.uk/phpbb/viewtopic.php?f=8&t=107830&start=15",
  "breadcrumbs" : [ ],
  "totalPosts" : 95,
  "pageNumber" : 2,
  "totalPages" : 7,
  "posts" : [ {
    "postId" : "818781",
    "author" : {
      "username" : "Crooky",
      "userId" : "Unknown",
      "joined" : "-",
      "profileRank" : "-",
      "location" : "-",
      "postCount" : "-",
      "avatarPath" : "./download/file.php%3Favatar=39974_1421267567.jpg"
    },
    "content" : "Cargo floor now completely removed. My back hurts \n<img src=\"./images/smilies/icon_cry.gif\" alt=\":cry:\" title=\"Cry\"> No sympathy at home though. Just need to make good now, tidy up the edges and clean the metal etc. I'm going to have a good clean of the chassis too while the floor is up and all the pipes etc. I'm really glad that part is done. Still a long way to go but very satisfying when you can see progress. Next job is to buy a super thin cutting disc to tackle the outer panels.\n<br>\n<br>I reckon I'll have all my new panels within the next day or so but don't envisage welding for a while yet. Got dual cylinder brakes to do and then want to spend time cleaning and painting bits first before floors go back in. Maybe a couple of weeks until weld time.",
    "lastEdited" : "Mon Jan 26, 2015 7:39 pm"
  }, {
    "postId" : "818782",
    "author" : {
      "username" : "Crooky",
      "userId" : "Unknown",
      "joined" : "-",
      "profileRank" : "-",
      "location" : "-",
      "postCount" : "-",
      "avatarPath" : "./download/file.php%3Favatar=39974_1421267567.jpg"
    },
    "content" : "Time Log: 23 Hours to date.",
    "lastEdited" : "Mon Jan 26, 2015 7:40 pm"
  }, {
    "postId" : "822855",
    "author" : {
      "username" : "Magic8Ball",
      "userId" : "Unknown",
      "joined" : "-",
      "profileRank" : "-",
      "location" : "-",
      "postCount" : "-",
      "avatarPath" : "http://i95.photobucket.com/albums/l129/doubledoorgf/images.jpg"
    },
    "content" : "Its gone quiet ............. \n<img src=\"./images/smilies/icon_wink.gif\" alt=\":wink:\" title=\"Wink\">",
    "lastEdited" : "Sat Feb 21, 2015 5:57 am"
  }, {
    "postId" : "822860",
    "author" : {
      "username" : "Crooky",
      "userId" : "Unknown",
      "joined" : "-",
      "profileRank" : "-",
      "location" : "-",
      "postCount" : "-",
      "avatarPath" : "./download/file.php%3Favatar=39974_1421267567.jpg"
    },
    "content" : "Guilty me lord, but the work hasn't stopped. Although you probably wouldn't know it from looking at it. I've been trying to clean up the bus and ensure I have all the right metal to go back into the bus. I want to make sure I've cleaned up as best I can underneath before I seal it all back up again. I'm pretty much ready to red oxide her up and prime parts and protect etc. \n<br>\n<br>I'm still not 100% sure how to go about the parts where I've inadvertently gone back to bare metal but not entirely. For example, on the I beams and top hats, the top is pretty much bare but the sides not. Can I just red oxide and some form of /primer/top coat the bare parts and then maybe just wax oil the sides? I don't want to do a complete strip to bare metal. \n<img src=\"./images/smilies/icon_confused.gif\" alt=\":?\" title=\"Confused\"> \n<br>\n<br>I'm also unsure if I can jack the front of the bus while the cab floor is out to do the DC Brake Kit? Seeing as I'm replacing the beam I think I;m gong to crack on and weld the cab floor and deal with the beam and brakes after otherwise things are stalling? \n<img src=\"./images/smilies/icon_confused.gif\" alt=\":?\" title=\"Confused\"> \n<br>\n<br>I also want to make sure all the little fiddly awkward to get to rough metal, like around the heater tubes, if nicely ground off so new panels fit nicely. I like things to be neat, all be it on a less than neat original bus \n<br>\n<br>I now have...................\n<br>\n<br>Cargo Floor\n<br>Cab Floor\n<br>2 x replacement complete arches (although I only need the step parts but they were cheap)\n<br>Left inner and outer sill and long panel\n<br>Left B and C Post and the strengtheners\n<br>Right inner sill, strengthener, outer bottom panel\n<br>Small panel behind cargo near to wheel arch\n<br>B and C Post cargo side\n<br>A post repair parts for under lower cab door hinges\n<br>Battery Tray\n<br>Sheet metal to do remedial little patches here and there caused during metal removal\n<br>5 x OG hub caps\n<br>Dual Brake Kit\n<br>Set of brake pipes\n<br>Almost got myself a replacement stock front beam and a buyer for my early bay d2d set up.\n<br>\n<br>I've had a trial fit of my new cab floor to give me an idea of hole punching for welds etc. And I've been dong a hell of a lot of reading and practicing on the welder with different settings. My mantra has been 'take your time, take your time.' If in doubt walk away and come back to it.\n<br>\n<br>So I'm at the point where I'm back focusing on the cab floor to get that part done so I feel like I'm making progress.\n<br>\n<br>Any help on the above questions appreciated as it's still a grey area for me. Cheers and more pictures soon.",
    "lastEdited" : "Sat Feb 21, 2015 7:18 am"
  }, {
    "postId" : "822887",
    "author" : {
      "username" : "Biglozzer",
      "userId" : "Unknown",
      "joined" : "-",
      "profileRank" : "-",
      "location" : "-",
      "postCount" : "-",
      "avatarPath" : "./download/file.php%3Favatar=644_1378328716.jpg"
    },
    "content" : "Looks good. Taking the right approach too. Will be watching this thread. \n<br>Did you buy all Autocraft panels?",
    "lastEdited" : "Sat Feb 21, 2015 11:18 am"
  }, {
    "postId" : "822894",
    "author" : {
      "username" : "Crooky",
      "userId" : "Unknown",
      "joined" : "-",
      "profileRank" : "-",
      "location" : "-",
      "postCount" : "-",
      "avatarPath" : "./download/file.php%3Favatar=39974_1421267567.jpg"
    },
    "content" : "Cheers mate, I'm finding myself looking at it a lot and figuring it all out but I feel like I need to do that to get it right. So progress is a little slow but I've a feeling it'll really pick up once I'm ready to start welding her back up.\n<br>They are mostly Autocraft but sourced some cheap Schofields complete arches through here (still cheaper than just buying a new step box section only) and the cargo floor was original VW unused stock so well chuffed with that one as it has all the correct lips at the back etc so should fit a treat.\n<br>Oh and I found myself some cheap but new frame to window seals for 6 x pop outs. Always on the hunt for original 67 parts. Looking forward to sorting the front beam asap too so the ride height is stock. The next big and hopefully final outlay (in terms of a big lump sum) is going to be sourcing original seats. \n<br>\n<br>Pockets are empty at the moment though \n<img src=\"./images/smilies/icon_eek.gif\" alt=\"8O\" title=\"eek\">",
    "lastEdited" : "Sat Feb 21, 2015 12:33 pm"
  }, {
    "postId" : "825443",
    "author" : {
      "username" : "Crooky",
      "userId" : "Unknown",
      "joined" : "-",
      "profileRank" : "-",
      "location" : "-",
      "postCount" : "-",
      "avatarPath" : "./download/file.php%3Favatar=39974_1421267567.jpg"
    },
    "content" : "Cab floor is in \n<img src=\"./images/smilies/icon_biggrin.gif\" alt=\":D\" title=\"Big Grin\">",
    "lastEdited" : "Mon Mar 09, 2015 9:55 pm"
  }, {
    "postId" : "825444",
    "author" : {
      "username" : "Crooky",
      "userId" : "Unknown",
      "joined" : "-",
      "profileRank" : "-",
      "location" : "-",
      "postCount" : "-",
      "avatarPath" : "./download/file.php%3Favatar=39974_1421267567.jpg"
    },
    "content" : "And the inner sills too \n<img src=\"./images/smilies/icon_biggrin.gif\" alt=\":D\" title=\"Big Grin\">",
    "lastEdited" : "Mon Mar 09, 2015 9:56 pm"
  }, {
    "postId" : "825449",
    "author" : {
      "username" : "Crooky",
      "userId" : "Unknown",
      "joined" : "-",
      "profileRank" : "-",
      "location" : "-",
      "postCount" : "-",
      "avatarPath" : "./download/file.php%3Favatar=39974_1421267567.jpg"
    },
    "content" : "So as of about 2 weeks ago I had never even picked up a welder let alone pulled the trigger. \n<br>\n<br>I've now replaced the upper and inner part of the cab step box section and saved the bottom and outer section so pretty pleased. The cutting of the metal to size was super tricky. I guess replacing the box section in its entirety would have been easier to cut but I wanted to save as much as of the bus as possible. I still have a little making good to do here and there but she's in primer now and I've treated the metal underneath.\n<br>\n<br>I didn't change the brakes in the end to DC as I didn't want to jack up the bus with the floors out. One step at a time!\n<br>\n<br>I've now moved onto the cargo area and today I cut the outer long sill on the near side and the cargo door side too. I took it easy and kept holding the new panels up to the bus to make sure I wasn't cutting too much metal away.\n<br>\n<br>I've now managed to weld the inner sills in too and they fit really nicely. Well done Autocraft. I've noticed though that the inner strengtheners on the non cargo side are a little short so I think I need the 2200mm one instead of the 1800mm type. I need to check their website as I hope they do longer ones!\n<br>\n<br>I finished up by starting to protect some of the metal in the cargo floor section and started to look at and plan getting the outer long sill in place and the inner strengthener and rocker on the cargo door side.\n<br>\n<br>Really looking forward to getting the OG cargo floor in now but steady steady and all that.",
    "lastEdited" : "Mon Mar 09, 2015 10:09 pm"
  }, {
    "postId" : "825540",
    "author" : {
      "username" : "Crooky",
      "userId" : "Unknown",
      "joined" : "-",
      "profileRank" : "-",
      "location" : "-",
      "postCount" : "-",
      "avatarPath" : "./download/file.php%3Favatar=39974_1421267567.jpg"
    },
    "content" : "Cargo chassis area now all cleaned up and primed on the top side and edges. The bottom will be done too. I'm going to add a layer of etch primer and then stone chip all of it in black so should look nice when done.\n<br>\n<br>Can;t believe sometimes how these buses remain so solid underneath and yet the panels get shot. Under my bus is as solid as a rock and so I just cleaned the gunk and dusty rust off with a drill and wire brush fitting. Easy job but bloody dirty. \n<br>\n<br>I've ordered the longer strengtheners from Autocraft. 220mm I believe they are. \n<br>\n<br>Next sequence of jobs:\n<br>\n<br>strengtheners and then B and C Post on non cargo side\n<br>Outer long sill\n<br>Inner strengthener and outer sill on cargo side\n<br>B and C post on cargo side\n<br>Small quarter panel to left of cargo doors to wheel arch\n<br>\n<br>I'm hoping to have this done by end of the week (one small bonus of working nights) \n<img src=\"./images/smilies/sleepy1.gif\" alt=\":sleepy1:\" title=\"sleepy1\"> \n<br>\n<br>Then it will be the exciting OG floor, I'll be buzzing if that goes well.\n<br>\n<br>Feel like I'm on a bit of a roll now but have this horrible feeling something is going to go wrong \n<img src=\"./images/smilies/icon_eek.gif\" alt=\"8O\" title=\"eek\">",
    "lastEdited" : "Tue Mar 10, 2015 7:23 pm"
  }, {
    "postId" : "825548",
    "author" : {
      "username" : "Biglozzer",
      "userId" : "Unknown",
      "joined" : "-",
      "profileRank" : "-",
      "location" : "-",
      "postCount" : "-",
      "avatarPath" : "./download/file.php%3Favatar=644_1378328716.jpg"
    },
    "content" : "Looking really good Crooky and your def cracking on there. Great bus to start with but your extending its life by another 50 years. \n<br>Looking forward to the long sill install. You going for the 300mm high or bigger?",
    "lastEdited" : "Tue Mar 10, 2015 8:33 pm"
  }, {
    "postId" : "825584",
    "author" : {
      "username" : "Crooky",
      "userId" : "Unknown",
      "joined" : "-",
      "profileRank" : "-",
      "location" : "-",
      "postCount" : "-",
      "avatarPath" : "./download/file.php%3Favatar=39974_1421267567.jpg"
    },
    "content" : "Thanks mate, I'm glad someones looking forward to the long sill \n<img src=\"./images/smilies/icon_smile.gif\" alt=\":)\" title=\"Grin\"> \n<br>\n<br>I've bought the bigger sill (300mm?) and I'm going to cut to size. Basically it needed replacing between the two smaller sizes so I've just cut out the rotten stuff and will be trimming the new one once all measured up. \n<br>\n<br>More piccies tomorrow hopefully!",
    "lastEdited" : "Tue Mar 10, 2015 10:57 pm"
  }, {
    "postId" : "825593",
    "author" : {
      "username" : "Magic8Ball",
      "userId" : "Unknown",
      "joined" : "-",
      "profileRank" : "-",
      "location" : "-",
      "postCount" : "-",
      "avatarPath" : "http://i95.photobucket.com/albums/l129/doubledoorgf/images.jpg"
    },
    "content" : "<div class=\"quotetitle\">\n Crooky wrote:\n</div>\n<div class=\"quotecontent\">\n Thanks mate, I'm glad someones looking forward to the long sill \n <img src=\"./images/smilies/icon_smile.gif\" alt=\":)\" title=\"Grin\"> \n <br>\n <br>I've bought the bigger sill (300mm?) and I'm going to cut to size. Basically it needed replacing between the two smaller sizes so I've just cut out the rotten stuff and will be trimming the new one once all measured up. \n <br>\n <br>More piccies tomorrow hopefully!\n</div>\n<br>\n<br>Are you saying you bought a 'rotten bus' from Magic ? Your doing a great job and all is going to plan as Magic originally suggested. Easier when you have a good Bus to start with. Your going to have the biggest grin on your face when the MOT man hands you a pass. But hey, I'm getting ahead of myself here, carry on welding and look after that Bus, Magic only passes on the best \n<img src=\"./images/smilies/icon_wink.gif\" alt=\":wink:\" title=\"Wink\"> \n<br>\n<br>Can we expect the next post in about an hours time ? That will be tomorrow then \n<img src=\"./images/smilies/icon_wink.gif\" alt=\":wink:\" title=\"Wink\">",
    "lastEdited" : "Tue Mar 10, 2015 11:14 pm"
  }, {
    "postId" : "825594",
    "author" : {
      "username" : "Crooky",
      "userId" : "Unknown",
      "joined" : "-",
      "profileRank" : "-",
      "location" : "-",
      "postCount" : "-",
      "avatarPath" : "./download/file.php%3Favatar=39974_1421267567.jpg"
    },
    "content" : "Definitely not mate, only that the long sill looked like a rat had been nobbling on the bottom if it \n<img src=\"./images/smilies/icon_biggrin.gif\" alt=\":D\" title=\"Big Grin\"> \n<br>\n<br>Looking forward to getting to the paint blend stage (more reading and staring at the bus) - bit depressing all that grey stuff. She needs to be back to Velvet Green asap.\n<br>\n<br>Got that front beam arriving soon too so it's stock all the way from here...............cheers and update soon.",
    "lastEdited" : "Wed Mar 11, 2015 12:18 am"
  }, {
    "postId" : "826464",
    "author" : {
      "username" : "e m p i",
      "userId" : "Unknown",
      "joined" : "-",
      "profileRank" : "-",
      "location" : "-",
      "postCount" : "-",
      "avatarPath" : "./download/file.php%3Favatar=1186_1407682968.jpg"
    },
    "content" : "Looking good there mate \n<img src=\"./images/smilies/icon_cheers.gif\" alt=\":cheers:\" title=\"cheers\"> \n<br>Nice to see all the floor strengthers in and the sill strengthners as well, you're proper stinking on with it. Be a leap forwards to get the cargo floor in as well. \n<br>Keep up the good work \n<img src=\"./images/smilies/icon_cool.gif\" alt=\"8)\" title=\"Cool\"> \n<br>\n<br>Cheers, Lee.",
    "lastEdited" : "Tue Mar 17, 2015 4:54 pm"
  } ]
}