{
  "forumId" : "8",
  "threadId" : "35703",
  "title" : "1963 SPLIT SCREEN SENSATION",
  "originalUrl" : "https://ssvc.org.uk/phpbb/viewtopic.php?f=8&t=35703",
  "breadcrumbs" : [ {
    "url" : "./viewforum.php?f=8&sid=6dba53584a926113b62d1c3a47a1db68",
    "label" : "Rides and Projects"
  } ],
  "totalPosts" : 80,
  "pageNumber" : 1,
  "totalPages" : 6,
  "posts" : [ {
    "postId" : "261946",
    "author" : {
      "username" : "Dexter",
      "userId" : "261946",
      "joined" : "Sun Oct 21, 2007 8:32 am",
      "profileRank" : "Registered user",
      "location" : "HACKNEY, LONDON",
      "postCount" : "51",
      "avatarPath" : null
    },
    "content" : "Ok, my project is really getting going now, so I though I better document it somewhere and keep a log of the restoration of my 1963 Split screen bus. First I will fill in the story so far and then keep it updated week by week as the project progresses, so here goes….\n<br>\n<br>It all started around March this year, when I was dropping a friend of mine home to her house, When we pulled up outside I sore this battered old Orange Bay window camper Van, My friend then explained that the Camper Van was her boyfriends and that he had bought it to do up, but is now thinking of selling it, so I got out and had a look at it, a week later, I had bought it of him and was the proud new owner, I then set about buying loads of new bits for it. \n<br>\n<br>\n<img src=\"http://i216.photobucket.com/albums/cc207/DEXT100/l_4351a4c99f2f31c08b383a8413c5d2f9.jpg\" class=\"postimage\" alt=\"Image\">\n<br>\n<img src=\"http://i216.photobucket.com/albums/cc207/DEXT100/l_00c2e2c8939e354908b7b51b0fd94e7b.jpg\" class=\"postimage\" alt=\"Image\">\n<br>\n<br>Then after spending this small fortune on the bits for it I then realized that it was a converted panel van, (which had the windows cut out of it to turn it into a camper), which meant the windows were not recessed… This drove me nuts as I this was something that would always bug me and as I was going to give it the full works, it would of just of been a waste of money, so it had to go and I set about finding a new van, the old one went on eBay and I could not believe the amount of interest in it, (but it was just before run to the sun \n<img class=\"smilies\" src=\"./images/smilies/icon_smile.gif\" alt=\":)\" title=\"Grin\"> \n<!-- m -->\n<a class=\"postlink\" href=\"http://profile.myspace.com/index.cfm?fu\" onclick=\"window.open(this.href);return false;\">http://profile.myspace.com/index.cfm?fu</a>\n<!-- m --> ... bb8fc59de0 \n<br>\n<br>\n<br>Anyways I found a guy called Kerry who imports VW’s from Oz ( \n<!-- m -->\n<a class=\"postlink\" href=\"http://www.outback-kombis.co.uk\" onclick=\"window.open(this.href);return false;\">http://www.outback-kombis.co.uk</a>\n<!-- m --> ) and I found another Bay which was totally mint and also an automatic which was great as the misses can only drive an auto but it wasn’t going to arrive for another 6 weeks, so this gave me plenty of time to plan what I was going to do to it, so I took a trip to Bernard Newbury’s House ( \n<!-- m -->\n<a class=\"postlink\" href=\"http://www.bernardnewbury.co.uk\" onclick=\"window.open(this.href);return false;\">http://www.bernardnewbury.co.uk</a>\n<!-- m --> ) to discuss the project, he then put me in contact with Simon Weltz of Interior motive ( \n<!-- m -->\n<a class=\"postlink\" href=\"http://www.interiormotiveuk.com\" onclick=\"window.open(this.href);return false;\">http://www.interiormotiveuk.com</a>\n<!-- m --> ) who is the master of all wood work and all things electrical, but is also very busy and was booked up until Jan08, but I think his work is worth the wait, so I went to see him at his work shop and had a good chat about what I could have in my van. Great! All going well, so as soon as it was off the boat I went down there to do the deal and pick it up, but when I got there the van was making a real bad sound so I could not take it, the guy selling it had also just imported a One owner from new 1956 Oval for himself (more about this later). \n<br>\n<br>\n<img src=\"http://i216.photobucket.com/albums/cc207/DEXT100/shippingpics008.jpg\" class=\"postimage\" alt=\"Image\">\n<br>\n<br>So a bit disappointed I when back home and waited for him to call me back to say it was fixed, but in this time I saw the light and thought why am I buying a bay, same as the recessed window thing it would always bug me that I did not go for a Splity, So then the hunt began for a good right hand drive Split! The words Horse, Sh*t and Rocking spring to mind as this was really hard to find as most imports were LHD, UK bus’s were few and far between or are either already done up – which was not really an option as I wanted to start from the ground up and did not want to pay for a done bus then pull it apart and the other UK bus’s that I saw were just to far gone and full of rust and I did not want a patch work quilt with loads and loads of welding going on, but in the end I found someone called Scott ( \n<!-- m -->\n<a class=\"postlink\" href=\"http://www.vwclassics.co.uk\" onclick=\"window.open(this.href);return false;\">http://www.vwclassics.co.uk</a>\n<!-- m --> ) on the Samba that has just started importing bus’s from his home land South Africa, He had a Fleetline for sale and a Couple of 11 window splits up for grabs, so I got on the blower and got him to send as many pics he had of it over the email, after a good chat with him it turns out this was his uncles bus and he had owned a Scrap yard and one day he turned up to the scrap yard to find his workers were over buy the crusher with a Split Screen bus just about to be crushed!!!, so the uncle not being a stupid man, rushed over and saved it, he then spend a while restoring it and getting it road worthy and then after a few more years when Scott went to visit him, he agreed to sell it to him and the rest is history as they say. So I then put a deposit on it and waited for it to arrive in this country. \n<br>\n<br>\n<img src=\"http://i216.photobucket.com/albums/cc207/DEXT100/25July013.jpg\" class=\"postimage\" alt=\"Image\">\n<br>[IMG]http://i216.photobucket.com\n<br>/albums/cc207/DEXT100/25July012.jpg[/IMG]\n<br>\n<img src=\"http://i216.photobucket.com/albums/cc207/DEXT100/25July007.jpg\" class=\"postimage\" alt=\"Image\">\n<br>\n<img src=\"http://i216.photobucket.com/albums/cc207/DEXT100/25July004.jpg\" class=\"postimage\" alt=\"Image\">\n<br>\n<br>In the mean time I got a bit bored and saw that Kerry that had the Mint bay for sales was having to sell his Oval, So in a moment of madness I bought it, at the minute its sitting in storage, until I sort out the bus (or I hope it is as I have not checked on it for a while). \n<br>\n<br>\n<img src=\"http://i216.photobucket.com/albums/cc207/DEXT100/56beatle2023.jpg\" class=\"postimage\" alt=\"Image\">\n<br>\n<img src=\"http://i216.photobucket.com/albums/cc207/DEXT100/PICT2969.jpg\" class=\"postimage\" alt=\"Image\">\n<br>\n<br>Anyway back to the bus. After a bit of looking around for a good workshop in the area to do the work I wanted doing on the bus I came across Anthony F who had paint shop called Street sleds, but was just starting a new company called Autostyl ( \n<!-- m -->\n<a class=\"postlink\" href=\"http://www.autostyl.co.uk\" onclick=\"window.open(this.href);return false;\">http://www.autostyl.co.uk</a>\n<!-- m --> ), which would offer a complete Resto service with some of the top bods in the business working together to offer a top service, so I sent them a list of what I wanted and then they agreed that it would be best that Anthony would Manage and take on the project down there and that I would deal with him on the phone and over then email as I’m miles away in London. So at the moment they have the Bus Striped and they have got it onto the Rolling rig so they can do a really good job on the underneath etc. Anthony has found a blaster which he trusts not to mess the panels and has now sent it off and it should be back sometime next week, I am planning on going down in the next couple of weeks to have a good look at the condition its in once it comes back from the blasters, Anthony has also order some panels that he knows its going to need to be getting on with until I can get down there.\n<br>\n<br>\n<img src=\"http://i216.photobucket.com/albums/cc207/DEXT100/Dexter-07.jpg\" class=\"postimage\" alt=\"Image\">\n<br>\n<img src=\"http://i216.photobucket.com/albums/cc207/DEXT100/Dexter-08.jpg\" class=\"postimage\" alt=\"Image\">\n<br>\n<img src=\"http://i216.photobucket.com/albums/cc207/DEXT100/Dexter-09.jpg\" class=\"postimage\" alt=\"Image\">\n<br>\n<img src=\"http://i216.photobucket.com/albums/cc207/DEXT100/Dexter-10.jpg\" class=\"postimage\" alt=\"Image\">\n<br>\n<img src=\"http://i216.photobucket.com/albums/cc207/DEXT100/Dexter-11.jpg\" class=\"postimage\" alt=\"Image\">\n<br>\n<br>So this is what I am planning to do to it so far… Bare metal respray to inside and out including engine bay etc., top half white gloss and bottom bright red gloss, not sure what code yet – am after a real nice deep bright red – saw a pic of a bus which was blood red and this looked good, but I have not seen it in the flesh, so can’t tell if this is what I’m after? On the inside I would like all white including steering column, pedals etc\n<br>\n<br>All underneath under sealing or painting not sure yet, At the moment the inside parts are all black, (grab handle, knobs, steering wheel etc) I want to replace them all with white parts and also fit new chrome bits where necessary, I just want it to look nice, clean and smooth (please see pic attached of inside to give rough idea what I mean) \n<br>\n<br>\n<img src=\"http://i216.photobucket.com/albums/cc207/DEXT100/INSIDE.jpg\" class=\"postimage\" alt=\"Image\">\n<br>\n<br>I would like polished/chrome pop out windows all round including front and back safari’s, I’m not sure where to get these from, I was think about getting these from Creative ( \n<!-- m -->\n<a class=\"postlink\" href=\"http://www.creative-engineering.com\" onclick=\"window.open(this.href);return false;\">http://www.creative-engineering.com</a>\n<!-- m --> ) , but I have heard mixed reports – anyone got any comments on these or any other makes etc..?, I'm thinking of ordering all new seals from Status-VW ( \n<!-- m -->\n<a class=\"postlink\" href=\"http://www.status-vw.co.uk\" onclick=\"window.open(this.href);return false;\">http://www.status-vw.co.uk</a>\n<!-- m --> ) and all new glass for all windows, also at the moment the door top frames are in black but want them to look polished- I can only find new ones to buy supplied in primer, does anyone know anyone who supplies them polished?, don’t really want to chrome them as they will look different from the pop outs and will need re chroming every year to keep looking spot on? \n<br>\n<br>The wing mirrors on the bus at the moment are going and new original ones (the round ones on the door hinge) and also full deluxe trim from Status-VW is going on and a New chrome front nose badge and chrome Volkswagen badge to the rear on the left side of the boot lid and some stainless steel US spec bumpers\n<br>\n<br>Also I want to put an IRS kit on the back – not sure to go for weald on or bolt on, bolt on seams to be the best option at the moment as its not so permanent, any thoughts welcome?, also who sells the best bolt on kit? (Boxwagen? \n<!-- m -->\n<a class=\"postlink\" href=\"http://www.boxwagen.co.uk\" onclick=\"window.open(this.href);return false;\">http://www.boxwagen.co.uk</a>\n<!-- m --> ) Then there’s the front end which will need sorting and the bakes, was thinking some sort of Porsche bakes as I fancy some fushers wheels – again, should I source some real ones or Flat 4 replicas and what size?, should I have wider on the back?, I saw some16 inch real ones on the Karmann Konnection website ( \n<!-- m -->\n<a class=\"postlink\" href=\"http://www.karmannkonnection.com\" onclick=\"window.open(this.href);return false;\">http://www.karmannkonnection.com</a>\n<!-- m --> ) that were cheaper than the 15inch ones???, 16 inch has got to be better?, does anyone know of any fitting/clearance problems with 16’s on a split with Porsche brakes,\n<br>\n<br>I also want to change the shifter in the bus, any ideas which the best one is? (CSP/berg/empi etc.) and then I will be think about what to do with engine, I want it to be reliable rather than super fast although I do want it to be quicker than it is now!, but no more than a 2.0 L, And then once I have robed another bank it will going of to Simon Weltz for the wood work etc.., I’m thinking – two benches facing each other with a high gloss grey store away table with a VW logo in white on it and electric hook up with plug points under the seats, some extra lighting and a pop up TV coming up from in between the bulkhead and the first bench seat, also a nice quality stereo with all speakers hidden behind acoustic cloth, which is where Bernard Newbury comes in, all the seats/door cards to be trimmed in an off white detailed stitched leather and a grey cloth headliner down to the waste line and then that should be it!!!\n<br>\n<br>Any thoughts or advice on the above is welcome and appreciated as I have not done this before and am after all the help I can get, I’ll keep this updated as soon as I have any more info or pics to put up",
    "lastEdited" : "Mon Oct 22, 2007 7:04 pm"
  }, {
    "postId" : "261963",
    "author" : {
      "username" : "BROOKSY",
      "userId" : "261963",
      "joined" : "Thu Apr 17, 2003 9:59 pm",
      "profileRank" : "Registered user",
      "location" : "In front of the computer",
      "postCount" : "1769",
      "avatarPath" : "http://s28.photobucket.com/albums/c202/mikemelbrooks/th_bigbrewer.gif"
    },
    "content" : "<blockquote class=\"uncited\">\n <div>\n  I would like polished/chrome pop out windows all round including front and back safari’s, I’m not sure where to get these from, I was think about getting these from Creative ( \n  <!-- m -->\n  <a class=\"postlink\" href=\"http://www.creative-engineering.com\">http://www.creative-engineering.com</a>\n  <!-- m --> ) , but I have heard mixed reports – anyone got any comments on these or any other makes etc..?, I'm thinking of ordering all new seals from Status-VW ( \n  <!-- m -->\n  <a class=\"postlink\" href=\"http://www.status-vw.co.uk\">http://www.status-vw.co.uk</a>\n  <!-- m --> ) and all new glass for all windows, also at the moment the door top frames are in black but want them to look polished- I can only find new ones to buy supplied in primer, does anyone know anyone who supplies them polished?, don’t really want to chrome them as they will look different from the pop outs and will need re chroming every year to keep looking spot on? \n </div>\n</blockquote> \n<br>The door tops are made from steel which would start to rust in hours. You might be able to get some one to make you a pair from stainless steel but they are a complex profile and it wouldn't be easy. \n<br>Shawn has 16inch fuch fitted to his van so is the best person to talk to. Bear in mind that the width is also important and that tyres are more limited in choice for size. \n<br>Mike",
    "lastEdited" : "Mon Oct 22, 2007 7:51 pm"
  }, {
    "postId" : "261983",
    "author" : {
      "username" : "Dexter",
      "userId" : "261983",
      "joined" : "Sun Oct 21, 2007 8:32 am",
      "profileRank" : "Registered user",
      "location" : "HACKNEY, LONDON",
      "postCount" : "51",
      "avatarPath" : null
    },
    "content" : "Cheers Mike, I spoke to Kerry at VW Evolution today and he said that they have some stainless steel door tops in the pipe line but are not sure when they will be on sale yet, but he did say that stainless steel pop outs were also coming soon which is good news, i think stainless steel is the way to go so shall be ordering these + bumbers and wing mirrors from him as soon as he has them in \n<img class=\"smilies\" src=\"./images/smilies/icon_wink.gif\" alt=\":wink:\" title=\"Wink\">",
    "lastEdited" : "Mon Oct 22, 2007 8:31 pm"
  }, {
    "postId" : "262975",
    "author" : {
      "username" : "Dexter",
      "userId" : "262975",
      "joined" : "Sun Oct 21, 2007 8:32 am",
      "profileRank" : "Registered user",
      "location" : "HACKNEY, LONDON",
      "postCount" : "51",
      "avatarPath" : null
    },
    "content" : "The bus is back from the blasters!! the blasters left the flat panels to avoid the chance of warping them, so Anthony has set about removing the paint, filler etc from them over the last few days. The bare metal has then been given a light coat of etch primer to protect it while they move onto the other panels, roof etc. The repair panels will be with them Monday, so they are hoping to break the worst of the welding next week. The blasting hasn't really revealed much in the way of rot which is great. Some panel damage, but really for a 45yr old truck, its in great shape \n<br> \n<br> \n<br>\n<img src=\"http://i216.photobucket.com/albums/cc207/DEXT100/p1000601.jpg\" class=\"postimage\" alt=\"Image\"> \n<br>\n<img src=\"http://i216.photobucket.com/albums/cc207/DEXT100/p1000602.jpg\" class=\"postimage\" alt=\"Image\"> \n<br>\n<img src=\"http://i216.photobucket.com/albums/cc207/DEXT100/p1000625.jpg\" class=\"postimage\" alt=\"Image\"> \n<br>\n<img src=\"http://i216.photobucket.com/albums/cc207/DEXT100/p1000626.jpg\" class=\"postimage\" alt=\"Image\"> \n<br>\n<img src=\"http://i216.photobucket.com/albums/cc207/DEXT100/p1000627.jpg\" class=\"postimage\" alt=\"Image\">",
    "lastEdited" : "Sat Oct 27, 2007 8:16 am"
  }, {
    "postId" : "262995",
    "author" : {
      "username" : "Reggie",
      "userId" : "262995",
      "joined" : "Mon Nov 22, 2004 7:35 pm",
      "profileRank" : "SSVC Member",
      "location" : "blackpool",
      "postCount" : "3984",
      "avatarPath" : null
    },
    "content" : "Some great ideas you have there for brakes irs and beams etc, i can recommend Paul at Type 2 detectives \n<br>Its going to cost an arm and leg but it will be a stunner \n<br>please keep us posted si",
    "lastEdited" : "Sat Oct 27, 2007 11:06 am"
  }, {
    "postId" : "263008",
    "author" : {
      "username" : "Dexter",
      "userId" : "263008",
      "joined" : "Sun Oct 21, 2007 8:32 am",
      "profileRank" : "Registered user",
      "location" : "HACKNEY, LONDON",
      "postCount" : "51",
      "avatarPath" : null
    },
    "content" : "Have just brought these off Matt Keene for the front OG 1967 (5.5x15) \n<br> \n<br>\n<img src=\"http://i216.photobucket.com/albums/cc207/DEXT100/b-1.jpg\" class=\"postimage\" alt=\"Image\"> \n<br> \n<br>...And these OG 1970 6x15 deepdish for the back.....gonna look the dog's ding dangs!! \n<br> \n<br>\n<img src=\"http://i216.photobucket.com/albums/cc207/DEXT100/c-1.jpg\" class=\"postimage\" alt=\"Image\">",
    "lastEdited" : "Sat Oct 27, 2007 12:42 pm"
  }, {
    "postId" : "263311",
    "author" : {
      "username" : "Dexter",
      "userId" : "263311",
      "joined" : "Sun Oct 21, 2007 8:32 am",
      "profileRank" : "Registered user",
      "location" : "HACKNEY, LONDON",
      "postCount" : "51",
      "avatarPath" : null
    },
    "content" : "<img src=\"http://i216.photobucket.com/albums/cc207/DEXT100/p1000619.jpg\" class=\"postimage\" alt=\"Image\"> \n<br> \n<br>Roof now taken right back to the bare bones \n<br> \n<br>\n<img src=\"http://i216.photobucket.com/albums/cc207/DEXT100/p1000633.jpg\" class=\"postimage\" alt=\"Image\">",
    "lastEdited" : "Sun Oct 28, 2007 11:56 pm"
  }, {
    "postId" : "263322",
    "author" : {
      "username" : "vwbuzzers",
      "userId" : "263322",
      "joined" : "Thu Apr 17, 2003 11:24 am",
      "profileRank" : "SSVC Member",
      "location" : "posh part of Salford",
      "postCount" : "11614",
      "avatarPath" : "./download/file.php%3Favatar=34_1253389696.jpg"
    },
    "content" : "looking good and a bit of a winding road to get to your dream van hey. Had dealings with the garage in Cornwall a few years back when on holiday i found them very helpfull",
    "lastEdited" : "Mon Oct 29, 2007 12:38 am"
  }, {
    "postId" : "263784",
    "author" : {
      "username" : "Dexter",
      "userId" : "263784",
      "joined" : "Sun Oct 21, 2007 8:32 am",
      "profileRank" : "Registered user",
      "location" : "HACKNEY, LONDON",
      "postCount" : "51",
      "avatarPath" : null
    },
    "content" : "Longside, outriggers, inner sill and outer sill now on.... \n<br> \n<br>\n<img src=\"http://i216.photobucket.com/albums/cc207/DEXT100/p1000689.jpg\" class=\"postimage\" alt=\"Image\"> \n<br> \n<br>\n<img src=\"http://i216.photobucket.com/albums/cc207/DEXT100/p1000656.jpg\" class=\"postimage\" alt=\"Image\"> \n<br> \n<br>\n<img src=\"http://i216.photobucket.com/albums/cc207/DEXT100/p1000657.jpg\" class=\"postimage\" alt=\"Image\"> \n<br> \n<br>\n<img src=\"http://i216.photobucket.com/albums/cc207/DEXT100/p1000658.jpg\" class=\"postimage\" alt=\"Image\"> \n<br> \n<br>\n<img src=\"http://i216.photobucket.com/albums/cc207/DEXT100/p1000660.jpg\" class=\"postimage\" alt=\"Image\"> \n<br> \n<br>\n<img src=\"http://i216.photobucket.com/albums/cc207/DEXT100/p1000663.jpg\" class=\"postimage\" alt=\"Image\"> \n<br> \n<br>\n<img src=\"http://i216.photobucket.com/albums/cc207/DEXT100/p1000669.jpg\" class=\"postimage\" alt=\"Image\"> \n<br> \n<br>\n<img src=\"http://i216.photobucket.com/albums/cc207/DEXT100/p1000666.jpg\" class=\"postimage\" alt=\"Image\"> \n<br> \n<br>\n<img src=\"http://i216.photobucket.com/albums/cc207/DEXT100/p1000676.jpg\" class=\"postimage\" alt=\"Image\"> \n<br> \n<br>\n<img src=\"http://i216.photobucket.com/albums/cc207/DEXT100/p1000692.jpg\" class=\"postimage\" alt=\"Image\"> \n<br> \n<br>\n<img src=\"http://i216.photobucket.com/albums/cc207/DEXT100/p1000695.jpg\" class=\"postimage\" alt=\"Image\"> \n<br> \n<br>\n<img src=\"http://i216.photobucket.com/albums/cc207/DEXT100/p1000699.jpg\" class=\"postimage\" alt=\"Image\">",
    "lastEdited" : "Tue Oct 30, 2007 11:10 pm"
  }, {
    "postId" : "264504",
    "author" : {
      "username" : "Dexter",
      "userId" : "264504",
      "joined" : "Sun Oct 21, 2007 8:32 am",
      "profileRank" : "Registered user",
      "location" : "HACKNEY, LONDON",
      "postCount" : "51",
      "avatarPath" : null
    },
    "content" : "Doors are back from the blaster now, so able to crack on with the front arches. \n<br> \n<br>\n<img src=\"http://i216.photobucket.com/albums/cc207/DEXT100/p1000720.jpg\" class=\"postimage\" alt=\"Image\"> \n<br> \n<br>\n<img src=\"http://i216.photobucket.com/albums/cc207/DEXT100/p1000732.jpg\" class=\"postimage\" alt=\"Image\"> \n<br> \n<br>\n<img src=\"http://i216.photobucket.com/albums/cc207/DEXT100/p1000741.jpg\" class=\"postimage\" alt=\"Image\"> \n<br> \n<br>\n<img src=\"http://i216.photobucket.com/albums/cc207/DEXT100/p1000742.jpg\" class=\"postimage\" alt=\"Image\">",
    "lastEdited" : "Fri Nov 02, 2007 10:15 pm"
  }, {
    "postId" : "264578",
    "author" : {
      "username" : "Vermeulen",
      "userId" : "264578",
      "joined" : "Sun Sep 25, 2005 8:47 pm",
      "profileRank" : "Registered user",
      "location" : "Belgium",
      "postCount" : "713",
      "avatarPath" : "http://img.photobucket.com/albums/v296/blackred206cc/Lemorrisbus.gif"
    },
    "content" : "That bus is coming together real great . \n<br>Nice job !",
    "lastEdited" : "Sat Nov 03, 2007 9:55 am"
  }, {
    "postId" : "265054",
    "author" : {
      "username" : "Dexter",
      "userId" : "265054",
      "joined" : "Sun Oct 21, 2007 8:32 am",
      "profileRank" : "Registered user",
      "location" : "HACKNEY, LONDON",
      "postCount" : "51",
      "avatarPath" : null
    },
    "content" : "Thanks, The metal work has seen some real progress this week. The bus is starting to really look right again now. The longside panel sill and its inner and outriggers are on, as are the wheel arches on both sides with the door gaps looking great. The panels underneath that required attention in order to safely secure the new panels are now sorted, we are now just waiting for the last outrigger and a nose repair panel to arrive to finish off the other side sills and outriggers, and fit and weld in the front valance. \n<br> \n<br>\n<img src=\"http://i216.photobucket.com/albums/cc207/DEXT100/p1000743.jpg\" class=\"postimage\" alt=\"Image\"> \n<br> \n<br>\n<img src=\"http://i216.photobucket.com/albums/cc207/DEXT100/p1000744.jpg\" class=\"postimage\" alt=\"Image\"> \n<br> \n<br>\n<img src=\"http://i216.photobucket.com/albums/cc207/DEXT100/p1000748.jpg\" class=\"postimage\" alt=\"Image\"> \n<br> \n<br>\n<img src=\"http://i216.photobucket.com/albums/cc207/DEXT100/p1000752.jpg\" class=\"postimage\" alt=\"Image\"> \n<br> \n<br>\n<img src=\"http://i216.photobucket.com/albums/cc207/DEXT100/p1000753.jpg\" class=\"postimage\" alt=\"Image\"> \n<br> \n<br>\n<img src=\"http://i216.photobucket.com/albums/cc207/DEXT100/p1000755.jpg\" class=\"postimage\" alt=\"Image\"> \n<br> \n<br>\n<img src=\"http://i216.photobucket.com/albums/cc207/DEXT100/p1000756.jpg\" class=\"postimage\" alt=\"Image\"> \n<br> \n<br>\n<img src=\"http://i216.photobucket.com/albums/cc207/DEXT100/p1000757.jpg\" class=\"postimage\" alt=\"Image\">",
    "lastEdited" : "Sun Nov 04, 2007 9:46 pm"
  }, {
    "postId" : "267106",
    "author" : {
      "username" : "Dexter",
      "userId" : "267106",
      "joined" : "Sun Oct 21, 2007 8:32 am",
      "profileRank" : "Registered user",
      "location" : "HACKNEY, LONDON",
      "postCount" : "51",
      "avatarPath" : null
    },
    "content" : "What's new... \n<br> \n<br>Cut away rear quarter panel. Fit floor to inner sill. Profile and fit outer sill. Prep B-post and C-post. Dry fit with doors on the bus. \n<br> \n<br>Weld inner sill in. Weld b-post and c-post. Fit and weld quarter sill. Fabricate and weld in repair panel to inner wheel arch. Fit sill between b and c posts. Paint A and B post internally with bonda rust inhibitor. Prep front valance, extend centre up to the nose. Prep the nose, remove perforations in the inner valance. Fit and weld in nose drain to prevent further water trap. Fit captive nuts for under tray. Fit front valance, prep, weld sides and dress back. \n<br> \n<br>Weld repair to top hat section. Fit and weld remaining outrigger. All outriggers now completed. Weld front outrigger to I-section and sill. \n<br> \n<br>Re-fabricate outer sill panel, using stiffener off cheap panel, grafted onto Autocraft higher quality outer panel. Cut floor to fit. Fit modified sill and weld in. Repair door reveal left, repair door reveal right, weld and grind. Dress and grind sill edge floor line. Cut out nearside and offside cab floors. Remove shifter and handbrake mounts. Repair fatigued joint of shift turret to crossmember. Grind surfaces. Trial fit floors. \n<br> \n<br>\n<img src=\"http://i216.photobucket.com/albums/cc207/DEXT100/p1000758.jpg\" class=\"postimage\" alt=\"Image\"> \n<br> \n<br>\n<img src=\"http://i216.photobucket.com/albums/cc207/DEXT100/p1000759.jpg\" class=\"postimage\" alt=\"Image\"> \n<br> \n<br>\n<img src=\"http://i216.photobucket.com/albums/cc207/DEXT100/p1000766.jpg\" class=\"postimage\" alt=\"Image\"> \n<br> \n<br>\n<img src=\"http://i216.photobucket.com/albums/cc207/DEXT100/p1000767.jpg\" class=\"postimage\" alt=\"Image\"> \n<br> \n<br>\n<img src=\"http://i216.photobucket.com/albums/cc207/DEXT100/p1000769.jpg\" class=\"postimage\" alt=\"Image\"> \n<br> \n<br>\n<img src=\"http://i216.photobucket.com/albums/cc207/DEXT100/p1000773.jpg\" class=\"postimage\" alt=\"Image\"> \n<br> \n<br>\n<img src=\"http://i216.photobucket.com/albums/cc207/DEXT100/p1000776.jpg\" class=\"postimage\" alt=\"Image\"> \n<br> \n<br>\n<img src=\"http://i216.photobucket.com/albums/cc207/DEXT100/p1000783.jpg\" class=\"postimage\" alt=\"Image\"> \n<br> \n<br>\n<img src=\"http://i216.photobucket.com/albums/cc207/DEXT100/p1000788.jpg\" class=\"postimage\" alt=\"Image\"> \n<br> \n<br>\n<img src=\"http://i216.photobucket.com/albums/cc207/DEXT100/p1000791.jpg\" class=\"postimage\" alt=\"Image\"> \n<br> \n<br>\n<img src=\"http://i216.photobucket.com/albums/cc207/DEXT100/p1000796.jpg\" class=\"postimage\" alt=\"Image\"> \n<br> \n<br>\n<img src=\"http://i216.photobucket.com/albums/cc207/DEXT100/p1000798.jpg\" class=\"postimage\" alt=\"Image\"> \n<br> \n<br>\n<img src=\"http://i216.photobucket.com/albums/cc207/DEXT100/p1000810.jpg\" class=\"postimage\" alt=\"Image\"> \n<br> \n<br>\n<img src=\"http://i216.photobucket.com/albums/cc207/DEXT100/p1000815.jpg\" class=\"postimage\" alt=\"Image\"> \n<br> \n<br>\n<img src=\"http://i216.photobucket.com/albums/cc207/DEXT100/p1000817.jpg\" class=\"postimage\" alt=\"Image\"> \n<br> \n<br>\n<img src=\"http://i216.photobucket.com/albums/cc207/DEXT100/p1000820.jpg\" class=\"postimage\" alt=\"Image\"> \n<br> \n<br>\n<img src=\"http://i216.photobucket.com/albums/cc207/DEXT100/p1000827.jpg\" class=\"postimage\" alt=\"Image\"> \n<br> \n<br>\n<img src=\"http://i216.photobucket.com/albums/cc207/DEXT100/p1000831.jpg\" class=\"postimage\" alt=\"Image\">",
    "lastEdited" : "Mon Nov 12, 2007 9:47 pm"
  }, {
    "postId" : "268087",
    "author" : {
      "username" : "SplitBusVanatic",
      "userId" : "268087",
      "joined" : "Wed Oct 12, 2005 12:19 pm",
      "profileRank" : "Registered user",
      "location" : "-",
      "postCount" : "297",
      "avatarPath" : "http://i65.photobucket.com/albums/h214/splitbusvanatic/vwbusrestorationapr2006015.jpg"
    },
    "content" : "great thread, and some top work being done.. \n<br> \n<img class=\"smilies\" src=\"./images/smilies/icon_biggrin.gif\" alt=\":D\" title=\"Big Grin\">",
    "lastEdited" : "Thu Nov 15, 2007 10:50 pm"
  }, {
    "postId" : "268105",
    "author" : {
      "username" : "Bergy",
      "userId" : "268105",
      "joined" : "Fri May 30, 2003 8:37 am",
      "profileRank" : "Registered user",
      "location" : "Dorset",
      "postCount" : "3854",
      "avatarPath" : "./download/file.php%3Favatar=294_1256210293.jpg"
    },
    "content" : "great work there matey ! \n<img class=\"smilies\" src=\"./images/smilies/icon_biggrin.gif\" alt=\":D\" title=\"Big Grin\">",
    "lastEdited" : "Fri Nov 16, 2007 7:47 am"
  } ]
}