{
  "forumId" : "8",
  "threadId" : "97088",
  "title" : "Can SSVC be my eyes and ears??? Vic the '61",
  "originalUrl" : "https://ssvc.org.uk/phpbb/viewtopic.php?f=8&t=97088",
  "breadcrumbs" : [ {
    "url" : "./viewforum.php?f=8&sid=ba2b9e3a53a300d24c677de37ec26400",
    "label" : "Rides and Projects"
  } ],
  "totalPosts" : 124,
  "pageNumber" : 1,
  "totalPages" : 9,
  "posts" : [ {
    "postId" : "743200",
    "author" : {
      "username" : "rjy1966",
      "userId" : "743200",
      "joined" : "Sat Jul 06, 2013 8:39 pm",
      "profileRank" : "Registered user",
      "location" : "-",
      "postCount" : "41",
      "avatarPath" : null
    },
    "content" : "I love this forum. I have spent many, many hours over the last several months reading the various restoration threads and have found the whole thing just amazing. I am perhaps in a unique situation in that I do not have the time or ability to restore anything. It is fascinating to watch and see what you guys can do (markp and panman, you guys are my idols) but beyond watching there isnt much I can do.\n<br>\n<br>So here is my position and request. I live in Canada for another month and am then moving to the Cayman Islands where I expect to stay permanently. We have a nice house in Cayman and have a lot of friends, family and clients that come to visit throughout the year and we are constantly picking these folks up at the airport and touring them around the island during their stay. My wife was saying about 3-4 months ago that she would love to be driving a vintage VW bus to do these various road trips and that she just finds the thought \"happy\". Let me also throw in that my wife and I have been together about 12 years and she is brilliant and has been incredibly significant in helping me grow my business 1000% in the last ten years and she never asks for or wants anything for herself. So I started to ask her a few questions about what she likes about the idea and a potential look and I now have a really solid sense of what her dream vehicle will look like. I have already requested a set of custom license plates in Cayman that will say \"A VW\" which is very cool because it also happens to be her initials....seriously, he initials are A VW.\n<br>So I started looking around and talking to a few restorers and people that have done their own buses. I eventually found a young guy in England that I enjoyed talking to and he was very excited at the prospect of having his small restoration/customization company take on what I wanted as a project. I came to the decision that what I wanted is a 1961 bus (the year my wife was born). I want a walkthrough. I want double doors. Then I started to do more research and as it turns out, 1961 is the lowest production year and the combination of items I want is incredibly hard to find. I found US 1961 bus that wasnt in too bad condition and not really what I was after (no walk through and no double doors) but I figured my guy can make whatever I want so we bought it and asked to have it shipped and was told 3-4 weeks it would be at the shop in England. After 4 weeks a call was made and we were told that the bus is still in the US waiting for more buses to be shipped with it so it is worthwhile (very, very frustrating information to get) and that it might be another 2-4 weeks. Then, 30 hours ago a bus came up on The Samba that is a 1961 double door walk through panel. I called the guy who had it and bought it immediately and am very excited to have what I wanted. Its a panel van but adding windows shouldnt be too hard. I have arranged for shipping with a huge auto shipping company and they will be picking it up in the US and it will be in the shop in England in 22-27 days I am assured.\n<br>\n<br>Now for my request from the people on this site. I would like the chap doing the work to post the entire progress on this thread and have you all be my eyes and ears because I dont know what I am doing and you guys really do. I figured that you can help me ensure I get a quality bus that has been done properly and I would love you to provide all the feedback you can. The bus will be living in Grand Cayman for the next 50 years hopefully and the salt air is something that I want to make sure the bus is fully protected from so I want everything possible coated and protected. Again, this is not what I know so I need help. I have asked the guy who will be doing the work and he is fine with all the feedback and will post all kinds of pictures. I am just really hoping that you will agree to help because I really dont want one of those nightmare bus restoration projects.",
    "lastEdited" : "Thu Aug 29, 2013 2:14 pm"
  }, {
    "postId" : "743204",
    "author" : {
      "username" : "rjy1966",
      "userId" : "743204",
      "joined" : "Sat Jul 06, 2013 8:39 pm",
      "profileRank" : "Registered user",
      "location" : "-",
      "postCount" : "41",
      "avatarPath" : null
    },
    "content" : "A bit of detail about what I want to do with the bus. Let me start by saying this bus will likely not be sold in my lifetime so I am not concerned about resale value. \n<br>- I am 6'7\" so will be looking for ways to ensure I can fit in the drivers seat and see out the window.\n<br>- The bus must have air conditioning based on where it will be living. So we will be putting in a subaru engine.\n<br>- I will want it made in to a 13 window bus with safaris.\n<br>- the exterior will be done ins mini pepper white (love markp's bus) and a really deep navy blue.\n<br>- the interior will be done in cream and navy leather.\n<br>- It will need to be converted from LHD to RHD.\n<br>- I want the exterior to appear to be a really nicely restored bus but with a few custom details (likely modify the indicator light position, custom roof rack to hold paddle boards, full chrome trim package) but other than that to be very authentic looking to the casual observer.\n<br>- I want very clean lines inside. I want a great stereo but want it hidden. I want almost nothing on the dash and will likely have all signs of the radio removed and go with bluetooth everything in the bus.\n<br>- I will likely opt for air shocks.\n<br>- I will want a great heat/sound lining for the entire bus. It will be in incredible intense heat most of the time.\n<br>- I will be looking for a very lightly tinted (as little as possible) UV protectant film for the windows.\n<br>- This one sounds odd, but they allow very little room in the parking lots in Cayman and a bus is tough to back up so I will be looking for a hidden backup camera that will be linked to an ipad mini on the back of the sun visor so it cant be seen normally but will help keep a gorgeous bus from being dinged.\n<br>- we will be going with two colour custom wheels.\n<br>\n<br>Thats the plan. I really hope that some of you on here would be willing to provide feedback and suggestions. I am open to any and all suggestions. I know it will not be what a lot of you would do with a bus but it will be a fantastic look and highly functional and I am hoping be another bus saved for the next generation of bus lovers.",
    "lastEdited" : "Thu Aug 29, 2013 2:27 pm"
  }, {
    "postId" : "743210",
    "author" : {
      "username" : "SAMBA VAN MAN",
      "userId" : "743210",
      "joined" : "Wed May 04, 2005 9:36 am",
      "profileRank" : "SSVC Member",
      "location" : "THE WESTSIDE",
      "postCount" : "2819",
      "avatarPath" : "./download/file.php%3Favatar=1370_1312644292.jpg"
    },
    "content" : "I cannot wait to see this! There wouldn't of been a 13 window option in 61! Don't mutultate it and pimp my ride style it. But at the end of the day it's your bus! Who is doing the restoration for you?",
    "lastEdited" : "Thu Aug 29, 2013 2:47 pm"
  }, {
    "postId" : "743212",
    "author" : {
      "username" : "rjy1966",
      "userId" : "743212",
      "joined" : "Sat Jul 06, 2013 8:39 pm",
      "profileRank" : "Registered user",
      "location" : "-",
      "postCount" : "41",
      "avatarPath" : null
    },
    "content" : "I guess the \"there wouldnt have been a 13 window option in 61\" is exactly one of the pieces of information I want. I would likely then really have to contemplate whether I would do 13 windows then (it would really be about the ease of seeing the sights when touring guests around) so maybe an 11 window or what were the options in '61?\n<br>\n<br>On the \"pimp my ride\" look.....ick that look is just so offensive. The objective will be to have this bus look at first glance as being totally original other than the wheels.\n<br>There will be nothing on the outside that anyone would notice as being unusual other than moving the indicators, everything else will be the same.\n<br>The interior......will be traditional looking seats just covered in cream and navy leather (possibly lowered a bit for some extra head room). Traditional bench seats in the back, just done in cream and navy leather also. The stereo, amps and speakers will not be visible. There will be nothing on the inside that will look non-traditional other than some venting somewhere for a/c in the rear of the bus.",
    "lastEdited" : "Thu Aug 29, 2013 2:59 pm"
  }, {
    "postId" : "743214",
    "author" : {
      "username" : "rjy1966",
      "userId" : "743214",
      "joined" : "Sat Jul 06, 2013 8:39 pm",
      "profileRank" : "Registered user",
      "location" : "-",
      "postCount" : "41",
      "avatarPath" : null
    },
    "content" : "The work will be done by Andrew Sharp at Sharp Customs in Nottinghamshire. He is a young guy who is super keen to get going on this project. He and I have had dozens of emails discussing the look I am after which I guess is kind of a California surf bus and as close to stock appearance as possible.\n<br>\n<br>I want people to walk past this bus and just say \"thats a really sweet vintage bus\". \n<br>\n<br>I want them to look inside the bus and say \"wow, those buses were so basic back in the day\". \n<br>\n<br>Then, I want the sound of the subaru turbo engine when it starts up. I want hidden amps and speakers that allow for great sound but not seen. Then I want the \"damn, I didnt expect that\" as the response and to then have them have to ask about where all the stuff is hidden.\n<br>\n<br>Now I need help from everyone to make sure it happens and happens very well.",
    "lastEdited" : "Thu Aug 29, 2013 3:06 pm"
  }, {
    "postId" : "743219",
    "author" : {
      "username" : "SAMBA VAN MAN",
      "userId" : "743219",
      "joined" : "Wed May 04, 2005 9:36 am",
      "profileRank" : "SSVC Member",
      "location" : "THE WESTSIDE",
      "postCount" : "2819",
      "avatarPath" : "./download/file.php%3Favatar=1370_1312644292.jpg"
    },
    "content" : "You could go 15 window! But you will need the 2 rear corner window panels and glass.",
    "lastEdited" : "Thu Aug 29, 2013 3:28 pm"
  }, {
    "postId" : "743221",
    "author" : {
      "username" : "rjy1966",
      "userId" : "743221",
      "joined" : "Sat Jul 06, 2013 8:39 pm",
      "profileRank" : "Registered user",
      "location" : "-",
      "postCount" : "41",
      "avatarPath" : null
    },
    "content" : "15 windows could be pretty cool if the view is what we are after. Hmmmmmm got some pondering to do.",
    "lastEdited" : "Thu Aug 29, 2013 3:35 pm"
  }, {
    "postId" : "743232",
    "author" : {
      "username" : "SAMBA VAN MAN",
      "userId" : "743232",
      "joined" : "Wed May 04, 2005 9:36 am",
      "profileRank" : "SSVC Member",
      "location" : "THE WESTSIDE",
      "postCount" : "2819",
      "avatarPath" : "./download/file.php%3Favatar=1370_1312644292.jpg"
    },
    "content" : "Why don't you have a look on the samba.com and see what configuration you like, either 15 or ll window.",
    "lastEdited" : "Thu Aug 29, 2013 4:38 pm"
  }, {
    "postId" : "743241",
    "author" : {
      "username" : "BlastingDiePast",
      "userId" : "743241",
      "joined" : "Sat Feb 02, 2013 7:16 pm",
      "profileRank" : "SSVC Member",
      "location" : "Bristol",
      "postCount" : "1296",
      "avatarPath" : null
    },
    "content" : "My dream bus is a 15 window, any year !",
    "lastEdited" : "Thu Aug 29, 2013 5:23 pm"
  }, {
    "postId" : "743247",
    "author" : {
      "username" : "JonnyCJ",
      "userId" : "743247",
      "joined" : "Thu Mar 14, 2013 6:50 pm",
      "profileRank" : "SSVC Member",
      "location" : "Heswall",
      "postCount" : "2001",
      "avatarPath" : null
    },
    "content" : "If you want to keep it clean but have a kick ass stereo system, get in touch with Adrian James.\n<br>\n<br>\n<!-- e -->\n<a href=\"mailto:member@radios.freeserve.co.uk\">member@radios.freeserve.co.uk</a>\n<!-- e -->\n<br>\n<br>Adrian is installing a 4 x 45w fm stereo into the housing of a Blaupunkt Frankfurt which is kaput. It has iPod in, as well as an out to link to a separate amp etc. not cheap, but you keep the period looks and controls and get modern reliable sounds.\n<br>\n<br>Your bus sounds like a nice project - keep us informed !\n<br>\n<br>Jonny",
    "lastEdited" : "Thu Aug 29, 2013 5:29 pm"
  }, {
    "postId" : "743263",
    "author" : {
      "username" : "beetleben",
      "userId" : "743263",
      "joined" : "Fri Aug 20, 2010 8:30 pm",
      "profileRank" : "Registered user",
      "location" : "Colwyn Bay",
      "postCount" : "1009",
      "avatarPath" : "http://i1331.photobucket.com/albums/w592/beetleben1/8668b2e0-d675-4baf-a0ad-0e3d3cac9ff9_zps29643102.jpg"
    },
    "content" : "very surprised you couldn't find one without as many mods as you're planning, but cant say i've searched for a 61 13 window. But i'm looking forward to seeing the build thread moving along, all the best with your plans",
    "lastEdited" : "Thu Aug 29, 2013 6:53 pm"
  }, {
    "postId" : "743334",
    "author" : {
      "username" : "beetleben",
      "userId" : "743334",
      "joined" : "Fri Aug 20, 2010 8:30 pm",
      "profileRank" : "Registered user",
      "location" : "Colwyn Bay",
      "postCount" : "1009",
      "avatarPath" : "http://i1331.photobucket.com/albums/w592/beetleben1/8668b2e0-d675-4baf-a0ad-0e3d3cac9ff9_zps29643102.jpg"
    },
    "content" : "A one minute search found\n<br>\n<!-- m -->\n<a class=\"postlink\" href=\"http://www.thesamba.com/vw/classifieds/detail.php?id=1522179\">http://www.thesamba.com/vw/classifieds/ ... id=1522179</a>\n<!-- m -->",
    "lastEdited" : "Thu Aug 29, 2013 9:55 pm"
  }, {
    "postId" : "743336",
    "author" : {
      "username" : "beetleben",
      "userId" : "743336",
      "joined" : "Fri Aug 20, 2010 8:30 pm",
      "profileRank" : "Registered user",
      "location" : "Colwyn Bay",
      "postCount" : "1009",
      "avatarPath" : "http://i1331.photobucket.com/albums/w592/beetleben1/8668b2e0-d675-4baf-a0ad-0e3d3cac9ff9_zps29643102.jpg"
    },
    "content" : "although I only found one double door which was also a panel van so if that's what your heart is set on maybe you've gone down the right road.",
    "lastEdited" : "Thu Aug 29, 2013 10:02 pm"
  }, {
    "postId" : "743349",
    "author" : {
      "username" : "blink",
      "userId" : "743349",
      "joined" : "Sat Aug 22, 2009 9:16 am",
      "profileRank" : "Registered user",
      "location" : "-",
      "postCount" : "78",
      "avatarPath" : null
    },
    "content" : "This is going to be awesome. I have seen so many buses being built to OG, crazy custom, mild street and everything in the middle.\n<br>What i have noticed is as long as you are not making it look like a monster and keep up with the factory looking pretty damn close on the outsides you will get most people loving the work that is being done to it and anyone who doesn't know a VW it be in love at first site.\n<br>\n<br>so i would say if you got a double door bus and your going to change it to keep it to what would of came out of the factory. So in 61 it would of been a panel van, 11 window, 15 window or a 23 window plus a few in the middle like a 15 with a sun roof or even an 11 with a sun roof which look awesome plus you can open it up and see everything but if you going to run Aircon then the roof would only be for looks. as there wouldnt be much point in letting all that nice air out. but then it is still looks awesome.\n<br>\n<br>Keep us all posted mate this is going to be great \n<img class=\"smilies\" src=\"./images/smilies/icon_smile.gif\" alt=\":)\" title=\"Grin\">",
    "lastEdited" : "Fri Aug 30, 2013 12:06 am"
  }, {
    "postId" : "743350",
    "author" : {
      "username" : "rjy1966",
      "userId" : "743350",
      "joined" : "Sat Jul 06, 2013 8:39 pm",
      "profileRank" : "Registered user",
      "location" : "-",
      "postCount" : "41",
      "avatarPath" : null
    },
    "content" : "Wow, I really am pleasantly surprised by all the feedback. I was afraid that people might find it offensive in some way that I won't personally be doing the work but having it done by a shop.\n<br>\n<br>I am pretty sure at this point that I will do an 11 window.\n<br>\n<br>I will get a few photos up shortly once I figure out how to do it.\n<br>\n<br>As far as options to purchase, one way or another I was going to need a number of key changes so the decision came down to which changes made the most sense to do after finding the bus versus finding a bus with the key pieces in place. So fininding walk through double door and changing to right hand drive and adding windows seemed easier than finding windows in a bus and trying to change it to walk through.",
    "lastEdited" : "Fri Aug 30, 2013 1:00 am"
  } ]
}