{
  "forumId" : "8",
  "threadId" : "79768",
  "title" : "\" Trix \" our 66 adventure....& refresh begins",
  "originalUrl" : "https://ssvc.org.uk/phpbb/viewtopic.php?f=8&t=79768",
  "breadcrumbs" : [ {
    "url" : "./viewforum.php?f=8&sid=c1e5dce56eb08b6216bb20d467af4016",
    "label" : "Rides and Projects"
  } ],
  "totalPosts" : 582,
  "pageNumber" : 1,
  "totalPages" : 39,
  "posts" : [ {
    "postId" : "614030",
    "author" : {
      "username" : "Bren Ralls",
      "userId" : "614030",
      "joined" : "Mon Sep 12, 2011 6:16 am",
      "profileRank" : "SSVC Member",
      "location" : "Deal, Kent.",
      "postCount" : "1143",
      "avatarPath" : "http://i262.photobucket.com/albums/ii119/brenralls/Picturesams658.jpg"
    },
    "content" : "Totally new to the VW splitty scene, had for many years admired them but never the finances to full fill that dream or own one. After turning 40 this year the realisation of life wizzing by kids growing up &amp; possibly a reality check of where life was taking me. A bit of inheritance gave us this opertunity &amp; our adventure begun. \n<br>After many months of searching &amp; researching realised my limits of what I could achieve &amp; to what condition of bus I needed to search for my 1st bus. For me a bus stuck in a garage for years would never hit the road so opted for one that’s a working bus that just needed tinkering.\n<br>In early September 11 had an option of two, sod’s law though one in Cornwall the other Lancashire &amp; a tough decision as both fitted the bill. After a good chat with a local owner &amp; a drive of a 67 at home had the information required to make that life changing decision but more importantly found my virgin VW smile &amp; was hooked.\n<br>The decision was drive North as this had more of the goodies i wanted &amp; a more complete bus, full of excitement but dread of the drive home &amp; would she make it under her own steam or on a tow truck. Couldn’t do any more for peace of mind with HPI checks done, paperwork in order a good poke &amp; prod around by Pete my father in law mechanic who really knows his stuff . The nod from him &amp; money exchanged so myself &amp; wife Sandra were now the proud owners of Trixie the 11 window combi with our journey now beginning in the world of splitty. \n<br>The journey home started at 11am with 340 miles to travel &amp; be at work for a night shift at 6pm tall order I guess &amp; a little optimistic. Chucking down with rain &amp; posts came true safaris leak like a sieve, &amp; the wipers are there only to look good as the wind just kept them off the glass but the smile was strong. The previous owner said not to thrash her as she loses a little oil so started with steady , difficult to judge as speedo did not work but lorries where a good gauge &amp; assumed 60mph. \n<br>An hour into the journey things started to smell hot but not sure what smells to expect, the smell of oil was not good &amp; the frantic call from Sandra following behind with Pete in the car get off at the next junction made me ease back. Slowing to 50 smells &amp; smoke went so found the not thrashing speed where she just plodded along with ease. A quick stop to check at the services &amp; all looked fine other than oil everywhere showed a leak rather than a terminal problem. A blanket for the driver as I was frozen was back on the road pretty soon. Now this was a life changing experience as had never been in this lane of a motorway, felt like life was in slow motion &amp; everything else was in warp speed whizzing by, Ha normally I’m in that outside lane wow what a difference. This still makes me smile as the wind was pushing me all over the road &amp; howling through every nook &amp; cranny. Only to find out there was not a breath of wind outside so a combination of inside lane lorry tire grooves &amp; splitty steering slop gave that gale wind feeling. Had a wee treat as an immaculate red n white splitty chugged past me mid journey which looked the nuts. Cool respect if only I could prize my hands from the wheel but the gail was to fierce for the virgin driver. The journey went without real issue from here other than an oil top up for precaution &amp; was home for 730pm so not so bad with a quick turn round in the car &amp; to work for a night shift eeeeek.\n<br>The Next morning started to clear the engine bay of oil from what was a pristine looking before the journey, to oil which was now dripping from everywhere &amp; everything. A few hours later &amp; able to start hunting the leak which didn’t take long to find the cause &amp; a cracked dynamo stand was soon removed to reveal two parts which should be one. How she made it home i will never know.\n<br>\n<img src=\"http://i262.photobucket.com/albums/ii119/brenralls/Picturesams764.jpg\" class=\"postimage\" alt=\"Image\">\n<br>Since here been gradually repairing &amp; replacing bits to hopefully get a reliable safe bus. So steering is tighter, gears now work without that random guess work or embarrassing moment at a junction where you can’t find anything that resembles forward. Front brakes replaced but still need to get rears off as trying to source a socket but finally bit the bullet &amp; bought one. Oil leaks well the major ones sorted but not sure if all, still know the engine will have to come out at some point.\n<br>Chassis wise seems structurally good &amp; reasonably rust free but will be that labour of love.. Body work wise looks clean &amp; tidy where it has been re sprayed all over but has points where work will be required, but for the moment looks a tidy bus. We have the birth certificate where she was built &amp; shipped in March 66 but no real details as she spent her life in California till 2008 &amp; only the details from when she entered the UK.\n<br>\n<br>Plans to over time will be interior &amp; exterior refurb but what we have is usable &amp; tidy. The rear is basic with only a full width rock n roll bed &amp; nothing else so lots of room for scope. Plan to drop her a little on lowered front spindles &amp; rear splines. May keep rear stock on reduction boxes not sure yet, over time will tell or will go to IRS as not to keen how the rear seems to lift in a turn. Engine seems strong &amp; is a 1600 or so I’m led to believe, the delorto carb &amp; combo gives a good turn of power &amp; all I really want from her well at the moment..\n<br>Time at the moment is spent rebuilding the drive &amp; a garage for trixie so a long term gain but pain full as just want to tinker and sort the niggly things &amp; just play before winter sets in. Damb shame as the weather in the south has been awesome as late..\n<br>\n<br>As you all like pictures heres a few.\n<br>\n<img src=\"http://i262.photobucket.com/albums/ii119/brenralls/Picturesams759.jpg\" class=\"postimage\" alt=\"Image\">\n<br>\n<img src=\"http://i262.photobucket.com/albums/ii119/brenralls/Picturesams762.jpg\" class=\"postimage\" alt=\"Image\">\n<br>\n<img src=\"http://i262.photobucket.com/albums/ii119/brenralls/Picturesams763.jpg\" class=\"postimage\" alt=\"Image\">\n<br>\n<img src=\"http://i262.photobucket.com/albums/ii119/brenralls/Picturesams761.jpg\" class=\"postimage\" alt=\"Image\">",
    "lastEdited" : "Tue Oct 11, 2011 3:52 pm"
  }, {
    "postId" : "614038",
    "author" : {
      "username" : "WILL",
      "userId" : "614038",
      "joined" : "Tue Jun 14, 2005 8:20 pm",
      "profileRank" : "SSVC Member",
      "location" : "NEWCASTLE-UNDER-LYME",
      "postCount" : "4635",
      "avatarPath" : "./download/file.php%3Favatar=1465_1359975040.jpg"
    },
    "content" : "<img class=\"smilies\" src=\"./images/smilies/icon_cool.gif\" alt=\"8)\" title=\"Cool\"> Nice looking van, welcome to the forum \n<img class=\"smilies\" src=\"./images/smilies/icon_cheers.gif\" alt=\":cheers:\" title=\"cheers\">",
    "lastEdited" : "Tue Oct 11, 2011 4:22 pm"
  }, {
    "postId" : "614109",
    "author" : {
      "username" : "TJW964",
      "userId" : "614109",
      "joined" : "Tue Nov 27, 2007 9:59 pm",
      "profileRank" : "SSVC Member",
      "location" : "Near Ludlow",
      "postCount" : "1373",
      "avatarPath" : "./download/file.php%3Favatar=12800_1314382902.jpg"
    },
    "content" : "Welcome. Nice looking bus and interesting story, so far!",
    "lastEdited" : "Tue Oct 11, 2011 7:29 pm"
  }, {
    "postId" : "614136",
    "author" : {
      "username" : "HUGO bOSS",
      "userId" : "614136",
      "joined" : "Tue Apr 19, 2011 10:19 pm",
      "profileRank" : "Registered user",
      "location" : "-",
      "postCount" : "596",
      "avatarPath" : "http://i919.photobucket.com/albums/ad33/HUGOBOSS_06/Split%20Andrade/2_zps14f5dd25.gif"
    },
    "content" : "Welcome aboard!\n<br>\n<br>Nice to hear that another Split is in good hands...",
    "lastEdited" : "Tue Oct 11, 2011 8:19 pm"
  }, {
    "postId" : "614297",
    "author" : {
      "username" : "Bren Ralls",
      "userId" : "614297",
      "joined" : "Mon Sep 12, 2011 6:16 am",
      "profileRank" : "SSVC Member",
      "location" : "Deal, Kent.",
      "postCount" : "1143",
      "avatarPath" : "http://i262.photobucket.com/albums/ii119/brenralls/Picturesams658.jpg"
    },
    "content" : "Cheers all, so full of enthusiasm and with the whole family feeling the love she will be well looked after. Weird how any work seems should just be a five minute job but just turns into weeks, find a problem sort or order parts fix only for the next thing to arise.",
    "lastEdited" : "Wed Oct 12, 2011 7:11 pm"
  }, {
    "postId" : "617621",
    "author" : {
      "username" : "Bren Ralls",
      "userId" : "617621",
      "joined" : "Mon Sep 12, 2011 6:16 am",
      "profileRank" : "SSVC Member",
      "location" : "Deal, Kent.",
      "postCount" : "1143",
      "avatarPath" : "http://i262.photobucket.com/albums/ii119/brenralls/Picturesams658.jpg"
    },
    "content" : "Been a few weeks but but safety things done, brakes all replaced and the pull straight feel when you slam on the ankers such a nice feel. Rear drum nut wow that's tight but no match for a 7 ft tube &amp; my fuller figure. Gears slot in place lovely and a pleasure now to drive. Tappets adjusted with only now points and leads and engine there. \n<br>Drive done and garage half done so not far from a dry home for trixie \n<img class=\"smilies\" src=\"./images/smilies/icon_smile.gif\" alt=\":)\" title=\"Grin\">\n<br>\n<br>After a crap week at work was dry so went for a drive just needed to chill. Grrrrrr broke new wing mirror on garage reversing out and burst the oil cooler pipe I had replaced a week or so back. School boy error read the label as fuel pipe does not work so now engine bay is dripping again. Not terminal just very oily gutted though as only had drive shaft gators to replace and was virtually oil leak free.",
    "lastEdited" : "Sun Oct 30, 2011 9:57 am"
  }, {
    "postId" : "617648",
    "author" : {
      "username" : "thestoneroses",
      "userId" : "617648",
      "joined" : "Tue Apr 26, 2005 7:19 am",
      "profileRank" : "SSVC Member",
      "location" : "York, North Yorkshire",
      "postCount" : "100",
      "avatarPath" : "./download/file.php%3Favatar=1357_1250946792.jpg"
    },
    "content" : "a great read ! \n<br>\n<br>It brings back memories of my first drive in a splittie, when I picked my 66 and drove her home from Newport to London. I don't mind admitting that drive down the M4 scared me sh*tless. And the lowered \"cut &amp; twist\" front beam that shook loose another filling with every pothole. The very next day, full of new-owner-naivety, I reversed her out the garage, moved into 1st in anticipation of proudly pulling away....and the gear stick, in its entirety, came away in my hand, in full view of family &amp; neighbours. Talk about feeling stupid, sitting there in my newly acquired P n' J, holding a, er, free-floating gear stick for all to see ! Easily remedied however. \n<br>\n<br>Other than the inevitable breakdowns and AA rescues, my most embarrassing experience was (fortunatley) at home. Having spent best part of a day trying to get my indicators to work - you know, like flashing independently and relative to the direction of the indicator stalk, rather then all on together like permanent hazards - I threw in the towel and called an auto-electiciian. He gladly took the £45 callout fee, then smugly advised \"it's negative earth\", switched he battery connections over and voilà \n<img class=\"smilies\" src=\"./images/smilies/icon_redface.gif\" alt=\":oops:\" title=\"Red Face\"> \n<img class=\"smilies\" src=\"./images/smilies/icon_redface.gif\" alt=\":oops:\" title=\"Red Face\"> \n<img class=\"smilies\" src=\"./images/smilies/icon_redface.gif\" alt=\":oops:\" title=\"Red Face\"> . I can't recall why I'd disconnected he battery in the first place, but boy, did I feel stupid ! You live and learn with these vans, more so if you start out like me with no mechanical experience. \n<br>\n<br>But personally speaking, it's the learning which I've found the most rewarding aspect of owning my van. Getting my hands dirty at the weekend is a great contrast to the day job, and I'm now generally competent mechanic, and have even learnt to weld and repair rot. As my skills get better year by year, I'm confident that I'll be able to do a full-on resto at some point. Seeing what others have achieved from a similar position on this site is a great motivation. \n<br>\n<br>And the information, support and general friendliness in the SSVC and these forums can't be praised enough.\n<br>\n<br>Enjoy !\n<br>\n<br>cheers,\n<br>Gareth.",
    "lastEdited" : "Sun Oct 30, 2011 2:33 pm"
  }, {
    "postId" : "618069",
    "author" : {
      "username" : "Split-Lee",
      "userId" : "618069",
      "joined" : "Fri Jun 20, 2008 3:34 pm",
      "profileRank" : "SSVC Member",
      "location" : "Margate, Kent",
      "postCount" : "1524",
      "avatarPath" : "http://i120.photobucket.com/albums/o162/Lee_be_here/Thanet%20Classics/230862_110751725679696_100002346088804_111459_4394975_n.jpg"
    },
    "content" : "Welcome to the site! Looking forward to seeing this about! I am only down the road in Margate! \n<img class=\"smilies\" src=\"./images/smilies/icon_smile.gif\" alt=\":)\" title=\"Grin\">\n<br>\n<br>I am sure we will meet up soon,\n<br>\n<br>~Lee",
    "lastEdited" : "Tue Nov 01, 2011 11:04 am"
  }, {
    "postId" : "618113",
    "author" : {
      "username" : "Bugzy Malone",
      "userId" : "618113",
      "joined" : "Sun Sep 18, 2011 3:04 pm",
      "profileRank" : "SSVC Member",
      "location" : "Banbury",
      "postCount" : "374",
      "avatarPath" : "./download/file.php%3Favatar=35874_1316382490.jpg"
    },
    "content" : "hehe, i know about oil leaks, i think we all do.\n<br>\n<br>Love the brick hand brakes, you not to sure about the factory fitted one then \n<img class=\"smilies\" src=\"./images/smilies/icon_smile.gif\" alt=\":)\" title=\"Grin\">\n<br>\n<br>Welcome. you are a step ahead of me, my van is still on it's way over from Alaska and will need some work to get it going!",
    "lastEdited" : "Tue Nov 01, 2011 3:53 pm"
  }, {
    "postId" : "618259",
    "author" : {
      "username" : "Mike1973",
      "userId" : "618259",
      "joined" : "Wed Nov 03, 2004 1:21 pm",
      "profileRank" : "SSVC Member",
      "location" : "Stock Police Station",
      "postCount" : "4438",
      "avatarPath" : "http://img.photobucket.com/albums/v683/silly-password/62750a15-b24c-4ae9-9bd8-94e84a0746e7_zps8c3985d1.jpg"
    },
    "content" : "What a lovely van! \n<br>\n<br>I hope you don't mind, I'd love to pinch your story for our SSVC mag \n<img class=\"smilies\" src=\"./images/smilies/icon_wink.gif\" alt=\":wink:\" title=\"Wink\">",
    "lastEdited" : "Tue Nov 01, 2011 10:51 pm"
  }, {
    "postId" : "618277",
    "author" : {
      "username" : "Bren Ralls",
      "userId" : "618277",
      "joined" : "Mon Sep 12, 2011 6:16 am",
      "profileRank" : "SSVC Member",
      "location" : "Deal, Kent.",
      "postCount" : "1143",
      "avatarPath" : "http://i262.photobucket.com/albums/ii119/brenralls/Picturesams658.jpg"
    },
    "content" : "Gareth thanks and agree its the learning that gives just as much pleasure, I have the fitting skills as for many years including my apprentiship was an aircraft fitter before a career change to the fire brigade. Vehicles on the other hand never touched as my cars have for many years been new so is a totally new learning curve.\n<br>\n<br>\n<br>Hi Lee plan for your xmas cruise so will be great to catch up.\n<br>\n<br>\n<br>Bugsy Malone now your adventure so far has been a fantastic read &amp; a true reward to you when she is in the uk. Bricks Ha! living on a hill a good brake when the rear is off the ground but had only been since as the vehicle had been jacked up n down so many times they ended up a feature. I took the photo as you can see on a nice sunny day then got reminded after posting it by the boss what about the bricks \n<img class=\"smilies\" src=\"./images/smilies/icon_redface.gif\" alt=\":oops:\" title=\"Red Face\"> \n<br>\n<br>\n<br>Mike1973 feel free to use the story, I guess its a story we have all been through at some point but for me its all totally new.\n<br>\n<br>\n<br>Last night fitted another oil pipe being assured this would be fine, codes are different so will see &amp; fingers crossed. Drive shaft gators now done some may say whats the big deal but when you have never done it a mile stone. started to fill gearbox now with oil but need another bottle , eeeekk dont think there was any in there or very little so hope no long term damage. After another seriously good oil clean of engine ran her up for a good half hour with all seeming good, seems possibly a weep from the front oil seal but this could just be oil trapped that i could not get to but will see over time now. Road trip now but will have to wait as a 3 day 1st aid refresher awaits.",
    "lastEdited" : "Wed Nov 02, 2011 7:03 am"
  }, {
    "postId" : "628336",
    "author" : {
      "username" : "Bren Ralls",
      "userId" : "628336",
      "joined" : "Mon Sep 12, 2011 6:16 am",
      "profileRank" : "SSVC Member",
      "location" : "Deal, Kent.",
      "postCount" : "1143",
      "avatarPath" : "http://i262.photobucket.com/albums/ii119/brenralls/Picturesams658.jpg"
    },
    "content" : "Its been a while since any updates but plenty has been going on. Garage is finished baring doors so Trixie is now dry &amp; out of the elements, turned out well with more room than exspected so plenty of room for any resto work thats planned later on in 2012.\n<br>\n<br>Got fed up of chasing leaks with the after market oil cooler that came fitted. Was made of ali but so thin sure it exspanded when the engine reved.\n<br>\n<img src=\"http://i262.photobucket.com/albums/ii119/brenralls/Picture299.jpg\" class=\"postimage\" alt=\"Image\"> \n<br>\n<br>Replaced it with this empi version, works for me as no leaks &amp; is robust so hopefully now problem free &amp; solid in the bus out of harms way.\n<br>\n<img src=\"http://i262.photobucket.com/albums/ii119/brenralls/Picture298.jpg\" class=\"postimage\" alt=\"Image\">\n<br>\n<br>Joined up with Thanet classics just before xmas for there annual cruise, Ha my first &amp; did enjoy leading the splitty section.\n<br>All polished up\n<br>\n<img src=\"http://i262.photobucket.com/albums/ii119/brenralls/Picture290.jpg\" class=\"postimage\" alt=\"Image\">\n<br>\n<img src=\"http://i262.photobucket.com/albums/ii119/brenralls/Picture289.jpg\" class=\"postimage\" alt=\"Image\">\n<br>\n<br>And now decorated\n<br>\n<br>\n<img src=\"http://i262.photobucket.com/albums/ii119/brenralls/BlueSplitty.jpg\" class=\"postimage\" alt=\"Image\">\n<br>\n<img src=\"http://i262.photobucket.com/albums/ii119/brenralls/Splitty-1.jpg\" class=\"postimage\" alt=\"Image\">\n<br>\n<img src=\"http://i262.photobucket.com/albums/ii119/brenralls/BlueSplitty-1.jpg\" class=\"postimage\" alt=\"Image\">\n<br>\n<img src=\"http://i262.photobucket.com/albums/ii119/brenralls/BlueCamper2.jpg\" class=\"postimage\" alt=\"Image\">\n<br>\n<img src=\"http://i262.photobucket.com/albums/ii119/brenralls/Thanetclassics11051.jpg\" class=\"postimage\" alt=\"Image\">\n<br>Yes that is a crocodile &amp; pirate in the back ground.\n<br>Since then had a good session in the engine bay Tinkering is all I guess one can say , Dellorto carb stripped &amp; cleaned out. All needles removed &amp; airlind out as it looks as if at some point has been full of water. New manual helped for tollerances but still has not cured dead spot fully in rev range. Guess i will find the cause eventually as gradually getting through all the check list.\n<br>\n<br>Finally sorted why speedo did not work &amp; seems was just a case of mile number dials being siezed which caused this little worm gear to shear brass teeth off grr.\n<br>\n<img src=\"http://i262.photobucket.com/albums/ii119/brenralls/Picture296.jpg\" class=\"postimage\" alt=\"Image\">\n<br>\n<br>Speedo all back in now, spent a bit of time on a disussed road calibrating to my satnav which is tru to both my audi &amp; van so is close enough for the bus. All by the miles not counting until i track down the brass gear.\n<br>\n<br>Heating now this is the next project to get the stock items up n working. Guess I was the lucky one as the cables threaded through real easy down the tubes, heard &amp; read some real horror stories so was a big sigh of relief when the two collars poked through the ends of the small pipes. Previous owners removed everything from the heat exchangers going forward to pretty much where it goes through the floor at the front. Used a UK link i was given for these parts but now after over two months of waiting &amp; still no parts only excuses will opt for foriegn link as it shows all parts bar one in stock. Plus other bits I was told do no longer exist so do not have to look down making it myself route.\n<br>\n<br>Feel Im getting paranoid though as evytime I turn around see another rust bubble or rust mark showing through so will soon be at the taking paint off stage to treat or exspose the horrors behind \n<img class=\"smilies\" src=\"./images/smilies/icon_cry.gif\" alt=\":cry:\" title=\"Cry\">",
    "lastEdited" : "Mon Jan 02, 2012 4:34 pm"
  }, {
    "postId" : "630773",
    "author" : {
      "username" : "markp",
      "userId" : "630773",
      "joined" : "Wed Jul 20, 2011 9:56 pm",
      "profileRank" : "SSVC Member",
      "location" : "northampton",
      "postCount" : "4688",
      "avatarPath" : "./download/file.php%3Favatar=35667_1311369872.jpg"
    },
    "content" : "Hi \n<br>\n<br>Thought I'd have a look at your thread as you so kindly commented on mine \n<img class=\"smilies\" src=\"./images/smilies/icon_wink.gif\" alt=\":wink:\" title=\"Wink\"> \n<br>\n<br>WOW love your Bus it looks great to me dude and welcome to the club \n<img class=\"smilies\" src=\"./images/smilies/icon_cheers.gif\" alt=\":cheers:\" title=\"cheers\"> I'm also a VW virgin ..... But as you see in my thread I've not had the pleasure of driving one yet \n<img class=\"smilies\" src=\"./images/smilies/icon_redface.gif\" alt=\":oops:\" title=\"Red Face\"> But one day I will \n<img class=\"smilies\" src=\"./images/smilies/icon_cheers.gif\" alt=\":cheers:\" title=\"cheers\"> \n<br>\n<br>Great story and love the way you made me feel like I was there with you on the first trip bringing her home \n<img class=\"smilies\" src=\"./images/smilies/icon_smile.gif\" alt=\":)\" title=\"Grin\"> \n<br>\n<br>read lots\n<br>post lots\n<br>\n<br>and make sure you always do updates with a few pic's here and there as we all love to see the pic's and I find it's a great way of keeping focused as you can always go back into your thread and remember where you came from ....... ( That's my secret anyway SSSSSS \n<img class=\"smilies\" src=\"./images/smilies/icon_cool.gif\" alt=\"8)\" title=\"Cool\"> )\n<br>\n<br>Mark",
    "lastEdited" : "Sun Jan 15, 2012 8:33 am"
  }, {
    "postId" : "630868",
    "author" : {
      "username" : "Bren Ralls",
      "userId" : "630868",
      "joined" : "Mon Sep 12, 2011 6:16 am",
      "profileRank" : "SSVC Member",
      "location" : "Deal, Kent.",
      "postCount" : "1143",
      "avatarPath" : "http://i262.photobucket.com/albums/ii119/brenralls/Picturesams658.jpg"
    },
    "content" : "Thanks Mark had the choice of a complete resto or one which was usable &amp; just needed tinkering. You saw which route I chose as my skill level &amp; time availablity does not exceed to the work your doing. Being a wholetime fireman &amp; running a building buisness on my days off employing a few people clocks up some hours each week let alone family life &amp; my toys. My wife sandra does the books to help out but due to illness is about all she can manage + the house wife bit. so you can see for me time is a wiz &amp; the bus is a getaway for us all so roll on summer.. But hey a few updates \n<img class=\"smilies\" src=\"./images/smilies/icon_smile.gif\" alt=\":)\" title=\"Grin\"> \n<br>\n<br>With all this great weather &amp; dry roads run the bus into work a few times &amp; some shopping trips to keep the boss happy. The covered wash at the fire station the other saturday night was a great oppertunity to see how good the tent was that came with trixie when I bought her. Alas more rips n tears than are worth repairing so its only use has been for sound proofing under the rear seat. The shopping trip the following day was going great till half way home from canterbury flying along as only a bus can do, OK 65 mph. A not so lovely tink came from the engine followed by an awfull grinding &amp; belt squeel. Pulled over but not much could be done other than to limp the final 2 miles home slowly.\n<br>\n<br>Pulling off the fan belt revealed the dynamo was lose in the tin wear so pulled this apart to reveal most of the plates had been eaten through by the fan &amp; the engine had to come out for ease of working.\n<br>\n<br>\n<img src=\"http://i262.photobucket.com/albums/ii119/brenralls/Picture304.jpg\" class=\"postimage\" alt=\"Image\">\n<br>Dont you love stock height well i do as im not very small ie ex rugby prob for the brigade but still squeezed under but it did rise n fall as I breathed. Engine came out in an hour with the father inlaw which enabled us to to check a few things that where due later on in the year. THe great service of Machine 7 had the stuff at my door the next day so clutch, main oil seals &amp; thrust washer done plus countless little things.\n<br>\n<br>Had planned to overhaul origanl heat exchangers but these as now out of the bus easier to see they where a right of &amp; the metal way to thin to even think of repairing so new ones fitted, just hope the repo ones are not to bad for giving heat.\n<br>\n<br>\n<img src=\"http://i262.photobucket.com/albums/ii119/brenralls/Picture302.jpg\" class=\"postimage\" alt=\"Image\">\n<br>A jolly good clean, tin wear now all secure &amp; peace of mind its all solid &amp; good for many more miles well lets hope anyhow. Before refitting the engine bay had a good clean as it was full of sand &amp; piles of the stuff. an hour later of airlines hoover &amp; rags all clean..\n<br>\n<img src=\"http://i262.photobucket.com/albums/ii119/brenralls/Picture300.jpg\" class=\"postimage\" alt=\"Image\">\n<br>\n<img src=\"http://i262.photobucket.com/albums/ii119/brenralls/Picture307.jpg\" class=\"postimage\" alt=\"Image\">\n<br>\n<img src=\"http://i262.photobucket.com/albums/ii119/brenralls/Picture308.jpg\" class=\"postimage\" alt=\"Image\">\n<br>Engine now in the bus &amp; looks no different other than the cad plated oil filler as the original one just fell apart. You know when somthing breaks n you blame the kids well one of you did it, the beloveds look at you and say wasnt me dad well this was it but hey only i was driving but honest i didnt touch it.\n<br>\n<img src=\"http://i262.photobucket.com/albums/ii119/brenralls/Picture309.jpg\" class=\"postimage\" alt=\"Image\">\n<br>\n<br>\n<br>A little drive today &amp; all working swell other than the carb stutter that seems to alood us but getting closer to finding the problem. All tucked up again in her little home, I will get around to the door one day.\n<br>\n<img src=\"http://i262.photobucket.com/albums/ii119/brenralls/Picture310.jpg\" class=\"postimage\" alt=\"Image\">\n<br>\n<br>All the front to rear heat pipes should arrive this week from Holland so almost there for heating yahoooooooo",
    "lastEdited" : "Sun Jan 15, 2012 4:48 pm"
  }, {
    "postId" : "630879",
    "author" : {
      "username" : "Split-Lee",
      "userId" : "630879",
      "joined" : "Fri Jun 20, 2008 3:34 pm",
      "profileRank" : "SSVC Member",
      "location" : "Margate, Kent",
      "postCount" : "1524",
      "avatarPath" : "http://i120.photobucket.com/albums/o162/Lee_be_here/Thanet%20Classics/230862_110751725679696_100002346088804_111459_4394975_n.jpg"
    },
    "content" : "Looking good mate! Glad to see you are still using it! \n<img class=\"smilies\" src=\"./images/smilies/icon_smile.gif\" alt=\":)\" title=\"Grin\">\n<br>\n<br>~Lee",
    "lastEdited" : "Sun Jan 15, 2012 5:21 pm"
  } ]
}