{
  "forumId" : "9",
  "threadId" : "104219",
  "title" : "French sites - Brittany",
  "originalUrl" : "https://ssvc.org.uk/phpbb/viewtopic.php?f=9&t=104219",
  "breadcrumbs" : [ ],
  "totalPosts" : 1,
  "pageNumber" : 1,
  "totalPages" : 1,
  "posts" : [ {
    "postId" : "792469",
    "author" : {
      "username" : "michaelcheshire",
      "userId" : "792469",
      "joined" : "Sun Mar 14, 2010 7:20 pm",
      "profileRank" : "SSVC Member",
      "location" : "-",
      "postCount" : "8",
      "avatarPath" : null
    },
    "content" : "<span style=\"text-decoration: underline\">Brittany</span>\n<br>\n<br>Huelgoat - La Riviere D'Argent (\n<!-- w -->\n<a class=\"postlink\" href=\"http://www.larivieredargent.com\">www.larivieredargent.com</a>\n<!-- w -->)\n<br>A lovely wooded site, we camped next to a tumbling trout stream, feels small and intimate even though it's actually a fair size, small site shop, pool, electric hook up, decent showers and loos, recommended if you like a quiet site, not the cheapest though.\n<br>\n<br>Locronan - Camping Locronan (\n<!-- w -->\n<a class=\"postlink\" href=\"http://www.camping-locronan.fr\">www.camping-locronan.fr</a>\n<!-- w -->)\n<br>Great location, within walking distance of Locronan, one of the best preserved villages in France. Excellent heated indoor pool. Again, this site manages to feel much smaller and more intimate than it's actual size. The pitches are terraced on the hillside so lovely views from your pitch.\n<br>\n<br>Carnac - Camping de Kergo (\n<!-- w -->\n<a class=\"postlink\" href=\"http://www.campingkergo.com\">www.campingkergo.com</a>\n<!-- w -->)\n<br>Located in woodland a couple of miles from Carnac, the site has a nice intimate feel to it, decent toilets and showers, quiet and cheap as well, no pool though. Just a word about Carnac itself; it's obviously famous for the standing stones, but these are managed (unless you visit in the winter) in much the same way as Stone Henge, so if you're hoping to get up close and personal in the way you can at the Merry Maidens for instance then you could be disappointed, although you can't fail to be impressed by the sheer numbers of stones.",
    "lastEdited" : "Sun Jul 06, 2014 5:01 pm"
  } ]
}