{
  "forumId" : "9",
  "threadId" : "78303",
  "title" : "Roadtrip to Italy - Recommendations sought",
  "originalUrl" : "https://ssvc.org.uk/phpbb/viewtopic.php?f=9&t=78303",
  "breadcrumbs" : [ ],
  "totalPosts" : 9,
  "pageNumber" : 1,
  "totalPages" : 1,
  "posts" : [ {
    "postId" : "602983",
    "author" : {
      "username" : "jmcc",
      "userId" : "Unknown",
      "joined" : "-",
      "profileRank" : "-",
      "location" : "-",
      "postCount" : "-",
      "avatarPath" : null
    },
    "content" : "Hi all,\n<br>\n<br>Following 2 previous roadtrips down through France and into Spain, this year we are going to mix it up and head towards Italy (bus reliability permitting!). Looking for campsite recommendations in the following general areas:\n<br>\n<br>Reims\n<br>Basel\n<br>Lake Como/Maggiore\n<br>Turin\n<br>Cinque Terre\n<br>Cannes\n<br>Grenoble\n<br>\n<br>If anyone has camped in any of these areas and has advice it would be greatly appreciated, and also if anyone is up to speed on wild camping in Italy that too would be good (have used Camping Car areas in France before and found them to be good when in a bind - is there anything similar in Italy?)\n<br>\n<br>Thanks,\n<br>\n<br>James",
    "lastEdited" : "Wed Aug 17, 2011 8:42 pm"
  }, {
    "postId" : "603026",
    "author" : {
      "username" : "westwopa",
      "userId" : "Unknown",
      "joined" : "-",
      "profileRank" : "-",
      "location" : "-",
      "postCount" : "-",
      "avatarPath" : null
    },
    "content" : "James,\n<br>\n<br>Can't comment much on the camping side of things but Lake Como is stunning, Torino very industrial, but if you like Egyptian artifacts it has the second largest collection in the world at the museum there. Wine is also very good from that region.\n<br>Other than that, Autostada, ( motorways) are on the expensive side, camping I believe they charge per person, and don't leave anything visible of value in the bus.\n<br>Cars flashing their lights means get the fcuk out of my way!!\n<br>\n<br>Enjoy the trip,\n<br>Paul",
    "lastEdited" : "Wed Aug 17, 2011 10:26 pm"
  }, {
    "postId" : "603030",
    "author" : {
      "username" : "jmcc",
      "userId" : "Unknown",
      "joined" : "-",
      "profileRank" : "-",
      "location" : "-",
      "postCount" : "-",
      "avatarPath" : null
    },
    "content" : "<img src=\"./images/smilies/icon_biggrin.gif\" alt=\":D\" title=\"Big Grin\"> \n<br>\n<br>Thanks Paul,\n<br>\n<br>Have been to Como briefly on a banger rally (overnight stop in Menaggio) and loved it, hence returning. I have also been to Turin on business and liked it as a town - hadn't realised the Egyptian interest there!\n<br>\n<br>Thanks for the tips - am used to bimbling out of people's way in Spain \n<img src=\"./images/smilies/icon_rolleyes.gif\" alt=\":roll:\" title=\"Roll Eyes\"> so hopefully the Italians won't be too much worse! \n<img src=\"./images/smilies/icon_sad.gif\" alt=\":(\" title=\"Sad\"> Not had troubles with thieving but will bear that in mind and minimise valuables that we take.\n<br>\n<br>Cheers,\n<br>\n<br>James",
    "lastEdited" : "Wed Aug 17, 2011 10:56 pm"
  }, {
    "postId" : "603031",
    "author" : {
      "username" : "westwopa",
      "userId" : "Unknown",
      "joined" : "-",
      "profileRank" : "-",
      "location" : "-",
      "postCount" : "-",
      "avatarPath" : null
    },
    "content" : "James,\n<br>\n<br>Link for the Egyptian museum below, one other thing, it's holiday time at the moment in Italy, you will find a lot of places closed for a couple of weeks!\n<br>\n<br>\n<!-- m -->\n<a class=\"postlink\" href=\"http://www.museoegizio.it/pages/hp_en.jsp\">http://www.museoegizio.it/pages/hp_en.jsp</a>\n<!-- m -->",
    "lastEdited" : "Wed Aug 17, 2011 11:06 pm"
  }, {
    "postId" : "603032",
    "author" : {
      "username" : "westwopa",
      "userId" : "Unknown",
      "joined" : "-",
      "profileRank" : "-",
      "location" : "-",
      "postCount" : "-",
      "avatarPath" : null
    },
    "content" : "One other thing if you're here then.........\n<br>\n<br>\n<!-- m -->\n<a class=\"postlink\" href=\"http://www.hillsrace.it/EN/index_en.htm\">http://www.hillsrace.it/EN/index_en.htm</a>\n<!-- m -->",
    "lastEdited" : "Wed Aug 17, 2011 11:16 pm"
  }, {
    "postId" : "603415",
    "author" : {
      "username" : "torpointboy",
      "userId" : "Unknown",
      "joined" : "-",
      "profileRank" : "-",
      "location" : "-",
      "postCount" : "-",
      "avatarPath" : null
    },
    "content" : "I lived in Italy until last month what do you want to know ?",
    "lastEdited" : "Fri Aug 19, 2011 10:14 pm"
  }, {
    "postId" : "603426",
    "author" : {
      "username" : "jmcc",
      "userId" : "Unknown",
      "joined" : "-",
      "profileRank" : "-",
      "location" : "-",
      "postCount" : "-",
      "avatarPath" : null
    },
    "content" : "T minus 45 minutes...\n<br>\n<br>Would like to know of any decent campsites in the north west of the country, and also if there are rules/laws about parking up and sleeping in your van? In France it's fine, and they have specific 'camping car' areas in some towns for this purpose, in Spain it's not legal but you can get away with it. Don't know about Italy!\n<br>\n<br>Thanks,\n<br>\n<br>James",
    "lastEdited" : "Sat Aug 20, 2011 5:45 am"
  }, {
    "postId" : "603432",
    "author" : {
      "username" : "caroline craggs",
      "userId" : "Unknown",
      "joined" : "-",
      "profileRank" : "-",
      "location" : "-",
      "postCount" : "-",
      "avatarPath" : null
    },
    "content" : "Hi,\n<br>\n<br>I've camped at Lake Maggiore (it was quite a few years ago - 2004) and stayed at Camping Riviera at Cannobio \n<br>\n<a href=\"http://www.riviera-valleromantica.com/default.htm\" onclick=\"window.open(this.href);return false;\" class=\"postlink\">http://www.riviera-valleromantica.com/default.htm</a>\n<br>\n<br>It was a lovely spot as we got a pitch right on the lake edge amongst the trees so it was nice and sheltered. I think there were restaurants on site but it was very near to the town if you wanted a wander and meet the locals.\n<br>\n<br>Stayed at Fiesole near Florence and Avignon which are a bit off your route both with really good sites if you did a detour:\n<br>\n<br>\n<a href=\"http://www.camping-avignon.com/home_fr.html\" onclick=\"window.open(this.href);return false;\" class=\"postlink\">http://www.camping-avignon.com/home_fr.html</a>\n<br>\n<br>\n<a href=\"http://www.florencecamping.com/en/Fiesole_Home.asp\" onclick=\"window.open(this.href);return false;\" class=\"postlink\">http://www.florencecamping.com/en/Fiesole_Home.asp</a>\n<br>\n<br>Have a great holiday! \n<img src=\"./images/smilies/icon_biggrin.gif\" alt=\":D\" title=\"Big Grin\">",
    "lastEdited" : "Sat Aug 20, 2011 7:47 am"
  }, {
    "postId" : "606885",
    "author" : {
      "username" : "jmcc",
      "userId" : "Unknown",
      "joined" : "-",
      "profileRank" : "-",
      "location" : "-",
      "postCount" : "-",
      "avatarPath" : null
    },
    "content" : "Back from trip so thought I'd report on our trip. \n<br>\n<br>Day 1: Drove from Calais towards Reims, stopping at Guignicourt. Nice campsite and good steak at bar-tabac in town.\n<br>\n<br>Day 2: Had a look around Reims before heading on towards Basel. Didn't make it in day so stopped in Belfort where we found another good campsite near a lake not much going on in town on Sunday night, but a couple of restaurants in square (bit of a trek from campsite).\n<br>\n<br>Day 3: short drive to Basel where we overnighted on a friends drive ANC enjoyed a say chilling out.\n<br>\n<br>Day 4: target was Lake Como but had to cross Switzerland and didn't want to fork out for a vignette so avoided motorways. This was a challenge but not impossible. Went over the Gotthard pass and found a campsite on the southern side of the pass in Chiggiogna. Seemed ok but expensive (36CHF), and had railway, motorway and river which were all noisy nearby.\n<br>\n<br>Day 5: made it to Lake Como and the Camping Europa in Menaggio. Crowded site on lakeside, but friendly staff and good base for visits to the central part of the lake. Stayed 2 nights.\n<br>\n<br>Day 7: Lap of the lake (clockwise) visiting various towns on the way, including Bellagio, before heading down to Como itself. Looked at campsite here, but decided to go to Montorfano instead. Ok site and cracking restaurant in the town - after sampling many establishments offerings, I'd say this is the place to go for Tiramisu... Yum.\n<br>\n<br>Day 8: drove to Milan which was underwhelming, so we headed on to Genoa and tben east to spend the night at a campsite on the beach in Chiavari. Again expensive, and possibly the smallest pitch in the world sandwiched between the office and a static home! Barely room enough to open the side doors. Some great restaurants in Chiavari but some were queuing out the door from quite early.\n<br>\n<br>Day 9: morning drive to Levanto where we stayed at camping Cinque Terre which was nice, clean etc but again, pricey. Train to cinque Terre to look around - lovely area but maybe a touch too touristy for some.\n<br>\n<br>Day 10: headed west in search of sandy beaches and ended up in Cannes after a couple of laps of Monaco \n<img src=\"./images/smilies/icon_twisted.gif\" alt=\":twisted:\" title=\"Twisted Evil\"> (average speed about 10mph)\n<br>\n<br>Day 11: beach day \n<img src=\"./images/smilies/icon_smile.gif\" alt=\":)\" title=\"Grin\">\n<br>\n<br>Day 12: headed north from Cannes up the Route Napoleon (tricky to follow in Cannes). Fantastic drive, stunning roads, beautiful views. Paused at the Citroën museum on the way which was interesting. Stopped at Digne-les-Bains at the camping des eau thermes (I think!).\n<br>\n<br>Day 13: continued up Route Napoleon to finish at vizille, just before Grenoble. Lovely town and the grounds of the chateau are stunning.\n<br>\n<br>Day 14: visit to the museum in the chateau before continuing North, mainly on Autoroute, to Dijon.\n<br>\n<br>Day 15: look around Dijon before driving cross country to Troyes and then back on Autoroute to Reims. stayed at campsite in Bourg et Comin which was nice though facilities a touch unfinished. Excellent restaurant on campsite.\n<br>\n<br>Day 16: return to Calais then Brighton. 3500km completed (4090 on clock but speedo overreading!)\n<br>\n<br>General observations: camping in Italy is expensive and Generally dusty and crowded. Also often noisy. French campsites typically excellent. Route Napoleon is a must, and I hope to go back in something sportier one day!",
    "lastEdited" : "Wed Sep 07, 2011 9:43 pm"
  } ]
}